[
    {
        "name": "t3_j1x49j",
        "created": 1601406323.0,
        "ups": 17,
        "downs": 0,
        "title": "Here to give some practical Mental Health Care tips & tricks",
        "selftext": "Hi!I’m Noreen Choudhri, clinical psychologist with 7+ years of experience (Owner &amp; Founder of Made in Mind,  Rajasthan, Jaipur, India)For my previous post ( on a different subreddit) I received so much of appreciation and response (also an award 😊) which motivates me to do this.Based on the common complaints and strategies I have suggested people with mental health issues. I will be giving you one tip on a weekly basis that you can implement in your day to day life. Also try it for at least a week or 10 days consistently to see any improvements. It may work for some and may not work for others. Tip 1 STOP TRYING TO STOP OR CONTROL YOUR NEGATIVE THOUGHTS It is not possible to stop or control your thoughts.A lot frustration stems from trying to control your thoughts.Thoughts  come and go. Trying to control what thoughts occur when, or trying to stop certain thoughts from happening altogether, is a poor use of your time and energy.Try this Experiment-  Try NOT to think of a PINK ELEPHANT, it actually makes it more likely that you will. It’s called Ironic process theory, and refers to the psychological process whereby deliberate attempts to suppress certain thoughts make them more likely to surface.What you can do or learn to do is accept that you can’t control thoughts, develop the skill of observing mind-made activity (thought production) without getting caught up in it. With consistent practice, you’ll discover for yourself that the content of your mind does not matter. What matters is how you let it affect you. Thoughts and emotions are like clouds floating across the sky: instead of getting lost in them, you can choose to watch them come and go.",
        "tags": {
            "symptoms": [],
            "causes": [],
            "asked": [],
            "asking": []
        }
    },
    {
        "name": "t3_jr26c0",
        "created": 1604972341.0,
        "ups": 1,
        "downs": 0,
        "title": "The boy from Fresno",
        "selftext": "I live in LA and he lives in Fresno am I going to get my heart broken??? Yesssssss but i love him so much. How do we love people we’ve never seen in person? Like we click so much a lot ! We were just friends before we started talking. There was a lot of miscommunication once we did start talking like that but we always get through it. But he’s so far. One time he had completely ghosted me bc his uncle died in India I believe and he came to LA and he tried to call me and I had his number blocked. I could’ve met him but I was trying to move on from him bc he ghosted me anyways we fixed that situation but it’s like bru how is this even going to work? I don’t wanna be something you got to do every time you come to LA. We literally like a lot of the same things. We both I guess bonded over our cars bc we both have bmws and that just kinda led us to talking more and more. I have ghosted him before as well bc well he’s so far from me my parents are strict they would never let me go to Fresno and honestly I don’t want to go to Fresno lmaoo I want him to form to LA a few times then I’ll go over there but it just sounds like this won’t workout.",
        "tags": {
            "symptoms": [],
            "causes": [],
            "asked": [
                "therapist"
            ],
            "asking": [
                "talk to someone"
            ]
        }
    }
]