[
    {
        "name": "t3_jvbpon",
        "created": 1605579045.0,
        "ups": 61,
        "downs": 0,
        "title": "DAE get so anxious that hunger just goes away?",
        "selftext": "Like, my anxiety is so high and at a point where eating just isn't a concern anymore for me, I'm just not hungry. And if I think about food it just makes me gag and wanna throw up. Like I know I need to eat but I feel no need for it because my mind is just racing with other stuff. Anxiety is so weird like wtf, I'm anxious about possibly being hit by a car that's 100 feet away because there's a slight chance it'll swerve/ lose control and hit me, but not feeling hungry anymore is just a meh, whatever"
    },
    {
        "name": "t3_k1crk1",
        "created": 1606414424.0,
        "ups": 2,
        "downs": 0,
        "title": "I feel like a failure.",
        "selftext": "Hi, I'm a 20 year old student from India studying in Mumbai, I'm in my final year of Bcom. graduation and I'm totally lost about what I'm gonna do in life. I joined a coaching class earlier this year and was very excited to study for the entrance exam to get into few of the most prestigious MBA colleges in India (IIMs) but Covid ruined everything and I had to come back to my home (which is a 1,000 kms from mumbai). I couldn't prepare for the exam and now I'm lost. I don't know what to do. I tried applying for a company in the Placement Cell of my college and the interview didn't go that well so the college management kicked me out of the cell. It's been eating me since two months now. I can't focus on anything. I can't sleep properly. I don't feel good, I don't feel happy. Although I've always been good at academics, I feel like a failure. Can someone please help me?"
    },
    {
        "name": "t3_k1hpvy",
        "created": 1606435366.0,
        "ups": 1,
        "downs": 0,
        "title": "I am an artist. I dance since 7years and make music since 1.5 years now. 2 years back I started having terrible anxiety problems, i have no idea how many times i might have tried killing myself. Because i was unsure of my life, my career, my dreams.",
        "selftext": "At a certain point i used to question myself a million times with zillions of answers which made no sense. False assumptions, overthinking, self-doubting, stress, depression, mental breakdowns, panic attacks all these started happening. When i finally decided to find a solution to feel better. Every day little by little  I started writing lines, (also i am an Indian but i love making English songs) I love music, with the help of youtube tutorials i started making beats using FL , little by little everything added up. I started getting sleep at night used to wake up early just to make songs and vibe with myself. And then i made my first song yet i was unsure if i should share it with people or would they like it or not as i am from India will they like to listen to it or not. But i gathered my gut and made one of my friend to listen to it and she gave a very positive response and like that i started my music journey. And now when i look back i feel i still have those anxiety issues with me but now i have the strength to fight with it. There is always a way. Ive got much love from people throughout the world in my dance and music career both! And i feel blessed. Dont forget to thank God always. Its life its gon be tough! But you know deep inside what you can do just hold on to it. And the only thing you can do it. BELIEVE IN YOURSELF. THE UNIVERSE WILL MAKE WAY FOR YOU!"
    },
    {
        "name": "t3_jujozr",
        "created": 1605463521.0,
        "ups": 0,
        "downs": 0,
        "title": "Worried that my non-racist, well-intentioned art looks like blackface, and I'm getting super anxious",
        "selftext": "I'm a 15-year-old who likes to do art, and I have a made-up country. The people who live there are entirely fictional, and I base their personalities on those of people I know or may have heard of (like celebrities), regardless of ethnicity. I give the major group of people here grey-skin because it has no comparison in real life and it won't offend anyone. Generally I try very hard to make sure this made-up country isn't a sick white-privilege escape fantasy, and to make sure I'm not being racist as I make it up. A fair amount influence for this land comes from the countries that my rather diverse heritage originates, specifically the places I have cultural connections to, not just ancestral. I look white, but my grandfather is not; he has dark skin and is from the far eastern islands of Greece, with Turkish and Middle-Eastern ancestry, and he doesn't consider himself white. On top of that one of my great-great-great grandmothers was black, from the Andaman and Nicobar Islands in India, though I have no cultural connection to this and I don't boast about it.Anyway, as for my art. My concern lies with my drawings of the people of my country, which are not black, white or anything real; they're just made up, unique humans from this fictional place, who act just like normal people and aren't supposed to be primitive or anything. But I have gotten super worried that some of these characters resemble blackface caricatures of black people, which is the absolute last thing I ever intended. Nobody has ever told me that my art is racist, but some people I've shown this art to have noted it resembles blackface, but assured me I wasn't doing anything wrong, and that they wouldn't have noticed so if the black lives matter protests were not ongoing. Personally, I am not just a non-racist, but an anti-racist; I am very educated on racism and solutions to fix it, understand structural racism, call out any racism I see, and I have been on BLM marches. If I do ever draw black people, I do it with the utmost respect and conscience, never wanting to contribute to the horrible racism they endure. But with this art, even if I haven't drawn many characters with this particularly dark shade of grey, or have any intentions of associating it with Africans or Blackface, still worries the shit out of me that it looks too racist for words. I can't figure out how to attach an image of the art to this post, but what do you think?"
    },
    {
        "name": "t3_j1x4u9",
        "created": 1601406397.0,
        "ups": 41,
        "downs": 0,
        "title": "Here to help you with some Mental Health Care tips &amp; tricks",
        "selftext": "Hi again!I’m Noreen Choudhri, clinical psychologist with 7+ years of experience (Owner &amp; Founder of Made in Mind,  Rajasthan, Jaipur, India )For my previous post ( on a different subreddit) I received so much of appreciation and response (also an award 😊) which motivates me to do this.Based on the common complaints and strategies I have suggested people with mental health issues. I will be giving you one tip on a weekly basis that you can implement in your day to day life. Also try it for at least a week or 10 days consistently to see any improvements. It may work for some and may not work for others. Tip 1 STOP TRYING TO STOP OR CONTROL YOUR NEGATIVE THOUGHTS It is not possible to stop or control your thoughts.A lot frustration stems from trying to control your thoughts.Thoughts  come and go. Trying to control what thoughts occur when, or trying to stop certain thoughts from happening altogether, is a poor use of your time and energy.Try this Experiment-  Try NOT to think of a PINK ELEPHANT, it actually makes it more likely that you will. It’s called Ironic process theory, and refers to the psychological process whereby deliberate attempts to suppress certain thoughts make them more likely to surface.What you can do or learn to do is accept that you can’t control thoughts, develop the skill of observing mind-made activity (thought production) without getting caught up in it. With consistent practice, you’ll discover for yourself that the content of your mind does not matter. What matters is how you let it affect you. Thoughts and emotions are like clouds floating across the sky: instead of getting lost in them, you can choose to watch them come and go."
    },
    {
        "name": "t3_jdfxta",
        "created": 1603054840.0,
        "ups": 1,
        "downs": 0,
        "title": "Should I use Medication?",
        "selftext": "I wanted to know if the following has been everyone’s experience and should keep working on it or should I use the anti-depressants my doctor prescribed me for Depression/Anxiety to help me further - Lexapro 10mgI think I have social anxiety, I was diagnosed with Depression and Anxiety after a day long evaluation and tests, this is what I feel in certain situations:Parties - Going AloneBefore the Event:Before going to the party/social event I would sign up get excited but right when the moment arrives when I have to show up my mind gets filled with thoughts like - Should I go? Who would I talk to? What would I talk about? And then keep making sure I look good multiple times? Etc.During the Event:and finally when I do show up after wasting some time, I see all the people in events being in groups, I won’t know how to approach the group and due to the fear of looking awkward standing alone, I quickly run to the food section, etc trying to look busy and then slowly start with finding smaller groups or people from my same race (Originally from India), because it’s easier to connect with them about something. The conversation:I tend to stick to the usual boring questions which even bores the shit out of me, about work, location, and other boring small talk. After I’m done with smaller groups and my nerves are eased I try to approach bigger groups, this is what happens when I do that - I introduce myself, and asking some boring small talk shit out of context when the others are clearly already in a different conversation, then try to listen to what they are talking about while my mind is internally racing thinking listen to what they are talking, say something, say something, say something and then I just hang around in the group smiling, nodding and boring myself and not even being sure how to exit the group, so I just stand there doing this for a long time, by this time I’m standing there awkwardly and not even concentrating on the conversation.After the event:I feel very stupid and angry that I was not able to connect with anyone and had to go through that dreadful couple of hours and then start to get depressed about my social skills. Growing up I have always been quite shy, mostly had small limited group of friends, met my ex girlfriend through college in the same class, etc. I have been trying to work on my social skills and these are some of the things I have been doing which I think are helping:- Pushing myself to talk to random strangers - Either compliments, questions, and then trying to make some small talk- Trying new things like Karaoke, my hands and body were literally shaking on the stage, I just held on to the mic with all my power in order to control the shaking and not look stupid. I usually get these shakes during beginning of interview, verbal confrontation with someone, talk in front of a class.- Bodybuilding, cardio and healthy diet - this has been making me feel more happy and confident - One thing I definitely realize now is I tend to think people are looking at me, judging me or laughing at me,  but in reality no one gives a fuck about my mistakes, etc. I’m trying to work on this as well and Maybe I also need to work on some self esteem issues?All the above have definitely been helping with the nerves as I can notice I’m definitely more willing to jump into an anxious Situation/take action now, while still learning the basics of social situations, conversations, social awareness, body language etc. Should I continue to do this or start the medication as well? Anyone who had similar problems, how did you overcome them?"
    },
    {
        "name": "t3_jpcs4t",
        "created": 1604723398.0,
        "ups": 1,
        "downs": 0,
        "title": "I am having anxiety and elevated heart rate, just by looking at people.",
        "selftext": "I, 24, M from India, single for all 24 years, am a happy fun loving introvert, who travels a lot, loves and treats my car and my bike as if they were my family, who came from a family of lower middle class now owns and runs a startup and quite frankly had a happy life(well, most of it) untill June 21st 2020 which is when I decided to commit suicide because I couldn't ignore the fact that my life will be miserable forever, becausing I am hiding the pain underneath the happy face and was afraid of relationships because I witnessed in first hand, what a failed marriage could do. My parents fight, just like any other family, but they are doing it from way long before I was born. And one fine day I had enough of it, there was a big fight that day and I decided that I will kill myself, but failed to do so because I met a girl. (How dramatic? Ikr!)We became instant friends, and she was the only reason I couldn't proceed. I moved out of my home for a month and was wandering in all the permitted places sleeping in my car, etc., it was still lockdown back then. And we used to communicate thru insta and whatsapp and we kinda grew close, atleast I did. And slowly I fell for her, in my defence I wasn't exactly thinking at that moment. Days passed by and she started to text less all of a sudden but she would ask me for help if she ever needed it, other than that she wouldn't reply for a text for 3 days but would talk with me for 5 hours the day after. So, it was impossible for me to decide to move on or to know what's going on. Also, she was the only string that stopped me from committing again. And after three months as it turns out I asked her out and she straight out rejected as it would never ever happen. She made that clear. I tried to be friends with her, she was okay with it, but she didn't reply at all for most days which started some serious anxiety issues and depression and so, I tried to move on. It's been 2 months and I can't sleep because as soon as I close my eyes the thought train would go back to her I can't watch movies and tv series, because every actress reminds me of her, I couldn't browse instagram, I couldn't talk to people, So I uninstalled all social media apps except for reddit, honestly I could never go back to my normal life. I mean, am not madly in love with her or anything. I mean, I don't know, I could be, it was a weak moment when I fell for her, I was never this stupid in my life, this is the first time I am experiencing this feeling, to wanting someone who doesn't want me. Honestly tho, there is a lot more to story, it turned out that she was only using me but I won't tell that part of the story, so I really don't want her back in my life. But I still can't stop thinking about her.And today I came out for a drive and I saw someone who looks a bit like her on the road and I suddenly have anxiety building up and an elevated heart rate, and I couldn't drive anymore. I stopped the car and just drank some water, and I saw some other girl crossing the road I have the elevated heart rate again and this happened with everyone I saw on the road, I freaked out and came back home.This could be the stupidest thing you ever read, I would feel the same way. But, I really don't know what else to do, I tried to talk with 2 of my friends and they both freaked out so I quickly changed the subject. Anyone ever felt this way? What should I do? I can't stay indoors forever neither can I completely stop looking at a complete gender."
    },
    {
        "name": "t3_jjso50",
        "created": 1603936362.0,
        "ups": 1,
        "downs": 0,
        "title": "I can't make a decision...",
        "selftext": "I've (F26 from India) been suffering the impact of what I feel is ocd, depression, social anxiety and panic a lot lately. My general physician recommended me a good Neuropsychiatrist a while back. I'm considering going now that I'm feeling really into depression and anxiety.But there's 2 things that's keeping me from going, so please help me make a decision...1. Does every psychiatrist talk to the patient alone? I'm too scared to let my family know any details about this and am really scared that the doctor will start asking questions in front of my family member. I'm scared the room won't be sound-proof, so anyone outside can hear the conversation. Will all my details be kept totally confidential?2. Do the doctor always prescribe medicines? I'm very uncomfortable taking medicines (have had to take so many medicines for other illness recently). Can it be only therapies or something?Please let know from your experiences. It'll be a lot helpful for me to prepare for the visit. Thank you."
    },
    {
        "name": "t3_jb7al9",
        "created": 1602731457.0,
        "ups": 1,
        "downs": 0,
        "title": "Am I just anxious?",
        "selftext": "I dated this girl for 3 years and was hopelessly in love with her. She broke-up with me 3 years ago but we have talked to each other sporadically after our break-up. I never called her after 5-6 months of our break-up. I mean, I was calling her for 5-6 months after our break-up because I didn't want to let her go. But I stopped calling her after that since I knew that she is not going to come back and I ought to move on. But she used to call me sporadically after one year of our break-up(5-6 times a year). She was also dating a guy after our breakup but her boyfriend wasn't aware of the fact that she sporadically calls me. One thing was common whenever she called me; she bitched about her boyfriend. And I never hung up on her because I didn't want to hurt her so I listened to her whining about her romance. Now, during Covid19 lockdown she broke up with her boyfriend(she told me that). And we are in the same city now and suddenly her calls and texts are coming almost daily. I mean I ignore her texts by replying late and sometimes leaving her on seen but she still manages to find a way to talk to me. And I talk to her because I don't want to hurt her. When I leave her on seen she asks me if I think that she is only talking to me because she doesn't have a boyfriend. And out of kindness I say that I don't. One thing which I would like to mention is that when she had a boyfriend she didn't like me calling her and was very explicit about it. One day I drunk called her when she had a boyfriend a she explicitly asked me to not to call/text her.  Now, I have 2 problems -First, that I don't wanna hurt her but want to tell her In a polite way that I don't want to talk to her and since I care about her I can't be blatant about this.Second, she is preparing for some examination and she is working hard for it. And most of our conversation nowadays is about studies since I'm also preparing for public service examination. So the problem is when she can't score good in mock tests she calls me and tells me things like she feels like killing herself. And I'm a very anxious person and this exacerbates my anxiety and I start thinking about things like what if she really does that. Would I be charged for abetment because I am taking to her. Now, I know that this will be no case of abetment even if God forbid she does that. But since I live in India I still want to play safe and don't want to go through any legal process since that could be tedious and heavy on my pockets. And this is also why I don't want to talk to her because I don't know if she says those things casually or she means them. Please help!"
    },
    {
        "name": "t3_ib0056",
        "created": 1597639358.0,
        "ups": 6,
        "downs": 0,
        "title": "I'm not sure if this is the right subreddit. But please help me.",
        "selftext": "I think I'm going into major depression that I've been ignoring for a long time without realising it. I don't feel good about things I usually enjoyed. I don't get good sleep (usually experiencing certain nightmares about things a normal person won't even care about. Like I feel bad about saying things that may or may not have affected others but have started to part away from me. My gaming friends that I don't even know personally have started parting ways from me and gaming was something I truly loved and enjoyed spending my time. I thought losing contact and deleting them is the best way I can find peace and not be treated like shit.) I don't eat well (basically loss of appetite). I've stopped enjoying food. My professional life has taken a toss for over a year and half now. I'm not finding a job that I would truly enjoy and been rejected over and over again for certain gap in my work experience. I have I've come to a point that I have started questioning my existence. I don't know what to do. I can't concentrate or remember sometimes, when my brain is a memory tank. I could remember any good or bad conversations I've had with any person if I want to. With that sometimes I feel it's a curse because I can't let things go and the stupid memory keeps haunting me. I'm a very simple man. I come from India and such a thing is usually laughed at and taken as a joke. I hope I can find some answers and suggestions that can help me lift up. Thank you."
    },
    {
        "name": "t3_ikkcoq",
        "created": 1598996109.0,
        "ups": 9,
        "downs": 0,
        "title": "I'm Breaking Down",
        "selftext": "I'm 20 yo Male from India. Last few days have been tough. Really tough. I want to cry so bad, and the funny thing is I don't know why. I'm afraid all the time. I am feeling so dizzy in the head that I think I'll pass out due to this. I'm afraid of even slightest change. A change in college time table flipped me today.I have this gorgeous future planned out in my head but I am losing so many tiny everyday battles that I'm afraid I'll forever be a loser.I so wanna crush my academics but I just cannot start with anything. I feel pity for myself and so low that I cannot even share these with anyone. I feel my reasons and my anxiety would be ridiculed and made fun of. I'm not dumb. I learn and understand pretty quickly. But it's the work itself that traumatises me.I don't know whether this post is making sense or not. I just need to put everything out there for others to see.Please help me with anything you can. I really need some help."
    },
    {
        "name": "t3_hqttqx",
        "created": 1594725256.0,
        "ups": 1,
        "downs": 0,
        "title": "Wish I just died. Work anxiety is getting to me. First post here. Sorry if I broke any rules.",
        "selftext": "They are not getting enough business to pay our salaries is what they claim. So they're making us work unnaturally long hours and weekends. I can kind of understand their plight, but they are now exploiting us for practically half the usual pay.This has been going on since the past 2 months. All my colleagues are working like this, but it seems that only I am the one getting stressed and anxious. It's come to the point that I don't feel like working anymore.I wanna quit, but I have no jobs lined up. Honestly I just wanna relax for a few months. Get in touch with my hobbies, my friends, my family. Have some time to myself. Not be anxious about getting more work. Checking my phone every now and then to see if I'm getting another project to do.Unfortunately, I don't have any leaves to take and I have to give a 45 day notice period when I resign, so there's that.I made a fuss about quitting to one of my colleagues. As a result, they didn't give me any work yesterday, but the others were working all night. This makes me worry because now they'll say I've had my break and give me more work sooner or later.I think I've become very lazy and burnt out. I just don't wanna deal with any of this anymore. Sometimes I wish I just didn't wake up in the morning. Sorry for this wall of text, it's my first post here. Just wanted to vent."
    },
    {
        "name": "t3_iin85y",
        "created": 1598708616.0,
        "ups": 2,
        "downs": 0,
        "title": "I said something wrong in class and my anxiety will eat it up",
        "selftext": "Okay. I am writing this only after it has happened. In my media class we were supposed to discuss our blog proposals and justify why we have picked a certain topic and how will it processed. I don’t know why it came to my mind to say India is part of South-East Asia. And the professor said it’s not, obviously, it’s part of South Asia. I couldn’t use my fucking brain and actually think it over and said that acc to me it’s in the region i mentioned. And of course I was fucking wrong. It’s something I should have known cause it’s a basic thing we learn in school. And for the course I am doing, it doesn’t seem excusable? I know I will downplay it right now but overthink it later. I have struggled with this since my two years in college. I can’t stop my mind from replaying the moment. I know it’s not a big deal and yeah it was a stupid mistake. But!! My mind has a mind of it’s own. I wrote a really good proposal, even the prof said the idea was impressive but the fact that I couldn’t justify it properly will eat me up. I am embarrassed but I don’t want my anxiety to feed on it because I already have low self-esteem and other things I am dealing with. I also feel like in my last year of college I should be over these things by now. Such situations always see me spiralling down instead of being motivated to do better. Maybe I am weak-willed and a weak person generally."
    },
    {
        "name": "t3_ha3qx0",
        "created": 1592341989.0,
        "ups": 12,
        "downs": 0,
        "title": "I want to take a break from reading the news, but it’s almost like I’m addicted to it",
        "selftext": "Everyday I wake up and check the news, particularly news about other countries. And every time, I’m bombarded with news which just further amplifies my fear of war. Not that war is more likely now then ever before, I know in the non-anxious side of my brain that this just isn’t true. It’s just that my anxiety is in a phase where it’s pelting me with what if scenarios about how one tiny border scuffle across the world will somehow lead to my fiery death via nuclear bombI want to stop this fear in its tracks by just not reading the news, and not going on Twitter or subs like r/dankmemes that exaggerate news stories. But I feel like there’s a part of me that’s like: “Well, what if something big does happen? Suppose there was a big war declared. Wouldn’t it be best for you to know, rather than remain blissfully ignorant?” And that’s where I’m stuck. It’s like I have an addiction to reading the news. Whenever I’m doing something calming, my anxiety seems to always bring up the apparent need to read the news, and my heart races and my anxiety increases until I finally stop what I’m doing and read the news. And then there are times where I’m just on Twitter trying to find out what’s happening in the NFL world or something when a certain story I’ve read about in the news is trending. And instead of people rationally replying to this news saying “oh I hope they resolve their conflict peacefully like they keep saying they will,” they automatically jump to it being World War 3, because the “2020 is the apocalypse” meme just gets funnier every time they repeat it. And these “jokes” will catch on in subs like r/dankmemes, and further expose me to my worst fearsI feel stuck between the options of not watching the news and being blissfully ignorant of the possibility of war, and watching the news and exacerbating my anxiety. I need advice on how to get past this. Thoughts?"
    },
    {
        "name": "t3_hjrebb",
        "created": 1593697996.0,
        "ups": 2,
        "downs": 0,
        "title": "I can’t stop overthinking and I’m scared it’ll affect my relationship.",
        "selftext": "I’m trying to have it so my boyfriend doesn’t constantly need to reassure me but the second he doesn’t, I overthink SO much to the point where I stress myself out and I literally end up crying. I try calming myself down, sometimes I try calling him but when he’s out with his friends and doesn’t pick up, I swear it’s the end of the world. What are some ways you help call yourself down?"
    },
    {
        "name": "t3_hjr1f6",
        "created": 1593696345.0,
        "ups": 6,
        "downs": 0,
        "title": "Late night anxiety",
        "selftext": "Currently sitting on my bed rocking back and forth because it somehow soothes me. There’s a muscle in my arm that’s been twitching for the last hour. My throat feels like it’s closing up, it’s not as bad as it was so I can actually breathe without it being hard. Obsessing over everything I have said to the guy I’m talking to from the second my extremely drunk ass met him on June 12th. Writing this helped a lot. My anxiety is still really high right now, but definitely better than it was. I’ll probably pull an all-nighter. Why does this make me feel like I’m losing my fucking mind?"
    },
    {
        "name": "t3_hjq5s1",
        "created": 1593692200.0,
        "ups": 5,
        "downs": 0,
        "title": "I feel like there's no hope for the future",
        "selftext": "Every time I get ahead of my debt I lose my job, I have a job now and it seems stable but how much longer will I have my job for?It seems like every company I work for seems to know when I'm making progress on my debt and decides to screw me over, like back in February I was 2 pay days away from paying off my credit card but then they made me take 3 weeks off and let me work 3 days then on Feb 19th I got laid off with barely enough money to make it to EI but I had to max it out to stay afloat for car repairs.I have a job now but it's less than half of what I used to make and now I wonder if I'll ever pay off $15,000 of debt, don't get me wrong I'm grateful for this job but somedays like today I just want to claim bankruptcy and let it all go"
    },
    {
        "name": "t3_hvc6q3",
        "created": 1595382854.0,
        "ups": 2,
        "downs": 0,
        "title": "Need Help ; Don't know how to get it.",
        "selftext": "22M here! I live in India, and therapy is kinda looked down on. When it's not, it's really expensive. I've been having anxiety and anger attacks for the past few months. I used to live by myself, but came to my Parent's place in March, before the COVID scene. I'm extremely incompatible with my family, and haven't spent this long with them in the last 7 years. The cherry on top is that my job is fucking me over as well. Everything is adding up, and I am unable to cope.I haven't slept for about two weeks now, and have been having suicidal thoughts for the past few months. I've also started hurting myself to release the frustration, but it's not sustainable. I just want to feel normal again..."
    },
    {
        "name": "t3_hjrud1",
        "created": 1593700119.0,
        "ups": 2,
        "downs": 0,
        "title": "I’m having trouble talking on FaceTime with my friends",
        "selftext": "Usually before the pandemic stuff started I was really social but now I just feel off, recently I’ve been getting better but I haven’t really gone on the Group FaceTime’s cause I used to be insecure about not being funny even though everyone says I’m funny. I have been depressed a lot through this time period though and I’ve had some drama with someone which has made me feel different and not the same. I feel a lot better a lot better now but now going back in the group face times just make me realized how everyone else has changed and I just sit there quietly now and I feel really confident at first but then I join and immediately realize something and I can’t really relate cause they’re talking about something that’s within the friend group, they’ve all been getting close but I’ve been here trying to fight my way out of my depression. Also it kinda makes it awkward to talk cause there’s this girl I used to be best friends but we started fighting a lot recently but we made up.Any advice helps thanks"
    },
    {
        "name": "t3_hf8vv0",
        "created": 1593059629.0,
        "ups": 3,
        "downs": 0,
        "title": "Anxiety about current events and WW3",
        "selftext": "With everything that's gone down this year, China and India's border tensions, those articles about China plotting to EMP the US, on top of climate change, my anxiety is through the roof. I feel like because of the world, I'll never get to grow old or have a kid and show them the world. It just has me really anxious and depressed. Is there any way to put my anxiety to rest? I know its an unrealistic worry but I can't help but worry about WW3 and climate change."
    },
    {
        "name": "t3_hxhata",
        "created": 1595682933.0,
        "ups": 2,
        "downs": 0,
        "title": "Heart starts pumping hard the moment I wake up",
        "selftext": "I hate my job. I don't want to do it anymore. I wish I could do a job which is simple, where I can't mess things up. It's OK if it paid a little less. I just need less working hours, an easy to do job, weekends off and peace of mind. Don't think there are any jobs like that where I am situated, but I wish they did. It is just too difficult for me to deal with my life.I am a 3d visualiser for interior design projects, situated in Mumbai, India."
    },
    {
        "name": "t3_drgb27",
        "created": 1572895559.0,
        "ups": 1,
        "downs": 0,
        "title": "Anxiety about potential Monkey \"scratch\" in India",
        "selftext": "Hey all, this is my first post. Yesterday I went on a hike where a family of monkeys were hanging out. This is southern India so it was the bonnet macaque. Anyway, I sat down and had my bag on me with water. A younger monkey got on my bag and climbed onto my shoulders. I didn't fight it off I just relaxed and for it to get off. It seemed friendly and got off after a minute. While he was on me I felt a little pick at my skin. IDK i it was a scratch, a bite, or if he was just grooming. I immediately went to the ER hospital for suspicion of rabies next to where Im staying to get checked out. The ER doctor said I was fine and checked my neck and back. My friend said he didnt see anything on my back and my preceptor for my India Pharmacy rotation said he didnt see anything and told me that it mostly comes from dogs in this area. Im still anxious as all hell and the ER doctor told me that she could give it if she wanted me to but she didnt recommend it. Its been almost 24 hours so Im still anxious as hell after going through the internet. I do suffer from anxiety but nothing diagnosised yet. I plan to go to counseling when I get back. I worry about every little thing"
    },
    {
        "name": "t3_fcx9dh",
        "created": 1583282357.0,
        "ups": 9,
        "downs": 0,
        "title": "Coronavirus in my city. My anxiety is going through rough.",
        "selftext": "My time has come. It feels too real. 3 students from china, australia. They are under quarantine for 29 days. It's a small city. State media is showing the news don't know about national ones. It's true coronavirus has spread we don't know because we aren't testing. Like my parents are old. I'm so worried, I can't sleep.Country- India"
    },
    {
        "name": "t3_gqaapx",
        "created": 1590439252.0,
        "ups": 3,
        "downs": 0,
        "title": "Ashwagandha for anxiety?",
        "selftext": "Anyone ever use the stuff? I'm on day 3 and I definitely feel a lot calmer, yesterday afternoon into evening I felt an extreme calmness over me, could just be placibo but I'll take it lol Studies show it really starts make a difference the longer you take it..The pills I take are 600 mg ashwagandha and 200 mg l-thenine, I take 1 pill every 12 hours.. Anybody with experience taking it over a long period of time?..ASHWAGANDHA: NATURE’S GIFT FOR ANXIETYAshwagandha is probably one of the most popular and prescribed herbal medicines at the Holistic Medical Centre, by our doctors and naturopaths alike. As a result, we thought this wonderful herb deserved a special introduction of its own.Also commonly known as Withania, ashwagandha is a herb native to India, Northern Africa, and the Middle East. It has been prescribed by Ayurvedic practitioners for thousands of years and has many studies supporting its safety and efficacy. Traditionally, the herb has been used to support convalescence after a period of illness. However, its ability to reduce anxiety symptoms, boost mood and strengthen the body against stress and fatigue has made it a valuable tool for combatting these common ailments of modern society.Through supporting adrenal performance, calming the nervous system, and enhancing immunity and brain function, ashwagandha has an excellent all round ability to support individuals through prolonged stressful periods that all too often result in further health disturbances. As a result, the herb has become a firm favourite in our practice for helping our patients to cope with stress and anxiety, as well as reducing associated symptoms such as mood and sleep disturbances, heart palpitations, feelings of overwhelm, and heightened sensitivity to stimulation.Preliminary trials have found ashwagandha to be as effective as some prescription anti-anxiety and anti-depressant drugs. Additionally, it has been shown to lower the production of the stress hormone cortisol which is often elevated in stressed individuals (on the flip side, it can also increase cortisol in people with low levels of this hormone). It is thought to exert many of its calming effects affects via stimulation of GABA activity – a natural hormone produced by our bodies to calm and relax us.As with many herbs, ashwagandha has numerous beneficial therapeutic actions that make it an excellent medicinal herb to use for the many conditions associated with or exacerbated by, anxiety, these include:Reducing anxiety and calming the nervous systemProtecting against the effects of stressImproving sleep qualityEnhancing learning and memoryIncreasing libido in men and womenSupporting convalescence after illnessEnhancing immune functionHelping ease inflammatory conditions such as arthritis and painful jointsSo you can see why we find this herb so beneficial in our practice!"
    },
    {
        "name": "t3_hb6il7",
        "created": 1592478745.0,
        "ups": 2,
        "downs": 0,
        "title": "Idk I just wanted to let this out, since I got no real friends, I'll put it here!",
        "selftext": "I'm from India and recently (sadly) a celebrity in out country committed suicide. And everyone's like posting on instagram and shit about it. Idk what their problem is. I'm talking about some particular group of people. Context: So some of my classmates were getting expelled from the University I go to. Cuz they failed the exam. And there was a news that one of them committed suicide. And I saw the rest of them celebrating and smiling about it. They were glad that the university might reconsider their decision. What a bunch of asshats.Now they're posting like \"you can talk to me\", \"mental health\" ,\"suicide is not a joke\". And it gives me anxiety. Also I'm the only one who knows about it. So I couldn't keep it inside me."
    },
    {
        "name": "t3_hfc87s",
        "created": 1593071670.0,
        "ups": 1,
        "downs": 0,
        "title": "My Anxiety Has Been Crippling in the Last Year, Here's Why",
        "selftext": "I've suffered from anxiety for most of my life, however for the last ten years it's been pretty much okay. Then something happened a year ago that sent me into this tailspin that feels like it will never end. My husband and I were fortunate enough to live and travel abroad for ten years. We lived in Taiwan, the UAE, Panama, and Mexico. We traveled to other countries like India, Russia, Egypt, and many countries in Europe. Then in 2016 we bought a camper and drove from California to the southernmost point in Argentina. That took almost three years. One might think that all the uncertainty surrounding travel would induce anxiety but for me it made it easier. I had to get out of my head and solve problems and challenges every day. Language barriers, complicated border crossings, and all the other aspects of travel made me feel more in control and able to let go of the things I couldn't control. Plus, not being in the States was always a relief. Right before the end of our Pan Am Highway trip we received news that my mother in law was very ill with dementia and my husband (only child) felt we needed to return home to Hawaii to help. I was devastated because we had planned to ship the camper to Europe and continue traveling but of course I understood. So we sold the camper and moved back to Hawaii a year ago today. When we were getting on the plane in Santiago, Chile I told my husband, \"What if something happens and we can never leave again?\" Famous last words. So when we got to Hawaii I realized that neither my husband nor my father in law were prepared or capable to handle all of the things that come with end of life care. I took on everything. My mother in law died peacefully just before Christmas last year. My husband and I talked about leaving and going back to Mexico but he felt we should wait a few months to make sure his dad was going to be okay. Then COVID happened and the realization that the entire world is probably off limits to us. My anxiety surrounding caregiving was intense but now that I'm almost literally trapped on an island I'm having panic attacks almost daily. I work with a therapist and am medicated but every day I feel worse and worse. I can barely eat, I'm super jumpy all the time, and sleep rarely happens. I've never felt like this before. Every day feels like it could be the end of the world. And I ask myself, is this really how it's going to end?Thanks for reading."
    },
    {
        "name": "t3_gzewl6",
        "created": 1591701766.0,
        "ups": 3,
        "downs": 0,
        "title": "How do you guys calm anxiety from the news?",
        "selftext": "News has always been a major source of anxiety as one of my biggest fears is another war starting/nuclear war (yeah y’all can laugh but it’s terrifying) when dt and NK were feuding in 2017 (?) I was scared shitless, when the US and Iran tensions were rising i was scared shitless, I see news about China and India, NK and SK and overall it’s just really fucking scary. I avoid the news all together but sometimes it’s completely unavoidable bc a family member or friend will bring it up, or I’ll accidentally see it posted somewhere on twitter."
    },
    {
        "name": "t3_am24u6",
        "created": 1549057509.0,
        "ups": 11,
        "downs": 0,
        "title": "[India] Currently pushing myself to attend a marriage because of food. Wish me luck. I\"ll update you guys if possible.",
        "selftext": ""
    },
    {
        "name": "t3_ejbwiy",
        "created": 1578063947.0,
        "ups": 24,
        "downs": 0,
        "title": "Anxiety over the recent political news",
        "selftext": "Felt horrible when I read the news, with the fears that many have about potential war. Although I live in Australia, I’m still scared about the outcomes. Speaking to my dad, he reassures me this isn’t a global conflict (China and Russia, and other major players being unlikely to join the war). Nevertheless, I understand even a war between Iran and the US wouldn’t impact me definitively but the fear of escalation is still tingling me even after the initial shock.I feel like I felt when I heard about the India/Pakistan news a couple months ago. The same feeling of when WW3 was trending on twitter a couple years ago. Knowing those have not led to the wars that people perhaps fear-mongered about is some respite from the aftermath of the panic.Don’t know if I’m looking for people to tell me it’s alright, telling me the straight truth or telling me a white lie to feel better (what I think my dad does at times, or others in other posts).The rational part of me tells me not to worry about this, as even if it eventuates to my worst fears, I’ll be worrying about it twice. With a pretty important interview in a couple of days, I’m trying to stick that, but not sure how I’ll cope as more news comes out (although I’m making myself keep off it)."
    },
    {
        "name": "t3_fustyk",
        "created": 1586031858.0,
        "ups": 2,
        "downs": 0,
        "title": "Please read this and say something.",
        "selftext": "I am 18 years old from India. From a long time, especially the last 2 months, i have been really depressed and anxious about the future. I have a 16 y/o sister, whom i really love and care about. From last 1.5 year, she has been in a relationship with a boy who is 1 year older than me. My mother knows about this relationship, and she had no option, but to support it. My father, however, is completely unaware of this, and thinks that his daughter is very \"good\" in that sense. Both my father and my sister's boyfriend are complete bigots and full on narcissists. If my father got cognizant of the hidden relationship, he will do things, that even upon thinking, i hyperventilate and get anxious. On the other hand, my sister's bf constantly blackmails her into keeping up the relationship, that she is now REALLY NOT INTERESTED IN. However, i don't think that he blackmails for other more private stuff.  The basis of his blackmail is that he will tell my father about the whole relationship thing. Which, consequently, will make us all (me, my mother, my sister) liars in his eyes, which is BAD, SERIOUSLY BAD. My anxiety is crippling me, i am all the time tired, no motivations and no will to fight. It's like i am imploding, not exploding: i don't cry at all, i just sit and my body feels like it's getting more and more hollow. We run a pharmaceutical business, so after some research, i self prescribed a dose of pregabalin to reduce anxiety, without the need of acquiring a prescription. I have been taking it for like 5 days and it is showing lil effects. In January, most probably, her bf will go to Canada for study purposes, which will subside this whole mess. As of now, he has made attempts to call my father to tell him about all that, but he never said anything on phone, and just hanged up the call. There are less chances of him actually calling my father, cos he knows that it will certainly end the relationship. My sister is not at all interested in the relationship. She never ever complaints thought, thinking that it would make my mother and me anxious. She is very brave. Truly. My mother, who has suffered all her life from my ass father, also gets anxious and worried about the future. She also suffers from migraines, so more stress causes real bad headaches. Both of them are very brave and they are fighting for what could happen. But, I am not, I get super scared and anxious when all this happens. I don't know how to normalize, and feel ok. It's like eating me. Sometimes i think of real bad stuff happening to both the bigots, and sometimes i feel as cuffed and restrained. I know it's not life and death matter, but it's certainly not comfortable also. There is this fear that always lingers, about what would happen. Sorry, if this situation is not worthy of being with all of the other horrible situations, that people here go through."
    },
    {
        "name": "t3_gdisa9",
        "created": 1588650867.0,
        "ups": 1,
        "downs": 0,
        "title": "Anxious and in love",
        "selftext": "I am 27M about to turn 28 this Aug. Although I have not been diagnosed with any form of anxiety or depression yet , that's probably because I have only seen a couple of therapists only a few times that too because therapy is very costly for someone like me and is a very alien concept in my family and the society I live in  in general. I've always been a worrier in my life. Worrying about the tiniest things in life.. Constantly overthinking about things and situations and always expecting a negative/uncomfortable  outcome and as hard as I try I can't seem to control these thoughts..I've always been a procastinator..always delaying to do things..when i got my engineering degree at 22 with a fairly average score...Then I lost my father to cancer...I had lost all confidence in myself and I was sure that I wasn't ready for a job , so i kept delaying applying for a job as I thought I was only gonna screw up in my interviews....so much did i procastinate that I got my first job at 26 ...by this time all my friends had moved on in their careers and are settled and some of them even married...I on the other hand struggled at my first job as well ... overtime I did get better at it though..but i recently quit that job due to pay issues...while i was there I developed a mild crush on a senior colleague ...over my 1 year at office we had very little interactions ...even I didn't think much of it then ..but as my tenure came to an end she started to grow a lot more on me..we did have some tension between us ..we both caught each staring at the other quite a few times.. don't know if she was interested in me ...She is pretty and works at a good position in the firm and is a hard worker..Me on the other hand am an average looker(that's what i tell myself) too scared to go to office everyday looking forward to the next weekoff..on my farewell though i wanted to chat her up and just get an opening or something or get her number but she just vanished after the cake cutting and stuff...she didn't even say goodbye...then the lockdown started here in India..i just couldn't stop thinking of her ...I sent her a request on facebook..she accepted.It's just normal I felt...I text her on messenger n there's no reply for almost 3 days ..My anxiety kicks in ..Then there's a generic  reply ..I text her again..no reply for days, I open my Instagram , find her follow her, she follows me back almost 3 seconds later, she likes n comments on my guitar cover video that i just uploaded an hour ago hoping i would impress her...plan worked ..the next 2weeks I fuckin take out my electric guitar learn a song by linkin park make a guitar cover video using just smartphones upload it on insta and She's the first one to like and comment on it...I go nuts, i text her again on messenger...no reply.. till this day she hasn't even seen my messages..let alone replying to them...At this point i have trouble sleeping at night..my days are spent dreaming of her.... this isn't love..this infatuation is starting to bother me...i am looking for a job currently...and in this lockdown it's already hard to find one...making me more anxious by the day..then there's this distraction/infatuation/obsession over my crush is just killing me from inside...I have never asked out a girl before.. Sometimes i just feel i should ask her out on Instagram...but then what if she doesn't care to reply even there...My friends don't bother to talk to a loser like me and the ones that did said I shouldn't ask her out right away but chat with her, build her trust and then drop the bomb on her but how the fuck am I supposed to get an opening...!!!??What if she did want me to make a move on her??I don't want to regret this later on ..I'll never find someone again,  I've  never had love in my life , never had a girlfriend ,what if this is the story of my life?? I want her to be the one, I don't want to marry some girl just because my family wants me to settle down and have kids..I want to marry for love....I've already lost much of my time due to my anxious self and procastination and am losing more and my mind over this girl...this is definitely not love but obsession and it's toxic and unforgiving ...Oh fuck I also have to get a Job really soon..!!!sorry this is so long .. ...I have no one to talk to ..."
    },
    {
        "name": "t3_fya0s7",
        "created": 1586528640.0,
        "ups": 5,
        "downs": 0,
        "title": "Hi Guys, My girlfriend 27 has an intense phobia of doctors. It comes in the way of not showing to a doctor in need, constant worry about this fear and anxiety about future, especially having kids. What should be a systematic approach in solving this ?",
        "selftext": "The fear comes from childhood traumatic incident with doctor not doing pain management while treating and it magnified with an overall negligence from parents to consider this as a real issue. She is a single child and parents also had a non loving and abusive relationship with each other. Father has some mixture of Bipolar and PTSD with a overall male chauvinist nature.We have been dating for 7 years and for last 3 years we have been in a long distance where she is in USA and I am in India. Her being alone, in an unfamiliar social surrounding also make things tricky to deal with. I am planning to move atleast to USA but a different state( bit unsure with COVID 19) so that things can be better.Looking for stories around how it was improved over time, what speciality councelling and how to find that in the first place"
    },
    {
        "name": "t3_gbjcak",
        "created": 1588372956.0,
        "ups": 9,
        "downs": 0,
        "title": "I am having anxiety issues about what to do with my life. I've been struggling with that for more than 4 years now.",
        "selftext": "I'm 23 now. I got into a college and a course for my bachelor's which I didn't like. I don't know if it's related to that but since then I've been on a complete survival mode. Actually, for two years, I was working for a competitive exam but I didn't get the college I wanted. Suddenly, when I joined college I think my life lost all purpose and I just didn't know what to do. I just felt anxious all the time like I had no purpose at all in life.This anxiety has ruined so many decisions in my life. I passed out of my college last year. I got a job actually. But, well I didn't know whether I should take it or not since it was not a great job and I was anxious whether I'd get stuck in that job or that I may lose my chance to take a Master's abroad even though I didn't like the subject. So, I didn't take that job.I thought I'd change the subject for Master's and thought of applying for Math. But, we don't get jobs in our country (India) just after a master's and I would have to take another Master's degree in a reputed university abroad. It seemed to be too far-fetched. But, my father persuaded me by saying that I'm intelligent and it would do me good to try it.But, at the same time, now a Master's abroad in engg which I hated suddenly seemed so much better than this slim-chance deal. So, I applied for that as well.Now, I got a Master's abroad and the reality struck again. I know this isn't what I want to do and I feel helpless because I had hated it all through my Bachelor's and again I'm going for Master's.I mean there's a lot of background, I don't know what all to include.If anyone's got doubts or suggestions (not some empty stuff like suck it up and all because it's not a one-time thing, I'm tired of sucking it up all the time), it would be great.I mean I just want this anxiety and restlessness to go."
    },
    {
        "name": "t3_gomu9h",
        "created": 1590194718.0,
        "ups": 2,
        "downs": 0,
        "title": "Am i wrong?",
        "selftext": "I'm 20yo from India doing Engineering course in Instrumentation. Some info: From small age, I was interested in software tech than anything but my parents were ignorant and joined me in pre med but I failed and they joined me in a very strict Engineering college only in the thought of doing good to me. I was depressed for  3 years and now regained some strength to learn on my own to become a software developer and to get a job in a top tech company. So I started with my journey and I have almost done few courses, I was already quite comfortable with C, and also some leetcoding. but I can't go further I have this feeling that I am not going to succeed, seeing a lot of my classmates already equipped well in these technologies,I am insecured if I can't compete with them. I am always thinking about quitting and can't proceed any further its been 3 days since I touched my laptop But I have this guilt feeling in me, it is killing me. I have learned a lot from this platform and even though I know what I had to do, I am always stopping myself from doing it. I am afraid if I would fail in this too!Ps: i am the first graduate of my family and my parents joined me in this course just for job prospects. I'm really stressed out because I am 2021 grad and I will have college job fair in few months!"
    },
    {
        "name": "t3_aru8rw",
        "created": 1550500140.0,
        "ups": 6,
        "downs": 0,
        "title": "First time flying... LA to NYC to Abu Dhabi to India",
        "selftext": "So I’ve never flown as an adult before. I went on a plane back when I was still a kid. It was bumpy, that’s all I remember. Flash forward 20+ years and I’m traveling for work and not just a couple hour flight. I’m going to India. INDIA!! About a 27 hour trip including layovers and stuff. Of course I was shutting myself earlier this month. I’ve been trying to keep it together. One day I’m really excited and the next I want to cry. My two week trip is coming up in a few weeks. I got my Ativan ready to go in case I can’t control myself. It’s like I’m being pushed off a cliff into the ocean without knowing how to swim. I was planning on taking short flights to get used to flying but I never got around to it. Sometimes you gotta run before you can walk. "
    },
    {
        "name": "t3_fhz2er",
        "created": 1584132238.0,
        "ups": 2,
        "downs": 0,
        "title": "My life is ruined and I can’t get over the fact that my ambition is unachievable now, I am anxious and depressed and in despair",
        "selftext": "Hello, I hope you are doing well.I have been severely depressed and anxious and just can’t keep going... I need some hope ...I have nowhere to go, so I am here randomly venting and on the verge of a breakdown . I am from India and I went to China to study mbbs and graduated with a degree in 2017. The problem is my high school certificate, I failed in 12th grade coz I was busy chasing girls and having fun with friends and looking for shortcuts, but I was smart with regards to study, atleast that’s what my parents think, they wanted me to be a doctor....so In order to pursue a career in medicine I dropped out and redid 12th grade from an open school with biology from some other province, on my uncles advice, it was some shortcut and I didn’t even have to write the exams myself but I got high school certificates and I applied to study medicine and got accepted by some university in chine. Fast forward to 2017 I graduate and come back to India and went to register myself for the board exam and they ask me for all the certificates and  I provided them and this is where my life changed, they tell me the high school board I obtained my 12 grade certificate is not recognised and I can’t register. It’s been three years since and I have been trying to sort this problem out with whatever means possible, spent all I had on ways to procure a legit marksheet, I went deepweb and whatever corrupt contacts I had but I have only found failure. I have been severely depressed and get anxious whenever I think this, which is all the time and I feel hopeless. I have wanted to be a doctor so bad in my life but now I am nothing I can’t have career and I am in despair. I have been told that if I go abroad I won’t really need a high school certificate they will only seek my graduation degree and stuff, so I tried to talk to ppl experienced doctor on social media and everywhere I can and they all told me it’s not possible, you can’t do anything without a high school certificate and it has to be legit... and I should give up on this, I will be happy and I should some other career which doesn’t need high school n blah blah blah...it not possible for me to have a career without a legit high school certificate. My mbbs degree is verified and legit and I have worked hard to earn that, but it worth shit without high school certificate... I can’t think and I can’t stop thinking all that’s lost, I can’t get over the fact that it’s over and I can’t even mourn the death of my dreams, i day dream about suicide all the time and it seems the only way to make this feeling and the thoughts in my head stop. I am lost and I have lost hope."
    },
    {
        "name": "t3_f8plk9",
        "created": 1582570570.0,
        "ups": 4,
        "downs": 0,
        "title": "Wow wow can't believe am I dreaming",
        "selftext": "Hey guys I am in 18 year old Indian who suffer from depression social anxiety ADHD (I don't know I have ADHD or not but I definitely have lack of concentration) got beaten by poverty I am also a college student and doing really shit job to for 8 hours to earn rs 300 (4$ maybe) per day support my family because my father dies when I was 5 year old and now you are thinking I am a boy with severe depression no friends (forget about girlfriends I suffer from anxiety even I stand near the girls) Never got good marks in school and now you will advice me to meet psychiatrist. But in India if you go to a psychiatrist people will call you idiot mad retarded and you know I am extremely sensitive to rejection due to all this shit in my life I decided to do a suicide but can't do that because my mother made a lot of sacrifices for me if I will die who will take care of them. But I can't tolerate depression and then I ask doctor Google to solve my problem initially I got really confused because there is lot of antidepressant but in end I decided to take fluoxetine modafinil and atomoxetine for my shit brain. In India you can get medication without prescription except drugs with abuse risk. just go and tell pharmacist you are in emergency.thats an only upside of living here. in the next morning I decided to take fluoxetine 60 mg modafinil 200 mg and atomoxetine 60 mg. Initially suffer from little anxiety but after an hour my anxiety gone my concentration increases like I am using full capacity of my brain. My angerness  and shamefulness totally gone.first time in my life I initiate conversation with my classmate after 2 hours I become so happy can't describe in words my friends asked me did you win a lottery I said I win happiness. They got confused my family see you change in me and my coworker they get shocked.hey i am not lying never experience this feeling before. but I am worried what will be the long term side effect of this medications but don't care about that it's better living in depression. I am really grateful towards inventors who invent or discover (I don't know) this medication. Oh sorry I take your lot of time please apologize me and for my bad English."
    },
    {
        "name": "t3_dj61lb",
        "created": 1571345940.0,
        "ups": 3,
        "downs": 0,
        "title": "Needs therapy really in Anxiety how to rid of gaming",
        "selftext": "Hi, I am 22 years old have a job offer in final year of my engineering I am seriously addicted to Gaming need help really because it's destroying my life my AWS interview is comping up in campus just a week left still I am playing call of duty straight 10hrs not eating anything from morning to till evening I need help to get rid of my Gaming addiction in past also I have spent 2 years most of time playing clash Royal and also 2years most of time in clash of clans something is seriously wrong with me I know games in limit is good but I can't control myself keep uninstalling gaming apps and installing them like a psycho also happens same with in case of Instagram , tv series apps like prime video, Netflix ,Hotstar and all please someone help me.I am good in coding and app development and really want to pursue my career in tech further but this Gaming addiction and procastination with the tv+ some times porn needs to be stopped right now I want to utilize my time in what want to have good career but this all keeps dragging me down"
    },
    {
        "name": "t3_ezv6um",
        "created": 1581037102.0,
        "ups": 5,
        "downs": 0,
        "title": "Please help me out",
        "selftext": "I am 17 year old boy. I live in India. In my country people won't give much attention to anxiety and depression(any mental health). In feb 2018 when i was 15 year old i think because of hormonal changes i start feeling depressed and anxious. I know days when i cry for all day literally i cry all day long. Because of it my mental and physical health started going down. Somehow i confess all that feelings to my parents. And they take me to our family doctor. He gave me some antidepressants and i started recovering from all that thing. But then from past 7 to 8 months i am having too much anxiety about my health. I did visit my doctor but he said that if i will give you antidepressants again than you will get addicted to them(which is true) &amp; it will affect my memory in long term. In past few months i start knowing my triggers. But i feel anxious all day long and when somebody mentions my triggers. I start having anxiety attacks and sometimes panic attacks. I also have ocd. What should i do to reduce all this things ?"
    },
    {
        "name": "t3_fhthaa",
        "created": 1584099741.0,
        "ups": 1,
        "downs": 0,
        "title": "Discrimination under the suspect of potential COVID-19 transmission. HELP NEEDED.",
        "selftext": "Hello all,I see one of friend has returned from UK to India and his apartment dwellers have asked him to stop using his own maid, cook and helper services ,inspite of his through check in the airports and not showing any symptoms. The apartment dwellers are further restricting the buying of essential services from the apartment supermarket for him and his family !!I feel there is a blanket discrimination against anyone who is coming from UK. I would need legal and government help along with media coverage on this discrimination without justification under the panic pretext of COVID-19 ?Regards,Swapnil"
    },
    {
        "name": "t3_fc7z27",
        "created": 1583159454.0,
        "ups": 1,
        "downs": 0,
        "title": "Venting",
        "selftext": "I'm so worried about the world, I don't really have good thoughts anymore. My biggest fear is nuclear war. Everyday, I constantly check up on Google news, seeing if there's going to be a nuclear war in the near future. Between Russia/US and Pakistan/India. And I'm a bit worried about the coronavirus, but I feel like a lot of the articles are just trying to fear monger, so I only listen to doctors and experts. Sometimes, it's hard to enjoy my life with this anxiety I have. I know, all I have to do is just not look at articles, but it's so difficult for me to do. It worries me, when I don't know what's going on in the world. I don't have good coping mechanisms when it comes to this."
    },
    {
        "name": "t3_f7y3sh",
        "created": 1582431373.0,
        "ups": 0,
        "downs": 0,
        "title": "Homeopathy",
        "selftext": " Hello FolksI am just curious if any of the members have had success in using homeopathy for psychiatric illness.I have heard of many cases in India where patients were able to stop their medication or reduce it substantially using [homeopathy.](https://homeopathy.one/)One of the successful psychiatrist is Dr.Mahesh Gandhi,who left allopathy and became homeopath as he felt the medications were drugging his patients.It would be great to know about the experiences in the west."
    },
    {
        "name": "t3_5afp5t",
        "created": 1477984099.0,
        "ups": 7,
        "downs": 0,
        "title": "Leaving for India tonight, I'm absolutely terrified.",
        "selftext": "So tonight, I'm boarding a plain to go to Dubai, and then India. The thing is, I've never even left the country before. This will, undoubtedly, be the biggest exposure of my life. Everytime I think about the fact that in just a little bit I have to board a plane flying all the way to Dubai, and then another one to India, I want to break down crying. I'm praying that something will go wrong with the tickets or something and I don't have to go. I don't know how to put what I'm feeling into words, it just feels so beyond my capabilities to go to Dubai and then India, when just leaving my house can give me a panic attack. I'm a real mess right now and I just really don't know how to handle any of this. I mean, in less than 24 hours I'll be in India, which scares the crap out of me. I just want time to slow down a little bit. Also, it's not like I'm going to be in India for a short bit. No, I'm going for a month. I've just been so stressed out lately and then having to do the most anxiety provoking thing ever in my life in just a few hours, it's just destroying me. Please, if anyone knows how I can get myself to calm down and get it under control, I'd love some advice."
    },
    {
        "name": "t3_8n2osm",
        "created": 1527656586.0,
        "ups": 413,
        "downs": 0,
        "title": "Thinking about a weighted blanket? Do it! It worked wonders for me!",
        "selftext": "I've suffered from anxiety for a long time, but have been formally diagnosed with GAD about 2 years ago.27/F and I've always had a very nervous disposition \\- even to the point where my family and teachers used to call me the safety police because I couldn't let anyone do things that I deemed unsafe. In hindsight, those were totally unrealistic standards to set \\(things like not allowing my 6 year old sister go down the stairs without holding my hand\\). Either way, I started seeing my GP for my anxiety about 2 years ago and was finally actually diagnosed, so he started me on Citalopram. I came back from a 2 week long trip to India and was feeling really good, but I brought back a parasite and that did not go over well. I had the biggest panic attack of my life, and my irrational fears got worse \\- I couldn't stop thinking of my SO getting hurt, my grandfather or parents getting hurt or dying, or of something terrible happening to those I care about.My doctor was hesitant to up my dosage of Citalopram, and I really wanted to find a way to not rely on pharmaceuticals to eliminate my anxiety. He recommended acupuncture \\[side note \\- acupuncture has forced me to relax while I'm there, it's a great therapy, but it's only temporary\\] and a weighted blanket.I purchased one \\(Gravid, 15lbs\\) shortly after and as soon as I got it, I was a little disappointed.I could sit under it and it was cozy, yes, but I didn't feel inherently more calm or relaxed.Fast forward to the next couple mornings where I kept waking up... refreshed? It was more that I noticed I wasn't dragging my feet in the morning as much, and my anxiety was lessening every day. The more I slept under it, the more I found I would sleep through the night, my nightmares were dramatically reduced and I just felt better.Now, I don't find I spiral out of control. If I have a scary thought or one of my fears pops into my head \\(which still happens multiple times a day\\) I can very easily identify it as irrational and use breathing techniques and even internal mantras to calm myself. I think that good night's sleep \\(in a chain, especially!\\) has changed my level of anxiety and better prepared me for the day to deal with the anxiety that is inevitably a part of me.TL:DR \\- I was struggling with anxiety on pharmaceutical treatments and wanted to quit the drug, my weighted blanket makes me sleep much more efficiently and I wake up refreshed enough to better cope with my anxiety throughout the day. If you're thinking of getting one, please try it! Many companies offer a full money back guarantee within a couple weeks if it's not working for you. I know they're expensive but they're an investment in your mental health, and they work out to be a lot cheaper than even a few months of medications!"
    },
    {
        "name": "t3_c619pr",
        "created": 1561640342.0,
        "ups": 5,
        "downs": 0,
        "title": "Want to be better",
        "selftext": "Background info: white m/late 20's early 30's/northwest USAI don't know where to begin with all of this. First off this is not my main account but it is also not a throwaway even though it's new. I, for reasons of my anxiety, struggle to post on my main account and this is yet a further attempt to pull myself out of my head. I want to be better, as the title suggests, but I don't really know where to begin. I have suffered from depression and anxiety for the majority of my life, and while I have comparatively had an easier time of it than some others, it has left some serious marks on my life. I want to change to this, however, but this is where things get complicated for me. As previously stated I live in the northwest US, my area is fairly liberal, this is usually not a problem for me because I keep to myself and try to make myself seem as small as possible, but this is no longer really a possibility for me.For me to continue on the path I am on will only lead to my death, whether intentionally or otherwise, so I had decided on a path of change that i felt lined up with my own values and a variant of my style. I was going to be a \"Gentlemen\" in the best definition I could find (respectful to everyone, suave and debonair, comfortably confident). Now if you're reading this thinking that there's nothing wrong with any of that I would normally agree with you, but here is where my brain decides to intervene. As previously stated I am a white male, in the vast majority of scenarios that play out in my mind I cannot see it as ending well. If I dress in a suit or similar I am suddenly the problem in perpetuating the class divide, if I am confident then I must be self-absorbed, if I try and be traditionally respectful I am sexist etc. I already try and embody the last aspect of being respectful to everyone (holding doors, being as polite and patient as possible when being a customer, etc.) But even then I can't escape the feeling that I am just a horrible person pretending to be better, that I am seeking to rise above my worth...I understand that the majority of these problems stem from my inability to get out of my head so-to-speak, conversely, these problems aren't exactly the type of thing that spawns from nothing. To make matters worse, there is literally nothing I can do to solve several of them because they are predicated on how others perceive me out of context. I was on medication for a while but it had stopped helping and events conspired to leave me without the means to pursue therapy (admittedly the events were the fault of choices I made that I thought were right at the time but that's another story for another time.) I didn't really know the best sub to post this to, if this is the wrong one, I'll delete it. Tl;Dr: Want to improve myself but feel that I can't, \u001bbecause as a white male I feel that anything I do will be construed in a way that will make me seem like a villain when I just want to be a good person."
    },
    {
        "name": "t3_dhfj0e",
        "created": 1571025020.0,
        "ups": 1,
        "downs": 0,
        "title": "I don’t know what to do or rather how to stop feeling like this.",
        "selftext": "Prefacing with: I’m not on any medication. It either made me a zombie or my symptoms worse. Also, my therapist retired and I’m tired of bothering my friends with it. Anyway, my anxiety has been pretty high lately, somewhat mixed with depression depending on the situation. Lately I’ve been having the issue where no matter what someone says to me, how well I know them etc, I think they’re lying and that the worst is going to happen or they have some ulterior motive. For context and example, my boyfriend is going to India which is awesome. He said he didn’t need a ride to the airport since our company reimburses Uber and there’s also two of them and a bunch of luggage. I know he’s thinking of the fact that I have work, and that it’s just easier for all involved. But me, with my anxiety, is thinking something else is up. There’s some ulterior motive. He’s never given me a solid reason to believe there would be, and my anxiety has become so much that sometimes he feels like he can’t tell me things based on how I’d react. I literally don’t know how to stop the worry, the thoughts, all of it. I can create a scenario in my head, and actually believe it’s happening and get upset about it. And then I actually ask him or whoever it’s about about it... I feel insane."
    },
    {
        "name": "t3_eei06n",
        "created": 1577119357.0,
        "ups": 2,
        "downs": 0,
        "title": "I couldn't get inside the airport",
        "selftext": "I was supposed to travel from India to Canada for my studies on the 20th of December. When I reached the airport and started pushing my luggage, my heart started beating rapidly and I felt tired. I felt a shortness of breath. I thought what if something like this happens inside the flight. I couldn't get myself to board the plane or even get inside the airport. Visited a therapist today and he told me I had GAD. He told me it's all cause of my thoughts. He gave me a medicine in case I have an episode again. So tonight, I'll be travelling to Canada. Have booked the tickets and I'm all set. Hope everything goes well.Also, can you suggest me a book related to anxiety that I can read on the flight? It's a long journey (around 22 hours) with a 3 hours layover in between. If you have any ideas for me, I'm all ears."
    },
    {
        "name": "t3_9mgy69",
        "created": 1539048495.0,
        "ups": 62,
        "downs": 0,
        "title": "Feeling suicidal after hearing about the climate change news right now and just want to give up",
        "selftext": "If you haven’t heard about it, talking about this https://www.nytimes.com/2018/10/07/climate/ipcc-climate-report-2040.html?action=click&amp;module=Top%20Stories&amp;pgtype=HomepageBasically crisis is going to hit in a little over 20 years if we don’t take unprecedented action to stop it right now for the next 10 years, which is obviously not going to happen given that the entire US government completely denies climate change exists now, and places like China and India are developing and growing and aren’t going to stop industrializing either.It’s only going to get worse and it seems like there’s no future past the next 20 years. I’m still going to be relatively young then. I’m not ready for my life to be half over. I want to have a family and things like that, but I feel like that’s out of the question and not even worth thinking about now.I don’t know what the fuck to do now."
    },
    {
        "name": "t3_cv7ssx",
        "created": 1566764293.0,
        "ups": 1,
        "downs": 0,
        "title": "I’m abroad, first time having anxiety, want to open up",
        "selftext": "Hi all, I have a flight back home from India in about 6 hours and I just wanted to write out my struggles the past couple days. I’ve been in India for 10 days and it’s been absolutely amazing from the food to the people to seeing the Golden Temple and Taj Mahal!However, I’ve suffered two panic attacks the last 5 days where I felt like I couldn’t breathe and thankfully the doctors were all calm, gave me some Xanax pills and reassured me that nothing was physically wrong. Despite taking the pills, I’ve been having constant shortness of breath and it doesn’t seem to be getting much better. I  have been doing breathing exercises that help a little but the sensation is still there. I’ve never had any anxiety issues before and i really hope it’s the unusual environment/air pollution and that everything will be fine when I get home. I’m anxious for my flight home, and I don’t want this newfound anxiety to ruin any of my last year in college and job interviews. I know this is all in my head but I just wanted to write it out and share it with anyone else who’s in a similar situation. This sucks, but here’s to getting better :)"
    },
    {
        "name": "t3_5b271v",
        "created": 1478271631.0,
        "ups": 2,
        "downs": 0,
        "title": "In India for a month, absolutely terrified of getting seriously ill and it's ruining my experience.",
        "selftext": "So, for the month of November, I am in India. The problem is that I'm a severe hypochondriac. Even back in the US I have daily medical-related panic attacks. So now that I'm in India I'm on much higher alert and it's getting to be too much to handle. I'm completely terrified of getting ill(I know getting ill here is inevitable to a certain degree, but I'm worried about getting seriously ill) so I'm analyzing absolutely everything about my body, from marks on my skin to how I'm feeling. For example, the panic attacks today have been over 3 main things(feel free to provide information if you know anything about these): I got what seems to be a mosquito bite on the bottom of my foot, not sure how that happened. It was itchy for a little bit, it was red and raised like a normal bite, but now it's not itchy and it's a weird color/shape. Number 2 is over the fact that my armpits are having some kind of occasional sharp/stinging pain and I have no idea why. Number 3 is a mixture of things. When we were flying into Delhi, as part of their announcement they said to do something, I can't remember what, if you have recently been to Saudi Arabia and/or South Korea and are having trouble breathing or feeling generally ill. Considering the flight was Emirates, its pretty likely at least a few people who had been to Saudi Arabia recently were on that plane. I have no idea what illness they were referencing when they said that and I don't even want to look it up because I know it will drive me into a panic. The thing is, I DO feel short of breath and I have a cough that I developed when I woke up from a nap the day I arrived. Granted, Delhi is facing some of the worst pollution ever here(just google \"Delhi\" and it should come up) so it could also be that, I just don't know. And for healthcare, the options are significantly lesser than that of the United States. Specifically the city I come from in the US has many world renowned hospitals, so if I get sick there it seems to be relatively no big deal compared to here where it feels much more up in the air. I've had so many panic attacks about getting sick and dying here even far before I left the US. So how do I calm my nerves here? It's currently draining me of so much of my energy and combine that with the fact that this is my first time out of the country and India is so insanely different from the US, I just feel so exhausted constantly(I'm also super sleep deprived) and I want it to just stop but I'm analyzing everything about myself. Also, does anyone know anything about the medical stuff I mentioned earlier?"
    },
    {
        "name": "t3_c8wzvq",
        "created": 1562235848.0,
        "ups": 10,
        "downs": 0,
        "title": "I don't trust anyone",
        "selftext": "I don't know... I've basically retreated from social interaction even though I know I need it... I feel like I don't deserve itEither I'm needy, or I'm annoying, or I'm a virgin, or I'm weird. Whatever it is... I'm not good enough.Then again... Everything I do is for the approval of others... And (at least according to some people) I try really really hard...BTW, hypothetically I can tell my mom that I just want someone who loves me, who I can hug, who I can trust, etc.. And she can say \"I love you\" but for some reason... I don't like that answer...Maybe it's because we don't have much in common. She's in her 50s and grew up in India. I'm an early 20s fat american aspie zoomer with social anxiety... So yeahI could get friends... But again... I don't trust anyone. Either no one's available, no one wants to talk to me, no one cares, I'm looked down on, I'm hated, I'm put down. As far as I know.Social interaction is hard... Really hard. And it's unfair...As I was writing that I thought of how many people who have cancer, who are starving, who are poor... Here I am complaining about my easy life...I don't know... I'm just lonely and frustrated"
    },
    {
        "name": "t3_doqd5l",
        "created": 1572387081.0,
        "ups": 1,
        "downs": 0,
        "title": "OCD about sleep issues .HELP",
        "selftext": "Guys I m constantly obsessing over that my insomnia would be returned and i would not be able to sleep and then i would go to ER. I had a bad experience of insomnia 2 years back. The obsession has returned after a bad episode recently. I m currently taking a 0.5 mg etizolam (india) to help me asleep...How do i Stop obsessionIs there something that i could tell my brain to remain silent , a assurance maybe in the situation gets worst....it would be really helpful if you could reply.i Constantly think today is gonna be my last day because i would go crazy.HELP please"
    },
    {
        "name": "t3_9yvnf6",
        "created": 1542772411.0,
        "ups": 21,
        "downs": 0,
        "title": "Really struggling after my landlord visited.",
        "selftext": "My landlord came over today. I'm moving in December and she wanted to take pics of the house so she can start advertising it. I was anxious cleaning for days and still felt uneasy. The house isn't dirty, but it does look like someplace preparing to move + a 2 year old lives there. The second she walked in the door she just said \"oh my god\" and kept repeating it over and over again. After a few minutes she told me she can't take any pictures because \"it's too messy\" and there's no way anyone would \"want to live like this.\" She made a big deal about not being able to take photos or show the house to anyone until after we're gone. I kept it together until she left but it's now been 3 hours of just nausea and crying and tight-chested breathing. I feel awful - it's pulling all my triggers around being a good enough mom, wife, etc. Maybe it's the jet lag (got back from India yesterday), but I just feel like I'm perpetually on the edge of panic. I know in my brain it doesn't really matter but it doesn't feel that way. "
    },
    {
        "name": "t3_caiv51",
        "created": 1562606994.0,
        "ups": 1,
        "downs": 0,
        "title": "Jolt-type Palpitations upon the slightest of physical movement",
        "selftext": "Description of the problem:I get these strong forceful beats when I start to do any sort of activity, even small things like climbing stairs, toothbrushing, washing my face, taking a shower, cleaning up after pooping, eating fast. They're like jolts in my chest and sometimes they're strong enough to startle my entire body. And then I have to sit down and relax for them to stop after a few minutes,Of course they don't happen if I'm just sitting around or laid down (unless I'm doing some physical exertion while sitting). I have a normal EKG, normal blood pressure (after relaxing a bit) and normal sounds and rythym from a stethoscope check. A doctor suggested me to get some Thyroid blood tests done to check for Hyperthyroidism, but then the results came out and I have Hypothyroidism instead of Hyper. It should've been the opposite way around.Can this really be from stress and anxiety? My mind refuses to believe that.Age:22Height: 6 ftWeight: 92 KgsGender: MaleMedications: NoneSmoking: Never done itPrevious and current medical conditions: Previously in 2016 I was diagnosed with Panic disorder which I don't get anymore. Current described above.Duration: I've been having these jolt-type Palpitations since 2016. At first it used to happen randomly once in 3-4 months, like just one jolt. Then it started to happen only during exercise or jogs. Then it only used to happen during morning showers, then it started to happen during any shower. And finally now it happens during literally any physical movement.Location: IndiaLifestyle: I'm overweight and I haven't done any exercise/workout in over 3 years."
    },
    {
        "name": "t3_cz11mk",
        "created": 1567520505.0,
        "ups": 2,
        "downs": 0,
        "title": "Help needed urgently",
        "selftext": "I have made probably the biggest mistake of my life.I was in a bad place today, mentally and I recalled about BetterHelp, and I'm in India, so the dollar is a lot, like a lot, and I didn't think properly about the amount I was gonna be charged and payed with my debit card, I'm still a student and my dad would NOT be pleased to know what just happened.The money is gone to them and in my currency it's a really huge amount...How can I ensure that I get a refund from BetterHelp, if any at all, I immediately cancelled my subscription and it says I can use it for a month and I don't know what exactly to do.I've sent a few pleading emails to the customer service idPlease help me I don't know what to do I'm really panicking"
    },
    {
        "name": "t3_ciwjl9",
        "created": 1564353451.0,
        "ups": 5,
        "downs": 0,
        "title": "My health anxiety, just went away",
        "selftext": "Okay, this is going to seem a bit odd but stick with me. I am by NO MEANS encouraging any substance abuse and just wanted to clarify that before I continued with my post. I got really, really drunk three nights ago. I blacked out for four hours and apparently for those whole four hours I was just crying, throwing up, and using the restroom while my boyfriend cleaned up for me. I slept the entire next day as I had a BANGER of a migraine. I hadn’t eaten much the day before, which probably attributed heavily to my drunken night, but that’s besides the point. I hadn’t eaten much in three months anyways. I have had horrible, suffocating health anxiety that had begun to build in April. By the end of May I had begun to have an intense fear that my food was laced with psychoactive drugs or poison. One of the two. Maybe both if the fictitious, evil workers of Taco Bell in my head were feeling EXTRA feisty. Suffice to say, I didn’t trust food. At all. I got lucky that I still trusted my liquids. I only lost 7 pounds throughout this but now I’m severely underweight. Not, nutrient deprived as I had my blood work done shortly after this, but enough that my legs don’t touch and my hip bones are bruised if I land on the bed wrong. Oh yeah, and I’m fucking freezing. All. The. Time. I live in AZ and it’s 114 outside, but guess what I’m wearing? A thick knitted sweater and black skinny jeans with boots. And I’m still cold. Anyways, I’ve gone on a tangent. I’m obviously not happy with the weight loss I’ve endured the past year, and especially not the past couple months. So basically, I would force myself to eat, get horrified after one bite, continue eating, and only finish 1/4 of my meal. I’d push it away, say I’m full, and save it for later. Saving it for later was so if I am not going balls to the wall HIGH in an hour, then maybe I’ll eat it. Probably not though, because OBVIOUSLY that taco bell worker only put the LSD on the LEFT side of my taco and I’ve only eaten the right side. These TB workers are creative, guys. This was my head for literally the past three months. Every single day. I’d say on average I probably had barely 500 calories from food in a day. Thankfully for me, I had stopped drinking diet soda shortly before this so I still received a shit ton of sugary calories everyday from liquid sources. So anyways, back to my hangover. By the time my boyfriend dropped me off at my parents house, migraine still raging, I was FAMISHED. But I put off eating because it’d probably make me nauseous and I don’t want to be anxious AND in pain. But lo and behold. After three months of constant agony around food, it was just gone. It left as quick as it had arrived. I ate so much food that night. I ate until my stomach was stretched as far as it could go, and then eat some more two hours later. I spent the whole night eating. Just anything I could get my hands on that seemed moderately healthy. I was so happy. My favorite thing used to be my weekly visit to chipotle. Now I can FINALLY enjoy my weekly visit again. I don’t have to have fake chipotle workers snickering in my head about how much drugs they put in my sour cream or the poison they seasoned the sofritas with. It’s only been a couple days but I’m so happy. My boyfriend has been making me food everyday throughout this whole ordeal. I’m so happy to GENUINELY mean it when I say, “thank you, I really enjoyed it” at the end of the meal he made for me. Those potato and egg burritos this morning were SO DAMN GOOD and it was because they stopped being sprinkled with anxiety. I still have some health anxiety. But after I had my corneas checked for a tear and an MRI and EEG done on a brain turmor I was CONVINCED of, it’s just about the small stuff now. I have to avoid the health section of the news app because it always triggers me. Obviously that man in India that died of a bacterial infection means I WILL die of it too. But I can eat now. And for that, I’m happy. I don’t know what the alcohol did to me or if something in my brain just snapped but I’m perfectly fine with it."
    },
    {
        "name": "t3_ajy00b",
        "created": 1548508098.0,
        "ups": 0,
        "downs": 0,
        "title": "Girlfriend left because of my anxiety and fear. Need some venting. Need your comments",
        "selftext": "I'm 24, from India.I'm not clinically diagnosed as having anxiety. But I believe I have higher anxiety than most people.I used to be very afraid and anxious right from my childhood days. Never went after girls due to my fear. In college, I liked a girl but never told her. She also had feelings towards me. Once she said this through a text message. But as my self esteem was very low and inferiority complex high, I thought she was lying. I thought she was trying to fool me just to see my reaction. I kept on telling her that I know that she is fooling me. Four months later after my course got over, once we were chatting and she again said that she likes me. This time I said that I too love her, only because the course was over and I wouldn't be seeing her everyday. After saying that I like her, I came to know that she indeed was telling the truth. I got very happy but at the same time I was kind of desperate. It was the first time someone was saying that they romantically like me. I regret not saying that I love her the first time she said it to me.We talked and chatted mostly. Then I went to another city to pursue my master's and she did her masters course only nearby. We started the relationship only after I got admission into the far away college. We again talked and chatted.But whenever I see her, I get all anxious. She is of a different religion and I am from a different one. I was afraid if our parents would agree. Besides whatever few times we saw each other in person, I was tensed to even hold her hand and walk in public. I felt people would notice me and maybe stare me. I didn't know what to do if someone passed some lewd comments.After two years, both of us completed our masters and she asked me to do a B.Ed (Bachelor of Education) course with her. But I was scared to teach. The thought of standing before children or college students to teach scares me. I said that I won't be doing as I am not interested in it. But actually I was more afraid to teach than being uninterested in teaching. Besides there were some moves done by her parents to get her married, which did not really materialise. I am unemployed and afraid to go to her home asking for bride. That's like a very big anxiety for meShe went forward with the course and some of our classmates from our degree course too were with her for this course. Now, after two years, the course is almost over and I regret not joining it. It's almost like our degree course. Few common friends, and the whole class went to the same place for the class tour which we went during our degree time. At that degree time, we were not in a relationship.Now I regret the decision of not joing B.Ed. I could have been with her for two years. I was too afraid to go for teaching. There was also the thought that going for teaching course would be something like going down. Like, after masters I thought people would go for M.Phil or Ph.D. Stupid thought. I should've chosen to be with her.Now few days before she said that discussions are going around for her marriage. It may happen this year. We have seen each other only like less than 20 times. I am too afraid to give some reasons to go out of my home to hang around with her. I actually seldom go out. No trips. Too afraid to do that.She said that she does not feel romantically interested in me anymore. She first thought I was a smart guy, due to my studying skills. I'm pretty good at studying. During our Masters time, we were like ok. We talked. But even at that time I tend to overthink about our relation and felt like I may not be able to marry her. This led to some temporary breaks in our relation. I used to say that talking too much can lead to problems. I may not be able to let go and shits like that.In the last two years when she was doing her B.Ed, I practically did nothing. For one year I sat at home. Tried developing  a blog, but it kind of flopped. Did not go for interviews as I was afraid. Besides I was addicted to porn and masturbation. I used to masturbate for like 3 hours daily. Edging.After one year I got a job on someone's recommendation. But it's a dead end one. It's a journalism job. I just have to type some news in, which I don't really like.Now she says I have been only talking about my problems for the past two years. Occassionally having breakdowns over the phone, crying like a baby. She says she is done with this. That she can't help me anymore. That I need to take care of my own. That I need to understand that everybody has problems and everybody is struggling. She said I take my problems to be special which is not true.I felt she said the truth. She has her own problems and she deals with it in her own ways. But I kind of get stuck when I get anxious and afraid. I don't do anything.Recently I have started changing. Started doing meditation and light exercise. Quit porn and masturbation. But still I am afraid and anxious about a lot of things. The thought of she getting married makes me sad. But at the same time I know that I can't take care of her right now. I first need to take care of myself.I sometimes go into regret mode and beat myself over not doing that course with her and over not saying my feelings to her when she said that she likes me, for the first time.How do I get out of this awful situation?"
    },
    {
        "name": "t3_b8m8p4",
        "created": 1554254996.0,
        "ups": 6,
        "downs": 0,
        "title": "Hi guys, I'm writing a play about anxiety.",
        "selftext": "In my country (India) anxiety attacks and anxiety isn't a common knowledge. In fact I only found out I had anxiety and what I was experiencing was called anxiety attacks from reading a thread about anxiety. So to do my very small part I want write and produce a play spreading awareness about Anxiety, and since I'm part of one of the best drama troupes in South India, I have a good platform to perform it on. So, I would really appreciate if you could give me a few of your worst experiences so I could have a bit of material along with my own experiences to base it on. "
    },
    {
        "name": "t3_7057wo",
        "created": 1505452227.0,
        "ups": 217,
        "downs": 0,
        "title": "One month from today, I'm meeting the guy i've talked to online every day for 8 years.",
        "selftext": "And I'm **freaking out.** The thought of the whole thing makes me feel like I'm going to vomit. I met this guy in a chatroom when I was 15 years old. He was some 18 year old guy from India I never expected to connect so deeply with. Fast forward 8 years and he's got an awesome job here in the States and we finally have the opportunity to meet up in Denver, CO (someplace both of us have been dying to visit) and vacation for a week. My anxiety has *always* gotten in the way of any relationship I've had of any kind, and this one has been no exception. What seems like the smallest things have given me the most anxiety throughout our 8 years of talking, from telling him my name, sending him a picture, talking on the phone, and skyping. The crazy thing is we had plans for me to fly out to where he lives in San Francisco back in March... and I cancelled a few weeks beforehand. I still feel absolutely horrible for doing that to him, but inspite of all of it, he still finds a way to be incredibly patient with me.  Now here we are, a month out from the first vacation I've had in years, my first time visiting a city I've been dying to see, and meeting one of my closest friends in person for the first time and for some reason, all I want to do is cry. Every detail has me questioning if this is going to be a disaster. **What if I miss my flight? What if the airport loses my luggage? What do I do when I see him for the first time? Should I hug him? What if he doesnt think I look as good as my pictures? What if we have nothing to talk about? We have one whole week together, what the hell are we gonna do in all that time? What if we have a horrible time and we never speak to each other again afterwards? What if we *really* end up liking each other? Does that mean we're going to start a relationship?**I'm so tired of letting my anxiety run the way I live. I just wish I could embrace and enjoy the excitement of all of this, but my mind always finds a way to distort it into something that's going to end terribly..."
    },
    {
        "name": "t3_b3n5e9",
        "created": 1553178125.0,
        "ups": 5,
        "downs": 0,
        "title": "Is there anyone here who is anxious and at the same time a teacher at school or college? I can't seem to gather courage to try teaching.",
        "selftext": "I'm 25, male. From India&amp;#x200B;I have a generally high anxiety and teaching career scares the shit out of me. I had to take a class back when I was in my twelfth grade. The kids were never listening to me and this increased my anxiety in the class.&amp;#x200B;Now I have done my M.A. and teaching is one job I can try. If I get into some colleges or some place it may be good. For this I need to start teaching. But I develop cold feet. I feel scared internally while thinking about it. Recently an opportunity to teach someone at home, like a tuition has come up for me. I want to take it up to see if this teaching thing suits me. Is there anyone here who has/had the same kind of anxiety to teaching and has successfully overcome it? Any input is appreciated.&amp;#x200B;(Background info: My relationship with a girl got bad due to this fear of mine. I chose not to do a teaching training course with her due to my fear. If done I could've been with her. Now we have broken up and I kind of feel like I could've taken this teaching training course up before. Kinda sad about that. She broke up pointing out my anxiety. A part of me is like trying to prove to her that I can do this teaching thing. A part of me is curious to find out if I can do teaching because it is a less stressful job compared to some others. A part of me is saying I don't really listen to my inner voice which says I really don't like teaching and that it is my insecure self which is asking me to go take up this thing just to prove a point to my ex. I don't really know what my true desires are.)"
    },
    {
        "name": "t3_c659sw",
        "created": 1561669441.0,
        "ups": 1,
        "downs": 0,
        "title": "Long distance relationship anxiety (or am I spot on about these things)",
        "selftext": "I’m currently in a relationship of 2 months and at the moment she’s away visiting family in India. I know she probably has things going on everyday, but short, abrupt responses and her rarely saying I love you if I don’t say it first really gets to my head. To make matters worse, I don’t really have anyone in my life as important as her and I know I’ve definitely hurt her and made her impatient by revealing how I scrutinise over every little thing she does as a sign that she doesn’t love me as much as I love her (I’ve told her this fear of mine very explicitly). All of our conversations seem very substanceless to me and she never asks how my day is going or any of that, we only resort to very tense discussions or arguments about the issues I’m describing.  Otherwise, she talks about things that happen in India or with her family - and to be fair she is extremely busy with get togethers and meetups. She is very comforting, but she doesn’t initiate anything romantic or intimate on her own. We do it all over text too.She also gives me the silent treatment a lot if she is angry (and she is VERY emotional), and tends to take everything personally. She sucks at communication so I feel like I have to tread lightly with her. She has acknowledged she is unreasonable at times and that I should just give her ‘5 minutes’ and she will be back to normal. But the problem is she completely switches back to normal, and doesn’t bother trying to solve the problem beyond that, even if I have more to say. She just expects me to move on as quick as she does. I don’t know how irrational it is, but this in addition to the fact that she is very experienced with relationships (which she says that none of them have been serious or as good as what we have now) and has had a past of being promiscuous with people while she was under the influence of alcohol, makes me think that she will move on from me just as quickly. I feel like I’m very different to her, I am not a social person and I usually prioritise school over everything and only recently I’ve made her among my top priorities. I feel like we might even be incompatible despite us having what we have. I have spoken to her about this and she assured me that she can’t live without me and that I mean everything to her. Maybe that sounds too extreme to be true, which makes me think she said it just for me?I’ve told her that sometimes I feel suicidal, and that I have had a traumatic relationship with my mother in childhood. I’m not sure if I’ve over shared.I don’t have anyone to talk to about my anxiety except her and I know its such a burden. I am almost convinced she has completely lost interest in me, or doesn’t see me the same way I see her. I feel like a lot of the romantic things she says or fantasies she comes up with about the future are for me, not because she genuinely means it. She has told me outright that she prioritises work and her parents over me, which made me lose a lot of sleep (although she has said on many occasions that she can’t live without me). I have to wait another 6 weeks until we can meet again and I dread pouring my heart out to her because of the damage this has already done. She’s very religious, and she says she has thanked god on many occasions for being lucky enough to have me, but that was before she left and I’m not sure if it’s just her inability to express these things over text or her lack of time to do so that is the problem.I am also scared sick that she will cheat on me or leave me. I know she talks to other guy friends of mine, and I feel like I’m being selfish or controlling. I know her history with other guys and I just wonder if she might be the type to cheat on me or just say things she doesn’t actually mean. I think all this even though I know she has never cheated before. I also seem to make all the attempts at intimacy or being romantic. If I don’t tell her how much she matters to me, then she won’t do the same unprompted. I do it alot to, and I also talk about what I’m feeling a fair amount but I’m afraid of doing it anymore because I seem obsessed or I might hurt or bore her. To be honest, I don’t know what she really sees in me. She’s been with a lot of guys before and constantly reassures me that I’m the best she’s ever had and she wants a future with me, but what if she says that just because she knows I have anxiety? What if I am just a boring person, and she’s dropped all the described hints because she’s too guilty to end the relationship herself? Since she left, this has been on my mind day and night and it infringes on my ability to live normally. I lose sleep and I have a colossal amount of work to get done. I feel that if I focus on my work I won’t have time to initiate conversation with her and she will just forget about me. I have had serious panic attacks over schoolwork and I am extremely work driven to a point where I worry myself into apathy or inefficient study habits. I constantly compare myself to others (her included), who I know are not suffering like I am, and I feel as if I am not validated for my hard work then I am nothing. Every time I see my girlfriend living comfortably and balanced it makes me think of how worthless and pathetic I am. It doesn’t help that I now have relationship anxiety on top of all this, that I have to manage in my own or over text, with someone extremely busy with family matters). Maybe I’m not in the forefront of her mind like she is on mine, but then again - what does that mean?Sorry guys, I think I could talk for days about this but that’s generally the gist of it. Apologies for wall of text, but if anyone could just read through this and reassure me that would be great."
    },
    {
        "name": "t3_arwnsy",
        "created": 1550520929.0,
        "ups": 8,
        "downs": 0,
        "title": "Gonna travel a bit far one my own. My body and mind has activated its weapons grade anxiety. Hoo hoo. Poor guys. Don't know that I won't be cancelling my trip",
        "selftext": "For the record, I'm a male, 24 years of age, from India. Not been diagnosed by a medical professional as having anxiety. But I generally have more anxiety than most people around me.&amp;#x200B;The thought of travelling alone over a long distance scares me. Going to a new place scares me.&amp;#x200B;So today I am going to Karnataka (a state in South India) from my hometown in Kerala (another South Indian state). My train is about to arrive in like less than three hours and my body and mind has already started getting anxious.&amp;#x200B;My mind says things like \"I may miss the train. People around me in the compartment may be awful guys and I may not be able to deal with them.\" My body is like, \"Here have this burning sensation in the underbelly. Take some acidity for decoration. Also take this feeling of about to vomit so that you can't eat something properly. Piss. Shit. Again shit. Some more shit. Cause if you don't shit now you may not get a good bathroom to shit later.\"&amp;#x200B;But I won't be cancelling this trip. This is just a beginning for me. If I cancel this trip I would be more sad in the long run, which I can't afford to be. I need to develop my courage muscles. Because this is the only way out. If I don't try I'll slip deeper into the dark hole. And the dark hole never ends. Forward is the only way out.&amp;#x200B;Most of the stories my mind tells me about the trip are just pure imagination. Nothing that is really happening around me.&amp;#x200B;Will give an update on how the journey went."
    },
    {
        "name": "t3_clcif2",
        "created": 1564822374.0,
        "ups": 1,
        "downs": 0,
        "title": "My parents might have anxiety and OCD",
        "selftext": "I'm not a psychologist, so I obviously can't know or diagnose for sure, but I've been diagnosed with severe anxiety and I see a lot of similar characteristics in them.But they were born and raised in India and most likely would never go see a therapist as it's looked down upon.Anyone else in a similar boat and suggested to their parents to think about it?"
    },
    {
        "name": "t3_ciuc1h",
        "created": 1564338635.0,
        "ups": 1,
        "downs": 0,
        "title": "Wrote A Message To Myself For My Social Anxiety: My First Real Meditation Experience With Pot",
        "selftext": "So I decided to take a bubble bath with candles and stuff made it look all nice and relaxing, I haven't bubble bathed since I was a little kid btw but my sis suggested it, and I'm pretty desperate for something to work, so I upped the ante and decided to smoke some pot and do some meditation with the app Headspace and wrote a message to myself. I've tried meditation before but things never seemed to click so I just assumed meditating would never work for me but this time around was very different because of the pot I felt so intune with my thoughts, mood and body it felt very spiritual and relaxing, I've never had this feeling before it was nice. So here is what I wrote to myself. \"You've been too self involved with your emotions to the point where you've almost committed suicide, and had thoughts of suicide you almost broke all the hearts of the people that love and care about you, it was selfish,  but you're here and it's time to forgive yourself, you need to let your mind relax, just go out for a stroll , talk to **** or **** about it, shit maybe even go for a run but I guarantee you these medications will get you no where if you're relying on them, it may even worsen your condition, so try getting off them in a timely manner, and neither is smoking weed btw (if you do it all the time). We have to get in touch with our mind to improve our mood.  Mind over Mood makes so much more sense now. You're a good person yeah you may have a bad day but it's up to me to choose what day I have,  you should start everyday with a smile on your face, you should be greatful instead of sad, you have a roof over your head a family that loves and supports you, food on the table you're a good person, kind hearted, helpful, smart and yeah you've done some bad shit but that's okay no one's perfect people change, and this is your time to change, think of it as a natural transition in your life, yeah you may not be the smartest but is anyone ever the smartest? Is someone you work with the smartest? Or just some random person walking about? No. Same goes for just about everything thing else, whose really the strongest, toughest, bravest? Truth is nobody knows, for example; you may see The Strongest Person on Earth on tv or you may see spelling Bees  on tv but that shit doesn't matter there could be the strongest man somewhere in India or Africa that you've never heard about, There could be someone that's knows how to spell better than the next person (and yes I know my spelling is bad to the people that see this, I just don't give enough shits about it though, I just want people to feel better about themselves that's my only goal here maybe a mod can fix any errors and yes bad spellers that don't give a shit do exist 😁) think about it records are meant to be broken obstacles are there to be crushed so the truth technically is no one, there will always be someone new crowned these titles but does anyone really ever know? The world is a big fucking place, yeah some people may think it's them but that's just arrogance. Not everyone knows everything I guarantee it Not everyones on tv, not everyone wants attention and that's okay, so it's okay to be wrong every now and again, it's okay to be playing video games at my age, it's okay to be interested in video games and technology, and nerdy shit, it's okay to just be you and not pay attention to the news and the negativity going on in the world, it's okay to not know everything in the news or Its okay not to know the the grown up shit like taxes, insurance, finance stuff all this because you're gonna learn about it eventually 😂 (I'm 28) you just have to find your crowd, it's never too late. Everyone has something unique about them just be you. Just good ol' you. Its fine. This isn't saying don't learn this stuff or not to work on your weaknesses but just go at your pace, you might be a little slow at times but that's okay, everyone is different and we'll all eventually get there. It's okay to be the quiet one, maybe give your 2c on a subject or two, honestly who gives a fuck? Just be you and give yourself your heart back and let that shit beat like it's never beat before. Be kinder to yourself, the world is a big tough place, but it's even tougher when your beating yourself up all the time, so you're gonna change that feeling because the world can also be a wonderful place because it teaches us lessons to life, something you'll miss out on if you're not here. So from here on out just live and don't worry so much.- Signed: Someone who has aspirations of working in IT (like I said I'm a nerd 😋), but stuck in a deadend job at minimum wage because of my social anxiety issues since childhood that I've never worked on until now and will continue to do so. Also I don't smoke pot often because of my medication, but once I'm off that I hope to continue smoking this good stuff more often. 👌\"Anyways thanks for reading, this is hard to put out in the public on the internet but if reading this helps even one person to me it's worth it,  I'll continue working on more CBT stuff like meditating, being more mindful of myself and others, setting goals. My anxiety has gotten so bad that stepping into a store gives me cold sweats and my heart racing, at times I don't even want to leave the house, I bailed on my friend a few too many times, (My only friend) who doesn't know about my issues and not really sure how to tell him about all this stuff, this friend is like a brother to me so if any advice or tips please feel free to share them. 🙂"
    },
    {
        "name": "t3_cftvkg",
        "created": 1563703293.0,
        "ups": 1,
        "downs": 0,
        "title": "Shades of SAD",
        "selftext": "Where should I start this from? The time I was in heaven or the time I’m in hell? Let’s chose the good side first! My life had nothing in it no achievement, no wealth, no goal, just zippo! But the greatest thing I had then was happiness, I was living a normal life just as a normal regular human would! But then the god took the one thing that really matters and cursed me with everything. I now had everything literally, parents paid off the debts in India so people won’t come hunting for us when we go back, I completed an AS degree, parents bought a ranch house, I was doing an internship, now only 2 years I had to struggle at a 4 year university and I was ready to settle. But at this point I had lost everything, even after having everything. Did I mention I was also in great shape? Yeah, heard it right, I was 140 pounds lean muscles from 3 years of continuous gyming, on top of that I was a vegetarian and a non- smoker and a non- alcoholic and all a nicest guy could ever possess. But I had lost it all! My peace, my calmness, my confidence, my normal ness; in other words my happiness. Right when I moved in to the new house when I almost finished AS degree in the early years of 2019.  I was a freak, a creep, a weirdo, a retard, and so much more a person with SAD is called out with. And I agreed with all, I myself believed I am this person, I have no life all the hard work was for nothing, if I will be living like this for the rest of my life. Did I mention my experiences? Oh boy, here we go… I am afraid to do family dinner, to walk to my car, to go to a restaurant, to sit in a class, to go to the internship, to go to the gym, even hanging out with friends, basically everything! All I liked doing was to be alone to sit in my room with windows and doors closed. I am living in hell!!! I eat food like an animal, I was fond of enjoy eating food, but now just to show I’m having something in my mouth. My life has no meaning now, all I wanted was for the god to take everything from me and return back myself. I tried commiting suicide before but I was addicted to playing a stupid game alone in my room, that I couldn’t free myself. I am so worst I am the guy who makes everyone feel awkward. I am the shame in the family, I’m ashamed to be born at my lovely parents. Now I have taken steps to improve myself; to be normal, but so far nothing has worked out. I have tried total exposure theory;  which in my opinion only works out for particular event. I am now finding peace  in drinking, smoking and doing drugs. I drink and smoke from time to time( hiding this from parents). I think, if I keep going on this path, I will be even more shame to my family. Everything will also call me an addict alone with being so many other names. I can foresee my future, neither will I be able to complete my bachelors degree, nor will I regularly attend internship. With these failures I will bring in more drugs, and stuff; which will eventually slowly end my life. Now I don't foresee my future self getting married, but I can predict the outcome if I do, I will be divorced within weeks! Having failure in life and addiction to drugs, I will lose everyone close to me. I will be lonely, eventually I will kill myself hanging or hire someone to shoot me in my head; I have read these are the quickest and painless ways of going out. Now this is the prediction if I end year 2019 being a weirdo. Hence, I will give myself time to improve, if not than, this way of ending life is too slow; I would rather do it soon enough!"
    },
    {
        "name": "t3_b6ejag",
        "created": 1553777112.0,
        "ups": 2,
        "downs": 0,
        "title": "[Need help] How to manage my anxiety about fatherhood",
        "selftext": "I am 36 from India. My wife is 36. We have been married for 8 years. We courted for 10 years (it was a love marriage). Recently we decided to go in for IVF. I am and will always be against having children but my wife, mother, relatives, society and the whole of India wants us to have a child as that is the \"norm\".&amp;#x200B;We decided to try, after my failed attempt to convince my wife, starting 2016 full fledged. But she could not conceive naturally as she could not endure the pain of intercourse. So, yes, no sex but she wants children (since, starting of marriage there was no intercourse but we decided to give time as we both were inexperienced). Anyways, we went in for IUI (artificial insemination) couple of times and it failed. There was a long gap between subsequent IUI's because of my mother's cancer. Now, she underwent a surgery for endometriosis and the doctor finally told us to go in for IVF.&amp;#x200B;I am not financially stable. I do not want to spend all my savings on doctors and children. My wife used to work till 2015 but she does not want to work anymore and want to have children. The IVF cost is going to be around USD 4,000/- followed by delivery charged to the tune of USD 1,500/- then whole life I have to spend on the child. My own medical expenses are a lot monthly.&amp;#x200B;This has resulted in lot of anxiety for me to the tune of panic attack. What can I do to reduce it? I cannot talk to my wife as I have done it multiple times with no success. She just doesn't listen. And no use talking to parents. I cannot go to a therapist as it will result in flurry of questions and accusations.&amp;#x200B;Just tell me how to handle it. Thanks."
    },
    {
        "name": "t3_akz26w",
        "created": 1548789527.0,
        "ups": 7,
        "downs": 0,
        "title": "I (19M) finally gathered the courage to talk to a therapist",
        "selftext": "I am a college student in India, and have been dealing with a myriad of issues for some time now, which includes resurfacing childhood abuse, conflicting sexuality, severe trust and financial issues and a lot more.Since the past few months Ive been severely suffering from anxiety. Panic attacks in the middle of the day for no obvious reasons, sleep paralysis and nightmares almost every other night, didn't have the will to perform basic actions like brushing my teeth, taking a bath, even sometimes waking up was too much of a task. I'd started isolating myself from all my friends and would just sulk in my room all day. Its like there's a switch somewhere inside my brain- at one point I am all jovial, happy and laughing and then the next second my face drops, heart starts beating like crazy and I'm trying to hold back tears. 2 weeks back, out of the blue, I had this window of clarity suddenly, and I finally decided to seek help. Since I'm a college student, I have a lot of financial constraints, and after looking up the hourly rates on Google, the fact that I can't afford a psychologist stressed me out even more.But then I found out my college has a permanent student councillor and therapist, and every day I'd start walking to her room, only to tell myself this is a very bad idea, stop midway and go back to sulk in my room. This routine went on for 4 days, until I finally convinced myself today that I fucking need to go in and seek help, and I didn't stop, I continued walking until I reached her room, opened the door ,walked in and started talking. All the while my mind was still blaring like crazy- this is a bad idea! This is a bad idea! But while I was shaking inside as I told her about my problems, when I exited, I actually had a plan with me, as to how to tackle it all one step at a time! After a long long time, I think I finally made the right choice today."
    },
    {
        "name": "t3_bfeeqa",
        "created": 1555808489.0,
        "ups": 1,
        "downs": 0,
        "title": "Just need to vent",
        "selftext": "I'm a college freshman from India, just got done with my pre-uni finals last year with a pretty good score. Physics was the subject I found most fun, so I kept a high bar for myself. The paper looked pretty easy, so I took my own time solving it. Was down to just two more questions (had the most weightage in the paper. Were also the easiest ones) until I realised time was up. My stomach caved in as I passed it onto the Invigilator. Results were due in 2 more months, and I spent both those months overthinking every possibility from me not getting into a good college to outright failing the subject.  The results came out and I actually ended up scoring 80% on the paper. I went through it and there's no way I scored that good (me not being able to finish the paper and all). This kinda pissed me off even more cause I knew the paper was really easy, and I would've scored really well on my own (it was probably an upgrade from the lecturer, or could've just been a correction error)  if I managed my time better. Almost applied for a re-exam due to the anxiety of not knowing if it was really my score. Still bothers me to this day cause I worked hard and aced all the other Physics exams, but feel like I didn't earn this one. Maybe I did really score that well, maybe I didn't. The uncertainty still kills me"
    },
    {
        "name": "t3_brqt4t",
        "created": 1558571015.0,
        "ups": 1,
        "downs": 0,
        "title": "Graduation is soon and I have so much anxiety constantly that I can hardly function",
        "selftext": "My family is going to be at graduation in a couple of days and I have to interact with a huge group of them. They sort of embarrass me and I really don’t like them very much. My mom and dad are reluctant of my boyfriend his family simply because they’re white, and with us being Indian, they think that white families are more trashy and less educated and not as good. It’s absolutely stupid. I’m dating him regardless and I told them that. Well they’re gonna be meeting my boyfriend and his family and I’m worried with how it’s going to go. I just pray they’ll be nice and friendly but they hardly interact with people outside of Indians. They’re so caught up in their racist bubble that they don’t try to see that my BF and his family are some of the nicest people. They finally are starting to mow after two years of fighting with them, and I’m just really anxious. I’ve hardly slept, I feel nauseous and worried. How do I ensure it all goes smoothly and my parents are nice?They even make me feel guilty for dating in general. They think it’s a western thing to do and that I’m losing touch with my culture. I told them screw it and I will do whatever I want. But I’m always scared. Any advice on how to deal with my insane parents? They live in like 1800s traditional India sometimes"
    },
    {
        "name": "t3_9p92zh",
        "created": 1539896759.0,
        "ups": 17,
        "downs": 0,
        "title": "7 more tips for reducing your anxiety, without taking meds or going to therapy",
        "selftext": "In this post you’ll learn 7 new, very powerful ways to lessen your anxiety, without using medication or therapy. &amp;#x200B;I’ve written a pretty well read with my first 7 tips to defeat anxiety not so long ago. If you are interested you can read that post here: [https://www.reddit.com/r/Anxiety/comments/9j3aol/7\\_tips\\_for\\_reducing\\_your\\_anxiety\\_without\\_taking/](https://www.reddit.com/r/Anxiety/comments/9j3aol/7_tips_for_reducing_your_anxiety_without_taking/)&amp;#x200B;Trying to defeat your anxiety can be very hard and overwhelming. Defeating anxiety might be the hardest things you'll ever have to do in your life! But sometimes small changes can bring about big results. And whoever you are, the tips in this article WILL lessen your anxiety. I’ve seen these tips work personally, and most of them have been scientifically proven. Some of these tips might totally change your life!&amp;#x200B;So here we go: 7 more tips to reduce your anxiety:# Anxiety tip #1 - Stop Watching The NewsWatching the news can produce a lot of anxiety. Our subconscious brains are not good at putting the news in perspective. They have a hard time realizing that the war we are seeing on television, is actually 2000 miles away. Because of this, **news can make us feel like we are in serious danger, when we are actually totally safe.** If you stop watching the news you’ll be a little bit less informed about what’s going on. But you’ll be shocked to find how little that actually matters. Experiment with not watching the news for a while and see what happens. &amp;#x200B;# Anxiety tip #2 - Talk to people about your anxietyA lot of us don’t want to talk about our anxiety to others. I used to believe that I would scare people if I told them about my doom-thoughts about the world, so I never talked to anyone about my anxiety. But it helps a lot to talk about all your anxious feelings and thoughts. It can make us feel very lonely if no one knows what is going on in our heads. **If we talk about our anxiety, we’ll feel less alone and more connected to others.** It will surprise you how many people want to talk with you about your anxiety. Most people actually love the feeling of helping people they know!We got to make sure we ask them about their problems too though. This way we can get a very healing dialogue going. With anxiety we can feel like it’s us against the big scary world. Talking with other people about your anxiety reduces this feeling a lot. &amp;#x200B;# Anxiety tip #3 - Find out which emotions you have suppressed, and express themThere is a big link between suppressed emotions and anxiety. Suppressed emotions are emotions that we did not allow ourselves to feel when we were younger. Maybe when we were a small child, our parents stopped giving us love and attention if we got angry. Because we were so dependent on our parents back then, we started to suppress our anger to not get in trouble. Then we might have internalized that, if we are angry, we are not worthy of love.But deep down the anger is still there. This creates a lot of internal friction and…ANXIETY. **Expressing and feeling our suppressed emotions can lower our anxiety a ton.** Want to find out which emotion you have suppressed? Ask yourself this question: ‘What emotion in others triggers me the most?’What is your answer?There is a good chance that this emotion is actually the emotion that you have suppressed in yourself. &amp;#x200B;# Anxiety tip #4 - Do Breathing ExercisesAn increasing amount of research is currently being done on certain breathing exercises from India. And many have been found to significantly decrease anxiety! Especially breathing exercises from a system called ‘Sudarshan Kriya’ has been scientifically shown to work very well against anxiety. I personally do these kinds of breathing exercises almost every single morning. When I started doing them I found a giant decrease in my anxiety. **Doing these breathing exercises is by far the most effective thing I’ve ever done to get rid of my anxiety.** These exercises actually work remarkably quick too. After one of these exercises you’ll usually feel immediately calmer than you did before. Here is a link to a video explaining one of the exercises that is part of the Sudarshan Kriya system: r/https://www.youtube.com/watch?v=IQrsJ-yZWV8&amp;t=153s&amp;#x200B;# Anxiety tip #5 - Get an evening ritualMost of us know that morning rituals can be great. But have you heard of evening rituals?Getting the best sleep that we can is critical if we are suffering from anxiety. But most anxious people are bad sleepers. We have a hard time calming ourselves down in the evening.Having an evening ritual can help you with this. Put your phone on airplane mode and turn of your computer after a certain time. Then only do things that calm you down, like reading, listening to music, writing, etc.Doing this consistently will help you rest and de-stress. The we can get our bodies and minds calm in the evening, the less anxious we will become. **Being offline in the evening and focusing on calming activities can reduce our anxiety big time!**&amp;#x200B;# Anxiety tip #6 - Practise mindfulness meditationMindfulness meditation has been scientifically proven to work in helping with anxiety disorders. I’ve personally meditated daily for years now, and found it to be great source of happiness and peace. **Mindfulness meditation will not only decrease your anxiety, it will also make you better at enjoying life in general.** Mindfulness meditation DOES take time to start working. Expect to do it daily for at least 1.5 months before you start feeling some real results.If you can get yourself to practice mindfulness regularly and in the right way, it can definitely help to reduce anxiety.# Anxiety tip #7 - Be In Physical Contact With PeopleBeing anxious can produce the stress hormone Cortisol. Being touched regularly actually decreases the amount of cortisol in our bodies, making us feel less stressed and less anxious. Some of us feel like we are not the ‘touchy type’. But by practicing we can become much more comfortable with touching other people and being touched ourselves. Most people like being hugged by people they like. **We can make a habit of hugging our friends, family, and maybe even co-workers.** If we have very little ‘touch opportunities’ in our lives, we can get a massage every now and then. Or we can try to join some kind of social group where hugging is considered nice and normal behavior.As a teenager I had long periods of time where almost no one touched me. It ramped up my anxiety a lot! Being touched is important. Getting more soft touching in your life can make a world of difference..&amp;#x200B;Those were seven more tips for defeating anxiety. I hope you found them useful.  If you liked this post and you would like to help me make more of this material, please fill out this short questionnaire:r/https://docs.google.com/forms/d/e/1FAIpQLSf81uqTroBPVHOo26x2KzxPtP_MYVBP0vkGb2MsxUABNSsjDw/viewform?c=0&amp;w=1The questionnaire is only three short questions and is totally anonymous. It would mean the world to me if you could fill it out!So if you have 55 seconds to spare, please fill out the questionnaire.The questionnaire helps me get a feel of what you are lacking in your struggle with anxiety.r/https://docs.google.com/forms/d/e/1FAIpQLSf81uqTroBPVHOo26x2KzxPtP_MYVBP0vkGb2MsxUABNSsjDw/viewform?c=0&amp;w=1Take Care!"
    },
    {
        "name": "t3_b6gk0a",
        "created": 1553793295.0,
        "ups": 3,
        "downs": 0,
        "title": "I’m going going back back to Cali Cali",
        "selftext": "It’s been two weeks since I took my first trip out of the country, first flight and away from people who help me ground myself when I’m going into that downward spiral of panic and dread and anxiety. I had reinvent myself in a way while I was in India. The initial jet lag was triggering mild panic attacks those first few days. I cried a few times too 😅I’m so happy to be going back home but so anxious about flying. Here we go again. "
    },
    {
        "name": "t3_b981dg",
        "created": 1554379647.0,
        "ups": 2,
        "downs": 0,
        "title": "Jet Lag",
        "selftext": "I’ve been back in California from India for a few days now. The jet lag wasn’t as bad the first couple of days. The whacky sleeping pattern wasn’t a big deal. Today around noon I felt like I got off a carrusel after hours of going in circles. It’s almost triggered a couple of mild panic attacks 🤕🤮😭"
    },
    {
        "name": "t3_90e3vq",
        "created": 1532102319.0,
        "ups": 6,
        "downs": 0,
        "title": "Does it get better?",
        "selftext": "Hello.This is the first time that i'm opening up about this, so please be kind.I'm from India - stereotypically known as the land of doctors and engineers. And while that's just a stereotype, my studies give me anxiety. I had my first attack two years ago - and I have been talking to people since then - but my recent graduation exams have left me worse then ever. What i want to know is, when was your first attack and how are you doing now?"
    },
    {
        "name": "t3_9czkbq",
        "created": 1536122827.0,
        "ups": 3,
        "downs": 0,
        "title": "Sick, anxious feeling after watching the AHS trailer. (Trigger Warning)",
        "selftext": "As I was cleaning a theater at my job, I saw a trailer for the next season of American Horror Story. It featured a mushroom cloud and the season is called \"Apocalypse.\" My parents watch that show and now I'm going to have a show about nuclear war playing in my house. Seeing that subject pop up in the media lately (Mission Impossible, Fahrenheit 11/9, etc) makes me sick, and it gives me the feeling that it's coming. I don't even want to think about what's going on out there since I don't watch the news, and I don't know how I'm going to focus on my life."
    },
    {
        "name": "t3_b21sxp",
        "created": 1552828164.0,
        "ups": 2,
        "downs": 0,
        "title": "Doubt regarding a medication and my experience with a not so good psychiatrist",
        "selftext": "I'm 25 years old. Male. From India.&amp;#x200B;This is just a post to ask you guys about a medication a  doctor recommended me for my anxiety. This is also just a post describing my experience with him. I hope you guys get something out of it.&amp;#x200B;All my life I felt that I had generally high anxiety. I right now has no job and is kind of afraid to try out something new and challenging.&amp;#x200B;Yesterday, due to my mom's advice we went to see a psychiatrist. This guy happened to be one of the many mental expert guys whose approach I didn't happen to like.&amp;#x200B;We were half an hour late for our appointment. But we called him on the way and said to him about it. Then when we reached the place, there were no other patients. We went in.&amp;#x200B;He asked. I started explaining the things. I feel afraid when starting some new things, meeting new people in a social gathering, going to new places, facing interviews etc. I said that I worked for one year after my post graduation in a field unrelated to my studies. Then left it as it was a dead end job. Just after my post graduation, I sat at home for close to one year due to fear of facing interviews. After that only I went to work. That too I got the work because of a recommendation by a well wisher of mine.&amp;#x200B;This doctor was kind of angry/irritated. From time to time he was looking at his watch. Then he said, \"So, now you are doing nothing.\" We had already gone to another doctor before and he was sitting there just to get some money. He tried overblowing my problems and make it look like a big thing. So I had left him. This doctor asked about that and I just said that I didn't like him.&amp;#x200B;Now a few weeks later I have an exam coming up for a job and this doctor was like, \"You really need to study for that.\" I know that I need to study. But he was over emphasizing the thing. Like it's a do or die situation. My anxiety increases when I'm put in such a mindset. So I just took it easily.&amp;#x200B;This doctor was not smiling at me. I felt like he was not that interested in me. His body language and talk all communicated to me something like he considered me as somewhat of a pathetic person who has not put in some needed efforts. At least that was the kind of vibes I got.&amp;#x200B;Then he started counting the problems I am having like, lack of energy, interpersonal relations going bad, negative thoughts etc. Then he asked me like, \"Shouldn't we change all this?\" I said yes.&amp;#x200B;Then he prescribed medication to me. Now I am a bit afraid to take medicines and I asked him if it would be a problem to take it. Then he was like, \"Don't you take medicines when having headache, fever, infection etc? Take it just like that.\" He specifically said that this medicine won't cause sleepiness. The medicine was Escitalopram oxalate.&amp;#x200B;I came back home and googled the medicine and there it said in the side effects that there would be sleepiness. Then I looked on reddit and some of the people said they felt kind of foggy in the first week. Also the internet says that stopping it suddenly can cause withdrawal symptoms. I felt it is better not to take this medicine and better not to go to this guy who seems to have a short temper.&amp;#x200B;What do you guys know about this medicine Escitalopram oxalate?"
    },
    {
        "name": "t3_aorkt1",
        "created": 1549740680.0,
        "ups": 1,
        "downs": 0,
        "title": "How to explain anxiety?",
        "selftext": "Hey everyone. So, I have anxiety. Obvious because of the question. It's something I can live with most of the time but I have my days. My SO and I (we're currently on a temporary break for me to figure things out, but calling him my ex hurts.),we started dating when I was 15 and he was 16. It's been two years now.About 6 months into our relationship, I was going through a very hard time and was almost suicidal. I told him about this and his immediate reaction was that I had problems. He also said he was scared of me. I was too hurt to do anything at that point so I let it slide. This behavior of his persisted and I told him I needed a break. Fast forward to now. He feels that his behavior was childish and immature and I wish I could explain exactly how it is for traction.I'm in India and there isn't much awareness about mental issues here so that justifies his reaction a bit. Any suggestions on how to phrase it are welcome."
    },
    {
        "name": "t3_b06858",
        "created": 1552415523.0,
        "ups": 2,
        "downs": 0,
        "title": "How NOT to help someone who is down. Rule 1: Do not invalidate their feelings.",
        "selftext": "So, I'm 25, male, from India. Not clinically diagnosed as having anxiety, yet feels anxious than most people around me.&amp;#x200B;I haven't yet made a solid career move and my anxiety and fear keeps me from revealing to myself what I truly want out of life. I want to become a writer. But then I get doubts if I really like that or if I am choosing it just because it involves less interaction with people.&amp;#x200B;Then I used to have a gf. I used to like her for a long time but never went ahead and told her my feelings. She first told me that she had feelings for me. I thought she was trying to make me feel embarrassed. I didn't take her seriously. Few months later she again told me. This time I reciprocated just because some of our friends told me maybe she likes me. That's how the relationship started.&amp;#x200B;Now I poured all my anxiety and fear to her, to get some relief. She couldn't handle it all and said that we should part ways. I too felt it would be better. Her parents are looking for a groom.&amp;#x200B;This breakup happened two months before. We got into a relationship around 4 years ago. Relationship was not going good at all, due to my anxiety and fear.&amp;#x200B;Now I haven't gotten over her. Besides I don't know what career I should take. I am trying to work things out. Sometimes I feel sad about this whole affair called life. Like, where is the happiness? I used to be more happy before. Even during the relationship, we had some happy moments. Now it's all gone. She is practical.&amp;#x200B;Let me come to the point. I texted one of my female friends just like that and said life is so sad and boring and shit and happiness is not seen anywhere around. I didn't mention about the breakup. The female friend of mine is actually a close friend of my ex. I didn't want to bring up the breakup thing to her. Previously when we used to have fights, I used to text and call this female friend to know what my girl was doing. I have another female friend too who is also her close one. I think I kind of started talking more to them only after I got into a relationship with this girl. Whenever we used to have temporary breakups, due to my fear and anxiety, I used to contact them to know about this girl.&amp;#x200B;Well last day I said to this female friend about life is difficult. Like a general topic. Then she was like it's all going to be ok and that we'll know along the way what we want out of life. Then she was like I don't have much problems now, that I am thinking and creating non existent problems. That I should stop thinking this much.&amp;#x200B;I am sure she doesn't know what it's like to overthink or feel anxious. Whatever a person is feeling, it is never invalid. Please don't say to someone that they're problem is not at all a problem and that she should stop thinking too much."
    },
    {
        "name": "t3_bc22la",
        "created": 1555029678.0,
        "ups": 1,
        "downs": 0,
        "title": "Am I the only one who lose my focus and just forget my points and meanings while I'm talking because of my insecurity?",
        "selftext": "I have just started my journey with Yoga Teacher Training in India, and it's my first time travelling alone. I'm a nervewreck and I cried my eyes out this evening after the opening-seremony where we introduced ourselfes in front of everybody. I was SUPER nervous and I just couldn't express what I wanted, and started to think \"Aahh, what impression do they have of me now, do they think I'm awkward and shy, and do they cringe while I'm speaking?\" This lead to serious focus-problems, and I forgot everything I planed to say.I know that people are mostly concerned with their own, and how themselves appear to others. And I'm sure we will look back at yesterday laughing, thinking about how stupid and unnessesary it is to be nervous. BUT it's so hard for me to forget these kind of situations when my social anxiety is taking over. And maybe the worst problem is my attention in conversations. I can talk to somebody or to a group, and then I suddenly just forget my point, and starts \"uuummmhhh\" \"hmmm\"... It's very frustrating, because I have so much to give in discussions, and my brain just stops working. Any advice for this?Life is not that fucking complicated. And I have realized how my overanalizing is killing me and how much it affects my mindset. I really need to do this for myself, to become more confident, find inner peace, learn to love myself for who I am, be more present, improve my English and most importantly - worry less about the future and others opinion about me.So - what's your best advice?"
    },
    {
        "name": "t3_azchjm",
        "created": 1552223666.0,
        "ups": 2,
        "downs": 0,
        "title": "I'm 25 and I feel like I'm having teen angst only now. Does it happen?",
        "selftext": " I don't know if this is the place to ask this question. If this post is more apt for some other sub, please recommend.I am 25, male. from India.I feel like I am having teenage angst only now. I do a small job at an office. As small time journalist. I say this because I didn't have any background in journalism. Got the job because of recommendation. I am afraid and anxious about a lot of things. Generally more anxious than others around me. Have NOT been diagnosed as having crippling anxiety by a professional.Recently started feeling that elders around me were lying to me. They said studying and getting good grades can help you. That's the main thing. I was quite studious in my school days. In my 11th and 12th I had difficulties. But NOT due to teenage problems. I chose the wrong stream. Science. I was inclined towards humanities. Literature. I was afraid to change schools to pursue literature. So stuck with science. Was feeling tension back in 11th and 12th. But still managed to get a decent percentage.Then in degree I took literature. Now I complete M.A. But recently I realized that my anxiety and fear is causing me so much of problems. After M.A I simply sat at home for like one year just because I was afraid to go for interviews. Right now, after doing a job (a dead end one) I feel like I got some life experience.People always said that studying is the thing which would help me. Right now I realize that people use their connection and influence to achieve their thing. Non studious people are doing better than me and they're cool about it. Elders said to concentrate on studies more and not to get involved in romantic affairs. But they actually wanted me to experience those things. They feel that if they tell the truth to young people, the young people may take advantage of the situation. But I was too obedient. I believed that getting into relationships in schools is wrong. Elders have this belief that only if they are too strict would the children be obeying half of what they say. But that was not the case with me. I obeyed fully of what they said.Now I feel regret that I listened to my parents and elders about all of those lies. Besides nobody told me to take care of my anxiety and fear. I thought they would go away on its own once I enter my twenties. Now I am solidly in my twenties and I realize that only if I take action to overcome my fear and anxiety will it go away. Recently my mom said that it is ok to get into relationship and drink and smoke, just to have an experience about it. I was furious when I heard that. She lied to me because she believed that I would go into the wrong path if she reveled the truth. She never saw that I believed whatever the elders said. That I kept my brain as a showpiece.Even now I feel that elders don't really understand me. Mom talks about getting me married (we have arranged marriages over here). I say that I am not mature enough for that. She doesn't believe that. Her talk and body language conveys it to me.Moreover, I am in the midst of a breakup. My first love. Happened in my early twenties. Was anxious while in the relationship because I was brainwashed into thinking that getting into relationship is to be done only after at least getting a job. Besides I had anxiety and fear always with me. Didn't know how to take the relationship forward. Now I don't have a decent job (I'm leaving the job in one day). At the girl's home, they're looking for a groom. She says that I am too immature. Bit sad about this breakup happening.I really don't feel like 25. I feel like 16 or 17. Just a guy ready to go to college to have some fun. I have seen people going to college with that mindset.I was always a late bloomer. I thought it was wrong to talk about sex and get attracted to girls when I was in school. Only like, after getting into college did my perception change. Never even knew about masturbation till 16. But then, I was addicted to porn and masturbation after that.Does this 'feeling teen angst only in 20s' really happen?"
    },
    {
        "name": "t3_aya32t",
        "created": 1551973384.0,
        "ups": 2,
        "downs": 0,
        "title": "Do people with anxiety actually fear fear itself?",
        "selftext": "For the record, I am not diagnosed by any medical professional as having anxiety. But I feel that I have a generally high anxiety. I'm 25, male and from India.&amp;#x200B;I believe anxiety and overthinking are closely related phenomena. Yesterday I saw a video about amusement park rides and some scary ones made me feel a bit anxious. Like, I felt I would never be able to get into one of them.&amp;#x200B;I remember a time 5 years ago when me and my friends planned to go to an amusement park and that day morning I was getting all anxious and afraid, I couldn't eat properly. was feeling like vomiting (often happens with me). I avoided most of the scary ones.&amp;#x200B;I read some articles about fear of riding amusement park rides and some of them mentioned about fearing fear itself. Now on a larger scale, do people with anxiety fear the notion of fear itself? I fear that if I go into one of those rides, I would be all tensed while waiting in the line and my hand would be all sweating and cold. I would like like a coward in front of others I feel.&amp;#x200B;What do you think of anxiety in general and the thing of being afraid of fear?"
    },
    {
        "name": "t3_asba1l",
        "created": 1550617259.0,
        "ups": 2,
        "downs": 0,
        "title": "I need help and I don't entirely know what to do...",
        "selftext": "So I moved across the country to attend Law school, leaving all of my friends and family behind. One day in September, my brain just started racing with thoughts like how I left all my friends and family, was having trouble making new friends, feeling like I wasn't good enough to be in Law School, feeling like I had no idea what I was doing, and many other thoughts. These thoughts started spiralling very quickly in my mind and I felt severely overwhelmed; I felt like I wanted to cry and I didn't know what to do. For lack of a better word, at that moment I felt crippled. I had to sit down and do some deep breathing exercises to calm down.It happened again in October while I was trying to fall asleep. That time, every time I shut my eyes, it felt like my mind was being squashed with the spiral of thoughts. It felt worse. It happened again in twice in November and once again in December while studying for finals.During winter break I went home. I realized I needed time to myself so I told myself I would relax. I had planned a trip with some friends to go to a resort in Denver and relax, spend time with my mother, and just enjoy time with my girlfriend. That didn't exactly happen. What ended up happening is my girlfriend broke up with me (she spent two weeks in Belize while I was taking finals and it was life changing for her so she came back and decided that she wanted to work towards travelling the world and didn't feel like she could do that while in our relationship) and on Christmas my grandmother (maternal) in India had a stroke so my mother flew to India to be with her (so my mother wasn't at home. I couldn't go with my mother because my passport was back in Law School and I felt helpless). A week after break was over (and I was back in the semester), my other grandmother (paternal) in India passed away. Last week my grandmother (maternal) went back into the hospital and is now in need of a pacemaker.Since I got back to this semester, the intensity and frequency of my overwhelming mind spirals have drastically increased. They happen about twice a week and now they include thoughts about what I did wrong in my relationship, how I feel helpless about my grandmothers, am I losing myself and who I am, whether I will actually get a summer 1L internship, am I cut out for this, feeling as I am not learning the same as my classmates, etc.I starting seeing a University provided therapist a few weeks ago but I feel as though it's only getting worse. I don't know what to do and I honestly feel scared. My mind constantly feels pressed now and the spirals aren't getting better. Does anyone have any advice that could help me? I appreciate any advice that you may have!"
    },
    {
        "name": "t3_b2gmd1",
        "created": 1552930616.0,
        "ups": 1,
        "downs": 0,
        "title": "25 Hours Later",
        "selftext": "So....Imagine going from crippling panic/anxiety to taking your first flight across the world by yourself. That was me over the weekend. I tried picturing the trip as a dentist visit. A veeeery long dentist visit. My heart definitely skipped beats when the plane started to shake or make weird noises but hey, It was just the wind... the fucking wind!! If anyone is wondering I went from California to New York to Abu Dhabi to India. My flight home will be “better”. India to Amsterdam to California. "
    },
    {
        "name": "t3_1wh27o",
        "created": 1391041574.0,
        "ups": 172,
        "downs": 0,
        "title": "Life-changing resources I've found for dealing with anxiety",
        "selftext": "What's helped my anxiety the most weren't things I added to my life, but things I REMOVED. For instance: * **The news.** I stopped watching, reading, and listening to it altogether. No more conspiracy sites, gloom-and-doom economy blogs, or how to survive the apocalypse. And no more sensationalist overly dramatic headlines. It never helps me on a daily basis, and most of that information is worthless, wrong, or harmful. I replaced the news with happy content: standup comedy, funny movies, uplifting songs, joy-inducing books. It really helped. ([My favorite \"anti-news\"](http://www.pinterest.com/charliehoehn/anti-news/)) * **Caffeine.** I only have 1/2 cup of coffee each day, instead of 4. I don't drink aspartame either ([it's poison](http://www.ncbi.nlm.nih.gov/pubmed/8373935)). * **Vampires.** Not the characters in the Twilight books, but people who were constantly sucking the life out of me. I had to cut them out because they always made me feel so much worse whenever we interacted. I made a conscious effort to surround myself with positive people instead. It was one of the best decisions I've made.That being said, I have come across a number of amazing resources that shifted my mindset and ultimately helped me conquer my anxiety. All of these things changed my life for the better:**BOOKS**[Play: How it Shapes the Brain, Opens the Imagination, and Invigorates the Soul](http://www.amazon.com/Play-Shapes-Brain-Imagination-Invigorates/dp/1583333789). The message of this book hit me like a brick wall: I was constantly depriving myself of play, which made my hyper-anxious. For years, I’d mentally blocked myself from having guilt-free fun. I was an isolated workaholic who was extremely adept at rejecting everything that wasn’t productive. I couldn’t enjoy any form of leisure if it didn’t earn money or help my career. I never allowed myself to play or be in the moment, because that meant I wasn’t working. But I couldn’t really work because I always felt tired and jaded. And then I burned out. This made me realize what I needed to do to get back to my normal self: allow myself to play again.[Outwitting the Devil](http://www.amazon.com/Outwitting-Devil-Secret-Freedom-Success/dp/1454900679). Napoleon Hill -- the author of the perennial bestseller *Think and Grow Rich* -- wrote another book in the 1930's... that was just published two years ago. They never released it during his lifetime because it was considered too controversial, and his family worried about it destroying his reputation. Ironically, this book is arguably better because it talks about how Hill (and thousands of others) overcame their crippling anxiety and deepest fears.[Remember Be Here Now](http://www.amazon.com/Be-Here-Now-Ram-Dass/dp/0517543052). This book’s simple reminder to live in the present changed my life. I later discovered that Be Here Now inspired Steve Jobs’ trip to India and his experiments with LSD.[Trauma Releasing Exercises](http://www.amazon.com/Trauma-Releasing-Exercises-TRE-revolutionary/dp/1419607545/). Tremors are a natural means for mammals to discharge excess energy after a traumatic event. But unlike most species, adult humans typically prevent themselves from having tremors. Why? Because we avoid behavior that makes us look weak or vulnerable. In other words, we are so self-conscious that we unknowingly block our body’s natural (yet embarrassing) function during times of great stress. As a result, we make it super difficult to overcome trauma because we’re constantly holding in so much excess energy. That's what TRE does- it releases the deep chronic tension anxious people hold in from constantly working themselves into fight-or-flight mode. And it really works. Look on Youtube for demos of the exercises if you don't want to buy the book.**PRODUCTS**[Aerobie Flying Ring](http://www.amazon.com/AEROBIE-PRO-RING-Colors-Vary/dp/B0000789T2). I'm a big believer that exercise should be fun. And since exercise is scientifically proven to reduce anxiety, stress, and depression, I try to get my exercise through outdoor sports I can play with friends. This is the best toy for playing catch because you're constantly having to run around while chasing it. It’s light, durable, fun, and cheap ($9).[Vitamin B](http://www.amazon.com/Twinlab-Stress-B-Complex-Vitamin-Capsules/dp/B0000531CQ) and [fish oil](http://www.amazon.com/Coromega-Omega-3-Supplement-Squeeze-90-Count/dp/B000FFQATA). Anxious people tend to be really low on vitamin B12 and omega-3 fatty acids (stress depletes these resources). I started supplementing with two servings of fish oil and vitamin B every day, and within a week, I was feeling sharper and more energetic. That tight feeling in my brain disappeared. **SITES**[Flux](http://justgetflux.com/). The bright white light that you refer to as your “computer” might be disrupting your internal rhythm at night. Get this free app to have your screen’s lighting automatically switch to a sunset hue in the evening. And if you TRULY want to reduce your anxiety, stop looking at all screens -- including your cell phone -- by 9pm. Trust me.[Raptor Mascot on Rollerblades](https://www.youtube.com/watch?v=mEcPBq7zxto). Every time I thought I was going to have a panic attack, I'd watch this video. It was like my reset program, and I STILL crack up every time I see it. If all else fails, just keep watching this on repeat until you’re no longer worried.[How I Cured My Anxiety](http://charliehoehn.com/2013/05/19/how-i-cured-my-anxiety/). Here's the story behind the first big realization I had which ultimately allowed me to overcome my anxiety. (Disclosure: A little self promotion-ish, but more than 100,000 people have read the post and it's helped a lot of them).# # #What are your best resources? What's changed your life? Update: Just posted [this](http://www.reddit.com/r/Anxiety/comments/1wlc76/id_like_to_give_ranxiety_my_book_on_how_i/), all thoughts appreciated."
    },
    {
        "name": "t3_ax3r0f",
        "created": 1551708235.0,
        "ups": 1,
        "downs": 0,
        "title": "Workplace anxiety",
        "selftext": "I just got into a new job a month ago in Network Support.Its a very stressful environment....speedy decision making is key ...but so is being accountable..i feel its going too fast for me...i've been constantly forced into different tasks with little or no training ..although my colleagues are nice people and helpful i always end up doing mistakes.. i feel  so guilty and stupid because i am a slow learner and have always been...going to work everyday is like going to war..anxiety is affecting my focus and overall performance..i am just too busy worrying whether i 'll screw up that i am just struggling to learn things....where other people try to find new things to learn ,i am too afraid to step out of my comfort zone .This upcoming week i am supposed to handle a service provider ...the girl who usually does this is on leave and i am supposed to step in for her...although she did teach me a few things briefly I am afraid how will i do because it is a job of tremendous responsibility...Also this upcoming sunday its my turn to take follow up from service providers for network links which are down...i'll be the only one in the office with no one to guide me on that day with a boatload of responsibility  and i am still just trying to make sense of how things work here ...it'll be so damn overwhelming for me..i am bound to mess things up and have to answer for it ....i am expected to perform well in this case but the reality is i am a slow learner..my anxiety and worries cloud my mind and judgement and cause me to lose focus and learn things and take decisions at a slower rate than a normal person would...I've already avoided getting a job for a long time due to such worries...i can't afford to lose this one..I am constantly ruminating thoughts,i've been having trouble sleeping and nightmares about upcoming responsibilities at office...changing jobs will not be much use because i am afraid i'll be the same even over there...There's already so much unemployment here in India..It would be stupid of me to quit..I did see a therapist but she just brushed   off my condition like it was  nothing and tried giving me career  advice like that was supposed to help me..curse her!!!  I've tried talking to friends but none of them understands...My mom is just like me...i suppose i got my anxiety from her..she's been a housewife her whole life...she's very supportive of me but telling her about my condition would only  stress her out and i dont want that to happen..there's no use asking her too...I can't even imagine my life a year from now...I've already posted similar stuff here a couple of times...i just needed a place to vent 'cause i don't have anyone to talk to about my condition...sorry for the long post..."
    },
    {
        "name": "t3_afztoc",
        "created": 1547525608.0,
        "ups": 2,
        "downs": 0,
        "title": "This is killing me! Need some strong advice. Please help me friends.",
        "selftext": "Hello Folks,I am 21 years old Indian Guy and i need a very important guidance at this stage of my life. My father runs a business related to mechanical engineering and we're a middle class family. I've multiple differences with my father, biggest of them is ; i want to live life on my terms professionally and personally. My father is a very adamant and narrow minded guy i feel. He forced me to opt for science whereas i wanted to choose commerce after my High school and then this engineering thing happened which was again obviously forceful decision. I just finished my college time span of 4 years doing engineering which i didn't wanted to.I wanted to do Bachelor's in Journalism &amp; Mass Communication considering my interests.All my life I've been a dreamer and I've always thought that there will be a time after graduation when I'll get to live life as per my wishes. My father has a always imposed his likings and dislikings on me. During my school time my interest was developed in subjects like Economics, English and Hindi (National Indian Language) but he would continuously force me for studying Maths and talk about maths and what not. I was a playful kid and didn't studied much in my childhood but I managed to get average scores like 70 % . He didn't liked this,he wanted me to score top class and he started beating me with kicks,punches or even sticks. He couldn't bear that his kid is an average. This developed a fear in me and fear lead to lying. I started lying about my test scores and grades,he would catch me and then beat me more. With all these things happening around with a 9-10 years old me,i started loosing interest in studies completely. I would study very less and then fear while sitting in examination hall that i would be beaten when he would see the result. These things continued for around 4-5 years. I got some brain,i started studying right before high school because i realised that i can get rid of maths forever and study the subjects which i really wanted to. I scored well considering my records back then, scored 86% and i was happy that i can finally study what i wanted to. I was wrong,he forced me to choose science, was promised again that I can choose my graduation once I'm done with my school. Again a false promise,i waa forced to do engineering. I cried,a lot but that didn't changed anything.College,i unwillingly started my engineering college.I was seeking a vent for emotional balance ,i started smoking, drinking and i was least interested in studying engineering because 60-70% of it was maths and i hated every bit of it. 4 years passed,i cleared 36 exams out of 48 exams and i've lied that cleared them all.Done with college without any knowledge of my course,i started finding a escape from all of it. I knew that if i sat at home,he would ask me join buisness with him which I didn't wanted at all so i found a job at a travel company as a customer service agent.I was discovering this new world of customer service and how people working there are making good money. One thing lead to another,i found a job at one of India's leading start-up related to food home delivery. I was putting my bestest efforts at the job because this company had much better opportunities as an employee,one can switch departments and i was targetting management department.My pay was double as compared to my earlier job &amp; while these life sequences took place,my interest was developed in Entrepreneurship. But again, my father said that I've to join factory and i was given no choice,i took a stand. He asked me to leave home if i cannot live as per his terms,i left home. 4 days out of home,i stayed at my friend's place and i searched for a place which i was going to rent for my living. I got a call from Maa to come back and he has agreed  for me to do anything i want professionally. 10 days after i went back to home,he created a scene and asked me to leave the job and this time he created extreme pressure on me. I'm his elder son, I've a younger brother and he said that it's my responsibility to handle the buisness and all my life I've been a faliure and much more things that emotionally drained me at that moment. I decided to leave the job and join factory - Dad's buisnessToday, 14th Jan,2019.I've spent 6 months here in the I've been doing market job of bringing work and delivering work.I handle the accounts. Even i work on the machines because of shortage of workers.,still i get all the curse which my father says all day. He says I'm a looser and I've always denied what he has asked me to do. I don't talk to him now on a personal level.   I've tried talking to him and making him understand what i want to do but I've got no positive results. He becomes violent when me Maa are arguing for the right thing or making him understand something. I want some time to figure out yhe right thing but i can't think of anything staying here in this place and around him.I have a partner with whom I'm in relationship for last 4 years.My relationship is suffering because i don't get much personal time to spend with her. I'm most of the times in the factory &amp; in self doubt about how I've lived my life. He didn't let me take any decision on my own,i fear he will not even let me marry my partner because she's from a different caste and we're Bhramins. Being a guy who wants to go out in the open and have my own experiences,all this is killing me. I've got one life and i want to live it doing things which i like,which make me feel happy. I understood his point to giving me a secure professional option &amp; everything but that's not something which i seek. I want to have my own journey and i want to know how does it feels to become something on your own. My father has kept a condition that if i want to do anything else than joining his buisness wether it be a computer science engineering Job which was my college course,i will be kicked out of the house. I'm not very sure about leaving the housing or you can say I'm way more confused than ever. I love my mother &amp; younger sibling but the things happening around are acting like slow death. What should i do? Please tell me  I am shattered and lost now."
    },
    {
        "name": "t3_9966f2",
        "created": 1534908383.0,
        "ups": 4,
        "downs": 0,
        "title": "Went to hospital from severe panic attack and since then cannot gain control over my life, really need some advice / help",
        "selftext": "A lot has happened to me this year and this is my first time posting anything about my anxiety. I will try very hard to be concise and will include a TL;DR for anyone who doesn't want to invest or doesn't have the time to read the whole backstory. Thank you ahead of time if you have taken time to read this.**Edit: This doesn't seem to be getting anyones attention. If there is a better place to post, or some template I have not seen in the rules please advise me further.**---**Backstory**Earlier this year in March I suffered a severe panic attack that I needed an ambulance for. I didn't know it was a panic attack at the time, and I never identified as someone who was anxious, however, I can see some of the minor anxiety symptoms over the course of the last decade. The symptoms of that night I went to the hospital include:* Shortness of breath, cannot catch my breath, feels like cannot get any oxygen* Tightness of throat / chest* Sweaty palms* Tingling hands and arms* Pale skin* Shaking and shivering* Feeling faint (almost fainted, head and body dipped once or twice)* Any sort of physical movement made me feel like I ran around the block and would feel winded / more breathless. Even shifting my butt from one position to another was enough to make me feel like I ran a mile. (Easily the scariest symptom which the doctors couldn't identify as part of the panic)I was under an immense amount of stress at that time. My Uncle who I was close with passed away earlier in the year and left me a very small (emphasis on small) policy in my name which my grandmother, aunt, and father fought me over the entire first half of this year. We are not on good terms to this day. They texted me, sent me mail with evolving changing stories about how my Uncle actually wanted to use the money etc. I also started the biggest contract I had with a client. I run a development studio and was very excited to work on this project, but the project slowly turned into hell after my hospital visit.Fast forward to today..---**Triggers**Since that hospital visit I have had a couple dozen smaller panic attacks and cannot control the physical reactions that happen for certain random triggers. The triggers that I have identified so far are the following..* Eating and feeling full (the anxiety is worse if I am indulging in a light treat or something I know is unhealthy like fries. I eat very healthy and very light portions)* Travelling long distances in car / vehicle* Medicine (.. this one bugs me, needles, vaccinations, bloody Advil for gods sake)* Large amounts of exercise (what I mean is like a long run, or anything that you push yourself physically for)There might be more that I haven't identified but this is the bulk of the triggers I think. ---**Coping Techiques**I don't have anything that is really successful in coping with this, which is why I am posting here. The most frequent symptom that I notice first before any other symptoms is the tightening of my neck/chest. Mostly my neck, it feels like a giant grapefruit stuck in my throat half the day sometimes. I have been popping fishermans friends with extra menthol to cope with that. It numbs the throat a little bit so I don't notice it as much.When I feel a panic attack coming on I can't do anything. Doing things makes it worse, and I can't think straight. I need distraction so I usually just plop myself on the couch and turn something that requires no thought to watch on and just wait it out, sometimes a couple minutes, sometimes hours. It is preventing me from doing anything, from living. I have a big India trip my SO and her family and I are supposed to go on at the end of this year. I am FREAKING out about it because I don't feel capable of evening living in a comfortable house let along exploring a new place like India. The vaccinations I need are constantly on my mind and I can't get over them, and it feels like the end of times.I need to find a way to get over these symptoms and preferably before this trip so I can not waste a couple thousand by bailing last minute on this trip. Here are some things I have tried.* Breathing techniques (5 in, 5 held, 5 out, 5 held. It helps SOMETIMES, depending on the severity. It is annoying to half to stop half a dozen times a day to do this and consistent effort hasn't reduced the symptoms)* Grounding techniques (identify 5 colors around you, 3-4 sounds, 2-3 smells, 1-2 things you can touch. Hasn't helped) * Walks (Walks have always been almost spiritual for me and helped ground me a lot years ago, but they have very little affect these days. If my panic is setting in then I cannot do anything but sit still)* Therapists / Councilors* EMDR (I still feel like this might have some promise to deal with the childhood trauma but it is so expensive and I did about 7-8 sessions and ran out of money. Those sessions haven't really done anything. We never even got to the EMDR part yet really.)* Ativan (I took this one time and it didn't work for me aside from making me a bit tired. I have been to afraid to try it again as one of my triggers is pills / medicine)***On waitlist for Psychiatrists, nervous about the idea of taking pills for this***---**Additional Notes**I have some childhood trauma that I have sort of ignored for my entire life. I know there is 100% some impact to my ability to live happily due to this, but I am unsure of the connection to the anxiety. Due to this trauma I feel like I am constantly on alert. I NEVER feel relaxed, and always feel on edge. The only place I can sort of relax is at home doing very mundane boring things like gaming or television. It feels like it is getting worse the older I get.One BIG problem I have living my life today is that I cannot feel like I am in the present. Life passes by so quickly, and I am just floating there watching it pass me by. I feel constantly disassociated with life. When I am on a crowded bus or in a mall I feel like everything and everyone is not real. There is a lonely feeling of not having any support. In addition to that, if I have any future commitments, such as a big India trip coming up, I am further not able to focus on any tasks in the present. I have clients and projects that I have been working on and then BAM, India trip is a thing and I am not falling behind because I am incapable of pushing through this thing. One thing I have not mentioned at all is that I am so excited to start life / career projects when these symptoms are absent. It is so difficult because I feel ambitious, and I feel like I want to really start giving life all my effort, but then these symptoms creep in and turn everything around all the time. I feel bipolar sometimes.---**TL;DR*** Went to the hospital for severe panic attack* Since then getting constant smaller panic attacks and anxiety symptoms from really dumb triggers that I cannot control* Tried many coping techniques which have not reduced symptoms and often don't help with coping in the moment* Have known childhood trauma which I believe may be linked to current anxiety* Feel super duper disassociated and like I am alone, life moving by in a blink* Have upcoming trip to India which is freaking me out and I am not ready forIs there anyone better trained for this type of mental issues than a councillor or psychiatrists? Any specialized individuals?**Please provide me with some advice / help on things I can try. I am tired of letting life rule over me feeling powerless. It is so crippling some days all I can do is breakdown.**"
    },
    {
        "name": "t3_aoit9e",
        "created": 1549675599.0,
        "ups": 1,
        "downs": 0,
        "title": "I’m suffering bad",
        "selftext": "I didn’t know how to word the title, but I have PTSD and severe anxiety and depression. It affects every aspect of my life. I’m posting here because I honestly don’t know where else to post and I honestly don’t have any one to talk to. My relationship is falling apart and I recently got kicked out of therapy for no shows. Therapy didn’t help because it’s hard to take someone seriously when she only can’t relate to anything you’re going through . My Doctor was from India and I could barley understand fuck all he said anyway.  I digress, I wake up in pain every day. I have nightmares every night. I’m beginning to resent my girl because every time I try to talk to her she turns it into a competition. I tell her I feel like shit and she’ll say she feels like shit as well. She’s a bartender so she’s on her feet a lot. She doesn’t sleep next to me because I thrash around in my bed.  I had a dog and he helped me but he died from cancer and I’ve been pretty fucked up since then.  I don’t have family, I guess I have relatives but it’s one of those situations where if I don’t call I don’t hear from them. My heart feels hard and my girlfriend told me that I’m emotionless. Reality is that I turn them off because I don’t know how much more I can take. I only feel happy when I drink or smoke up. It’s like the only thing that turns off my brain. I have no motivation to do anything and my house is suffering because of it.  I’ve been on disability for the last 10 years roughly and I think it’s just making me woo, I’ve been trying to find a part time job to take my mind off myself but due to my physical issues and lack of any skills I am unable to or do not qualify for the position. I say MITA because I feel that way, I look at other people who wake up and do these things, these normal things that people do every day and they seem like tremendous feats to me. My girlfriend needs a car and she cries because we can’t afford it and I blame myself for that. I often think she’s better off without me. I’m on a cocktail of medicine “12 pills” in the morning and a few at night but they don’t help. I’m so detached and disinterested that I have like 20 texts I haven’t read from people. Idk , sorry if this is the wrong place for it. Im new to Reddit and you can remove it if you want. I guess I just needed to vent "
    },
    {
        "name": "t3_antabh",
        "created": 1549503907.0,
        "ups": 1,
        "downs": 0,
        "title": "My entire family is going away on vacation and it’s making me sad and anxious again",
        "selftext": "My parents and two little brothers (ages 16, 12) are both going with Greece without me in April. Usually this would not bother me because they have gone on vacations in the last two years (costa rica, Portugal) without me because I’m still in college and I don’t have breaks. It is the same case this year too, however what’s making me upset is that my mother and father know that I’ve been wanting to go to Greece since I was a child and yet they decide to go in April with my sniblings since I’ll be in school. My mother claims that’s its “the best season” to go in April and that she and my dad aren’t getting any younger so they should go. I get that parr but what I don’t get is why they can’t wait a few months and take me. They have no problem taking me to India in August but they’re bitching about me wanting to go. My mother has said to me “you don’t deserve to go and you haven’t earned it yet” but I have worked my ass off to get into medical school and I have an extremely high gpa. It bothers me that when I ask them about it, all they do is yell at me and tell me I can’t control their life. I know this post is kind of a 1st world problem and I don’t want it to come off as that but I’m real upset about this and it’s just ruining my week."
    },
    {
        "name": "t3_9uwee0",
        "created": 1541595589.0,
        "ups": 3,
        "downs": 0,
        "title": "May the Darkness be Conquered By the Light",
        "selftext": "Today is Diwali - the Festivals of Lights in India. &amp;#x200B;It's the day Lord Rama returned to his home, after a 14 year long exile to the forest and defeating the evil Raavana. When he returned, the entire city was lit with lamps making the city shine and showing Lord Rama their love for him. &amp;#x200B;The way Lord Rama defeated evil, I hope we defeat the evil (anxiety) in us. I hope with all the light that the world lights, we can throw the panic attacks off our mind. I hope with all the prayers for us we can make sure we have hope. There is light and there is hope. &amp;#x200B;"
    },
    {
        "name": "t3_ahkfe1",
        "created": 1547916163.0,
        "ups": 1,
        "downs": 0,
        "title": "have to stay productive.",
        "selftext": "So about one year ago i had a my first full on panic attack and i felt ill for about 2 weeks after. it was the most terrifying experience i have ever had. I had one again when i was in india and i had a very bad foodpoisoning. This one was a lot less terrifying and i didn't feel that bad the weeks after. Now yesterday i had something that felt like an anxiety attack it was not as bad as before but still really uncomfortable, i have had a crazy semester where I was really pushing my body to the limit because of deadlines and now i'm in the middle of exams. Today i decided to sleep in a little and give my body some rest. i feel better but i'm still tired, my vision is still a little fuzzy, my body is still kind of sore and my eyes feel kind of dry . i have noticed some small things the days before it started so i will be more able to anticipate them in the future. I really want to get back to normal as fast as possible because i have got a lot of work ahead of me.  I'm just curious how long do the aftereffects last for you guys and is there anyway to keep these to a minimum?"
    },
    {
        "name": "t3_60h343",
        "created": 1490051882.0,
        "ups": 7,
        "downs": 0,
        "title": "I think i have failed completely.",
        "selftext": "Hi i am 25 year old kid. I live in a 3rd world country..(India) by my age everyone has graduated and already having a job at least everyone around me everyone did well in their education and graduation and they have a job.But as for me i believe my parents when divorced at 12 basically my growth stopped i still feel like 12 in school i couldn't do anything i was bad at every i passed the school with a D Grade basically i failed to graduate and the worst thing is i don't know a thing about the shit i am studying i don't know anything about it i have to start over but ppl just say complete it.Talking to people scares me making up a conversation on my own is impossible for me to do.I have mental health issues i admit it have i been going to 6 psychaitrists but they all treated me like i had a physical disorder here take these 6 medicines which make you stop thinking. I couldn't handle it eventually my mom stopped it.My mother is religious she believes astrologers and such can save me but the fucking thing is the damn astrologers said when they looked at my hand nothing will happen of him and nothing will work best way to deal with him is throw him out of the house and pretend u never had this son and go on with your life and that is the best solution i agree completely.I tried to commit suicide to get better mental health treatment but it failed. The biggest problem is me i literally don't want anything at all i don't have any plans at all for anything i literally spend my day doing nothing i browse the net if i get really bored.My mom also believes depression is just a farce other people have been through worse and survived he reminds me of it all the time but my mother works all day in a job customer care where people swear at her... she had stage 2 cancer and she survived also her heart works at 85% capacity all these suffering should have been enough for her to kick back into life. Infact instead of changing my way i developed a new bullshit feeling that my loved ones will die and i will be homeless and eventually kill myself this thought comes to me all the time randomly. My father lives a new life he didnt even talk to me when i killed myself sometime later i talked with him and he was like why did u do that and then never talked to me again i can't hate him either he has had multiple heart surgeries,diabetes and now it looks like he will have alzheimers too.When i made this account the first thing i did was delete the reddit mail u get cuz it upset me idk why? sometimes when crossing the road i think of how should i write my suicide help thingy.. i have show these things to the psychaitrist but it felt like they didn't give a shit. I for some reason was also upset my post would get deleted it made me upset why tho? who gives a fuck eh. Its been like 4 years since i went to a psych my mom clearly hates it and i can't overwork her.But the biggest problem is the desire for change from with doesn't exist nowdays i think only of suicide and it feels so soothing anyway i mean the world is a cold hard place that doesnt give a shit about and will swallow you whole in a instant unless you are willing to break your back with overwork you don't have a right to complain i feel i am so obese and so inactive and dusting off a bit of shelf is enough to  cause massive pain in the whole body i don't think i can come out of this stuff.I know what the answers will be too go to a psychaitrist, set small goals and complete them at a time, just go graduate it ain't that hard i know this will be the answers but they dont fuckin work for me and since these dont isnt it better to kill myself whats the fuck is the point of writing this no one cares especially me.. and why should anyone expect me its their life i fucked up too much i have too low marks i have no skills i am way too obese i feel like its to late i had to calculate my age and i hated doing it cuz it reminded me off my failure i was in the 5 year of my college i think i never went to college heck i even skipped some exams but i was still in 5th year such bs.To come out of all this i will have to rend and tear and claw and fight everyday i don't wanna do that i would rather die."
    },
    {
        "name": "t3_3og1gx",
        "created": 1444682374.0,
        "ups": 39,
        "downs": 0,
        "title": "Need to talk to someone? List of hotlines via phone/text/and online",
        "selftext": "I've noticed a small influx of posts with people wanting help or in 'crisis' and under the misconception that there are no or little options. First please remember that crisis does not just mean suicide - if you're having a hard time with your anxiety, depression, personal issues, self harm, family issues, you name it - if it's pulling at your chest and you're in emotional pain that is cause enough call/text reach out. Your issues are not minimal they are YOUR issues and trust me when I say the person on the other end wants to help and is there for you. I have multiple versions of this list but this one is broken into region, and I'm not even finished with it I have but here it goes (I hope this copies over ok)###Suicide/Crisis Hotlines Phone/Web##US**[Contra Costa Crisis Center](http://www.crisis-center.org) | Crisis &amp; Suicide: 800-833-2900 | [Live Chat](http://suicidepreventionlifeline.org/GetHelp/LifelineChat.aspx)**\t  **[Common Ground](http://commongroundhelps.org/) | Call: 800 231 1127 | [Web Chat](http://commongroundhelps.org/?p=3046)**   Mental health services for youth offering phone &amp; web crisis lines - help with suicide, bullying, depression, anxiety, and other issues. Hours: M-F 4pm-10pm EST\t **[Lifeline Crisis Chat](http://www.crisischat.org) | [Online Crisis Chat](http://www.crisischat.org/chat)**   Hours: 2pm to 2am EST 7 days a week\t [Suicide Prevention &amp; Crisis Line](http://www.suicidepreventionandcrisisservice.org/) | Call: 800 273 TALK | [Online Option](http://www.suicidepreventionandcrisisservice.org/spv_online.html)**\tHours: M-F 6pm to 9pm EST\t **[Iowa Crisis Support](http://iowacrisischat.org/) | 24/7 Crisis Line: 319 351 0140 OR 855 325 4296 | [Crisis Chat](http://iowacrisischat.org/pages/crisis-chat.php) | [Youth Crisis Chat](http://iowacrisischat.org/pages/youth-chat.php)**\tChat services in both English and Mandarin. Crisis chat hours: English: 2pm - 2am EST Everyday | Mandarin: M-F 8pm to 10pm EST\t  ###Australia**[SuicideLine](http://www.ontheline.org.au/services/suicideline) |  1300 651 251**    **[Suicide Call-Back Service](https://www.suicidecallbackservice.org.au/) | 1300 659 467**    **[Lifeline](https://www.lifeline.org.au/): 24/7 Hotline: 13 11 14 | [Live Crisis Chat](https://www.lifeline.org.au/Get-Help/Online-Services/crisis-chat)**    **[Kid’s Help](http://www.kidshelp.com.au/) | Call: 1800 55 1800**###Canada**[Crisis Support Centre](http://www.crisissupportcentre.com/) |  24/7 Distress Line 780-482-HELP (4357) | Rural Distress Line: 1-800-232-7288 | [Live Crisis Chat](http://www.crisissupportcentre.com/get_support_now/online-crisis-chat/)**     **[Distress Centre](http://www.distresscentre.com/) | 24/7 Hotline: (403)266-HELP | [IM Chat](http://www.distresscentre.com/) for adults | [Connecteen](http://calgaryconnecteen.com/) for teens**     **[Kid's Help Phone](http://www.kidshelpphone.ca/teens/home/splash.aspx) | 1-800-668-6868 (English Version)**\tA Canadian site for youth up to age 20, offering crisis counselling via phone hotline, or [IM Chat](http://www.kidshelpphone.ca/Teens/AskUsOnline/Chat-counselling.aspx)\t **[Jeunessee J'ecoute](http://jeunessejecoute.ca/teens/home/splash.aspx) | 1-800-668-6868 | Youth Crisis Line (French-Canadian Version)**     **[Manitoba Support Services](http://supportline.ca/) | Toll-Free Stress Line: 1-866-367-3276 | [Online Chat](http://supportline.ca/page-chat-with-us.php)**\tTelephone &amp; Online counseling for Farmers, Rural and Northern Manitobians.\t **[Tel-Jeunes](http://teljeunes.com/accueil) | Tel: 1-800-263-2266 | Text: 514-600-1002**    French-Canadian phone hotline, text hotline, and online chat as well as forums for youth (18 and under)  ###United Kingdom **[The CALM Zone](https://www.thecalmzone.net/) | Nationwide: 0800 58 58 58 | London: 0808 802 58 58 | [Web Chat](https://www.thecalmzone.net/help/get-help/)**\tLondon based crisis site for men in the UK - crisis support is 5pm-midnight 265 days a year.\t **[Childline](http://www.childline.org.uk/Pages/Home.aspx) | Call: 0800 1111 | [Online Chat](http://www.childline.org.uk/Talk/Chat/Pages/OnlineChat.aspx)**\tA 24/7 helpline for children and youth who live in the UK. Includes a phone hotline, message boards, email, and web chat services. Also features an \"Explore\" area with mental health info, and a \"Play\" section with games.\t **[Get Connected](http://www.getconnected.org.uk/) | Phone: 0808 808 4994 | [Web Chat](https://livechat.boldchat.com/aid/5221617268700189003/bc.chat?resize=true&amp;cwdid=4432228264796175422&amp;wdid=1458736833879540022&amp;rdid=2781633931835204878)**\tUK based crisis services offering phone, email, text, and live chat for 25 years and younger.\t  **[Leeds Nightline](http://www.leedsnightline.co.uk/) | Listening Service: 0113 380 1281 | Information Service: 0113 380 1380 [Web Chat](http://www.leedsnightline.co.uk/e-nightline.html)**\tA peer support service run by and for Leeds students, during term time in the UK. Offers a phone hotline and IM chat. Hours: 8pm to midnight GMT *currently closed for summer to open back in a month or so*\t **[Leeds Survivor Led Crisis Services](http://www.lslcs.org.uk/) | Helpline: 0808 800 1212 | [Chat Line](https://support.lslcs.org.uk/webim/client.php?locale=en)**\tCrisis respite home &amp; help line with live chat available. Hours: IM available 6pm - 1:30pm BST\t **[Strathclyde &amp; Caledonia Nightline](http://scnightline.com/) | Phone: 0141 55 22 555 | [Chat Service](http://scnightline.com/node/3)**   Confidential phone &amp; online hotline/info service run by trained students of the Glasgow Caedonian &amp; Strathclyde Universities. Hours: 7pm-7am M-F GMT\t   ###International **Mexico**\t[SAPTEL](http://www.saptel.org.mx/) | 800 472 7835\t **[Brazil](http://suicideprevention.wikia.com/wiki/Brasil)** - more than I would have thought\t   **China**   [Life Line Shanghai](http://www.lifeline-shanghai.com/) | Call: (021) 6279-8990\tProvides free confidential &amp; anonymous information and emotional support via phone 10am to 10pm daily\t [Beijing Suicide Research &amp; Prevention Centre](http://www.crisis.org.cn/) | 24/7 Crisis Line: 800-810-1117 Phone/IP/User Extension: 010-8295-1332\t [Hong Kong Suicide Prevention Services](http://www.sps.org.hk/) | Call: 2382 0000\tIn Chinese, website offers suicide prevention &amp; crisis helpline\t  **India**\t[Maithri](http://www.maithrikochi.org/) | + 0484 2540530\tOperates in Kochi in the state of Kerala, south-west India offering crisis support via phone, letter, and face to face contact.\t [Save India Family Foundation](http://saveindianfamily.org/index.php) | +91 9243473794 \tCrisis support for Bangalore - browse to discover helplines throughout India\t [Lifeline Foundation](http://www.lifelinekolkata.org/) | Helpline: 24637401 / 7432\tLifeline India has email &amp; phone support for people around Kolkata.\tOr feel free to look at the larger list [here](https://www.iasp.info/resources/Crisis_Centres/)I know I left out a number of them, and have more detailed for the US as far as state by state somewhere but the point is - the resources are out there if you're feeling like you need to talk to someone please try one of these out.(((super duper hugs to everyone)))"
    },
    {
        "name": "t3_1eq301",
        "created": 1369117844.0,
        "ups": 30,
        "downs": 0,
        "title": "I've been planning on visiting China for the past 3 years and now that I'm here, I've almost had 3 panic attacks in the past two days. WTF!?",
        "selftext": "I've had my anxiety under control for the past year (thanks to acupuncture, therapy cat, and you guys) until a few days ago. We had just returned from a day trip to Shanghai and waiting for taxi in a very crowded and poorly oxygenated hallway. I felt the world around me do a 360' and I realized that I had to get out of that crowd IMMEDIATELY. I felt much better on the walk home. I thought it was a fluke.The next morning, my heart starts pounding that familiar (and awful) beat even though the room wasn't crowded. In the afternoon it started again in a large room filled with only 10 people :(I don't think I'll be able to handle Beijing, even though it's my life dream to visit the Great Wall.I am so upset with myself. I was aware that it would be uncomfortable to be away from my family in a crowded country where I don't know the language but I never even considered panic attacks on my dream vacation. sigh.....Edit: I was tearing up as I was reading the responses, thank you so very much for being so encouraging.  "
    },
    {
        "name": "t3_5qvyfj",
        "created": 1485751009.0,
        "ups": 2,
        "downs": 0,
        "title": "Sleep and Anxiety issues",
        "selftext": "I first remember getting bad anxiety (and almost an anxiety attack) when I was told that mom and dad put an ad out for me in India about marriage. That prevented me from sleeping at night, aside from all also getting paranoid by sounds. It went on for an entire month. I would be up literally all night until 5:30ish in the mornings. The second time I remember getting bad anxiety and not sleeping well for couple of weeks was when I felt depressed working for the state in WV, because I was being treated unfairly by my coworkers. It was bad during the last stretch of job interviews, since I was ready to quit and leave! The anxiety went away after I moved and started my job.The third time I remember getting bad anxiety was when my bird, Gizmo died, although I think I was more sad. I have never been able to get over her death. I feel that she thinks I left her at the vet and didn't visit her during visitor hours, but I was trying to think logically (packing and getting ready to come down to va, instead of driving 17 miles back and forth to the vet in case if they made me come pick up Gizmo right after visiting her). Me not visiting her is, has prevented me from getting closure. I felt the closure with my grandpa, because I was able to see and help him. I didn't feel the anxiety due to her, but I felt subconsciously it was due to that. The anxiety got worse when I was ready to leave my then job, because again, my boss was being very unfair to me. I couldn't sleep well. The anxiety went away when I got my current job and started to sleep well again. However, a couple of weeks into the job, I didn't sleep well for a night or so and then it started a pattern of not sleeping well and having to rely on melatonin. This has been going on and off for the past 3-4 months.The past few weeks have been stressful with my grandpa and knowing that we were going to receive the call, just weren't sure when. Every morning and night the stress would come back, because of reading updates about him on the group chat. It made me worry and to expect the worse about him. When I went to India, I didn't sleep properly there or on the plane. I came back and took melatonin for 2 days to prevent staying up at night due to jet lag. After he passed away on Sat, I slept for awhile that night; probably from all the tiredness. I didn't sleep too well on Mon or Tues and that could be due to the jet lag. Then when I heard about my grandma not being well, I started to stress about her big time. Every time I hit the bed, my head felt so heavy with the tension headaches. I would lay in bed for a few hours before falling asleep. I think I slept for 4-5 hours on Tues night and Wed night. I even took 2 melatonin on wed and the stress completely wiped out its effects. On Thurs, I took nyquil and that still took me 2-2.5 hours to fall asleep and I had to sit up so my mind wouldn't stress about falling asleep. I even listened to my meditation app.I'm not sure why my anxiety with sleep has gotten worse. I don't want to rely on pills, or even melatonin. I had even changed my workout schedule to the evenings/night so I could feel tired before bed and that seemed to help for a while until after coming back from India. I'm thinking I may need cognitive behavioral therapy.I think losing Gizmo had a profound effect on me. She was everything to me and I lost her in a blink of an eye. We recently lost my grandpa and even though it was his time (he was 90 years old), it's still sad. Now, I'm worried we will lose my grandma from a broken heart. Losing my grandma, will probably feel like losing Gizmo for me. Her and I are so close and I consider her to be my best friend. I don't blame her for wanting to not live, especially since this just happened 2 weeks ago, and she is getting old. To top it off, this kid that lives above me with her parents runs in her apt, causing us to hear the vibrations and feel disrupted--it also increases the anxiety and stress for my boyfriend and I. We've complained each time she has done that, and it has gotten a bit better, but we will see if she starts running before 8:30 am tomorrow, because since NYE, this kid has been waking us up on the weekends and we aren't even sleeping in that late.Overall, I'm fine on the weekends, but the anxiety is worse the weekdays, although I'm sure right now with the events that just took place I'm not sleeping to well in general. I put stress on myself for getting a good night sleep, because it makes me feel good--it's the same reason why I work out. When I lose a good night's sleep even for a night, it starts a cycle of not sleeping properly. I hate this and want to be in control of my thoughts, since I think my issues are purely psychological. Any advice will be appreciated! Please don't post anything negative here either, if you have nothing nice to say.Thanks for helping out!"
    },
    {
        "name": "t3_60jptf",
        "created": 1490077415.0,
        "ups": 3,
        "downs": 0,
        "title": "Returned home after being out of the country and keep having anxiety/panic attacks or something",
        "selftext": "I hate the way the title automatically capitalizes every first word.. anyway.I just got home and back to college after being out of the country in India for a week and a half or so and ever since getting back everything has been shit. I struggled last semester with anxiety and panic attacks really bad and over Christmas break everything went away and I got back to normal me, but now I have symptoms like when I go to eat just about anything I feel nauseous, which is the main problem I've been having. But sometimes I'll be in class or in a meeting at work or something and feel trapped and then I get nauseous there too.Has anyone experienced anything like this? I like to meditate but it's hard for me to do it in my room because once I meditated on a cushion I could never go back to sitting uncomfortably and unfortunately I don't own any cushions like the ones we have where I do group meditation. It's really shitty and interfering with my personal life now, I don't know what to do, I just wanna be able to eat and stuff again. The weirdest part is I can eat shit like junk food and drink beer and all that, but if I go to eat something like a burger or some eggs I'll feel sick."
    },
    {
        "name": "t3_1rikf2",
        "created": 1385523157.0,
        "ups": 48,
        "downs": 0,
        "title": "I keep a note on my iPhone that has comforting phrases that I read whenever I start feeling anxious.",
        "selftext": "I don't know if this will help you, but it's been helping me. For example, I have a note in my iPhone called \"positivity\" and here's what's in it:&gt; You can still relax with your inbox being full.&gt; In fact, it'll never be empty. If you don't do it, somebody else will.&gt; Slow down. Take deep breaths.&gt; No point in living in the future. No fear in the now.&gt; Enjoy the little things. They're bigger than you think.&gt; In 100 years... All new people.&gt; At least you don't have to travel like some jobs do.&gt; Count your blessings.&gt; If a hardened, starving kid in India could know what you were feeling, what would he think? All of your luxuries, opportunities, and fortunes... compared to his reality. It's happening somewhere.&gt; Others have it worse than you. Be grateful for what you have.&gt; The gauntlet makes you stronger.&gt; It's not the load that brings you down... It's how you carry it.&gt; Put the ball in someone else's court.It's what I look at when I'm experience an anxiety episode induced either by work stress, or my hypochondria.It helps me regain my perspective. A lot of these are thought-terminating cliches, which are effective in helping, well, terminating thoughts. Including anxious ones.These are little phrases and sayings that mean something to me and have an impact on me, but maybe for you it's something else.I just kind of read through them and whichever ones apply, apply. It keeps me kind of calm. I continually add stuff to the list that I think will help me."
    },
    {
        "name": "t3_7xs4qe",
        "created": 1518746078.0,
        "ups": 2,
        "downs": 0,
        "title": "I need help",
        "selftext": "Hello Reddit, This is my first question I just had to make an account because I had a really shitty day.I'm a 21 year old and I feel I'm not going anywhere in life. I have been on the news I have won so many awards and scholarships and was the editor in Chief for my college magazine  and I help in running the financial taxation and now the executive functions of a small business.I didn't get the marks to get into the management university of my choice again. It's not like I have failed but I just didn't get good enough. I live in India where even if you get a 99.98 percentile you can't get into a good college. Not because of the exam of the exam but because most people here could not keep their fucking pants on. But regardless of my rant and all I feel like shit and until I don't get the scores I don't know if I will ever forgive myself. Sometimes I believe I'm being a leach. And I'm honestly scared if I don't get my MBA entrance exams stuff sorted out I will be overlooked in life. Sometimes I wish all these issues I have we're due to the fact that I fucked up so that I can understand them better and work on myself.I know I have done and achieved a lot and I have failed a lot but my anxiety attacks came back and I just can't think straight. People of reddit, am I being a fucking pussy and do I need to grow some balls, should I need to book more appointments with actual help or whatever please I need suggestions from anybody to understand what am I doing wrong ?"
    },
    {
        "name": "t3_71ok5r",
        "created": 1506081334.0,
        "ups": 3,
        "downs": 0,
        "title": "I have achieved so Much",
        "selftext": "Today when I look back I see that I have not been giving myself any credit at all for what I have achieved in last year and a half or so. I have been left by my wife as my marriage broke down almost homeless. Did not have a job cause was suffering from severe anxiety and seizures at least once or twice a week for nearly 12 years. Slowly then I moved into a shared accommodation. Got a casual job. Even then I was not giving my self credit for that cause I was getting calls daily from my mom and sister from India as I live in Australia. I was under the allusion that they are doing everything and I am doing nothing. Then as luck would have it doctors found the cure for my epilepsy last November and my seizures and anxiety started to reduce. But I was still mentally dependent on my family. I still was not realizing that nobody is with me I am doing it all alone. Its only me who rose from ashes. It was me who was living on government grant and then slowly started rising the ladder and then had a job. It was me who was doing it. Now Just a week or so ago it just came to my mind that wait a minute why is everyone calling me strong person?? Then I realized hey nobody was with you for last one and half year you were all alone. They were just on phone. you did it all by yourself. you suffered it all alone. Even this realization that I did it all by myself nobody told me I worked it on my own. Today I am feeling so good and so much confident.    "
    },
    {
        "name": "t3_7p7gns",
        "created": 1515537419.0,
        "ups": 1,
        "downs": 0,
        "title": "Strange feeling in head-anxiety and social media",
        "selftext": "For the past one-two month, I have been feeling some kind of tension building up in my forehead. It in really in the centre of the forehead, where the third eye is said to be located. I also am experiencing some kind of movement in my crown spot in my head. I have shown this to the best doctor in Delhi, India and he's saying that it is some kind of the start of migraine stage. I was really worried about this when I heard this and still whenever I hear this, I feel a little depressed. He suggested some heart medicine and I requested him to delay it. He relented on the condition that I should exercise everyday for an hour and sweat like anything. I really don't want to be on meds as before this I have got off one year of anxiety meds and therapy. I really don't exercise and feel even bad about that coupled with the strange pressure I feel in my brain/head. My social media usage on my phone is also very high~4-5 hours per day and I am also unable to control this. Is social media related to this? Please help, suggest something. Thanks"
    },
    {
        "name": "t3_5u7re6",
        "created": 1487198581.0,
        "ups": 2,
        "downs": 0,
        "title": "can i honestly change myself?",
        "selftext": "Hello i am from india i am 25 years old.Everyone around me by now has graduated college and almost they have a job. But i never went to college, barely got any marks in school. I can't graduate because i don't know anything about any subjects also it’s been 7 years since i ever studied anything so i almost know nothing.I spent my life  dreaming, sleeping, not doing anything at all, tv, computer games(playing the same ones 100 times). i never played any online games even if played them i never made any friends there, many online communities i only browse them never post on them because i am afraid i fear a backlash.I am afraid to go anywhere and talk to someone in real life i am afraid to interact with people i have gone all the way to places but i could never enter as something held me back(it was me).I also have a grandfather who i love very much but he is a non-sensitive person this is not a critisicm of him he isn't emotional he is a practical i frequently think of death even if he does a simple cough i get so upset i feel like killing myself that instant i scream to myself i don't wanna see his funeral nor be in it, i am actually soothed by the fact if i die before him i won't have to see any of that that is generally so soothing whenever i got anxious about him i would do stupid shit for example i cut off the skin of my feet so much of it that it hurts to walk. Yes I know what will my family think but I don’t care.My mother loves randomly telling me she won’t look after me won’t give me any money, my father doesn’t care if I am alive my uncle is even worse version of my mother and he hates my mom as well.I have to gone psychiatrists but it failed I been to many but they just prescribe you medicines and do nothing else they don’t care if you have side effects because of them. I even did a suicide as a cry for help but it didn’t do anything.  Nowadays I think about it a lot but if I tell it to my mom she will go into a abusive blackmailing phase she is basically telling me fuck off I already have enough problems. My dad didn’t come to the hospital when I killed myself so there’s that. Honestly I am not blaming anyone I know I am to blame I didn’t study when everyone studied I didn’t do any physical excersices or workout when other people did I honestly know I will kill myself but I its just when I know I can’t change myself I have tried and failed and with so many damn distractions its feels impossible. Everyone in my family has their own problems they are not to blame and I know only I can change myself but I don’t think I can I have lived my whole life with someone holding my hands. I have to do too many things I don’t think I canIf I post this in suicide watch they will tell me don’t kill yourself If I post it in depression they will till the same and probably go to a psychiatrist if I post this in a improvement sub they will tell me same and stuff like only I can change myself and the world doesn’t give a shit about anything so either do it or don’t whats the point of all this I can’t go to the psychiatrist because I don’t have any cash on my own and my parents don’t wanna take and nor do any relatives or neighbours. I am really repulsive and repulsed by myself its not a image issue I think I am too behind and I really will have to break all my bones to catch up but I don’t think I can."
    },
    {
        "name": "t3_1yudzg",
        "created": 1393316527.0,
        "ups": 9,
        "downs": 0,
        "title": "Herbal remedy helping me with anxiety",
        "selftext": "So I pretty much went through the pharmaceutical marketplace. Tried xanax, buspirone, wellbutrin, prozac. Wasn't happy with any of them. I weaned myself off, then went without for a while -- just doing meditation and exercise.Recently I've discovered Tulsi Tea which, in low doses, seems to help combat my anxiety. I take 1/2 the recommended serving (2 times a day, down from three, and I cut the serving size a bit), and it works great as a supplement.Here's the stuff I buy:http://www.amazon.com/Organic-India-Tulsi-Original-18-Count/dp/B00134XL58/ref=sr_1_2?ie=UTF8&amp;qid=1393287702&amp;sr=8-2&amp;keywords=tulsi+teaHope it works for someone else."
    },
    {
        "name": "t3_4atq6j",
        "created": 1458258882.0,
        "ups": 8,
        "downs": 0,
        "title": "Heatbreak And My Help",
        "selftext": "After another destoyed relationship and I sit here sweating and not eating. Months of pain I know I have coming...   For anyone going through this i find music really is a great help.  I find it like alcohol,  it allows you to come to turns with the problem.  You can find a song that gives you a connection and your not the only one.  Theres a band in Auatralia called British India,  they have a song called i can make you love me. There is a lyric in there that goes \"you know what they say you cant help but love the dead\".  Its just nice to know there are other people out there going through the same trauma.  Maybe not nice but comforting.  Another one is Bon Iver's Skinny Love,  \"Il be holding all the tickets but you will be taking all the fines\" ... "
    },
    {
        "name": "t3_1d9rio",
        "created": 1367185167.0,
        "ups": 11,
        "downs": 0,
        "title": "Finally, some relief after a long hospital visit.",
        "selftext": "I've been experiencing what I thought was heart arrhythmia, sleep apnea, or anxiety/stress related chest issues for the past four months. I have never experienced these symptoms before in my life and suddenly they started happening so I immediately assumed it was a heart issue. I'm a self-diagnosed hypochondriac and also pretty sure I've had an anxiety problem most of my life but until recently it hasn't been keeping me from living a normal life.I went to the hospital on Saturday for most of the day and got almost every heart and breathing test done under the sun and the final result was...everything is normal! Everything is perfectly normal and the cardiologist told me it was due to stress that I was experiencing these palpitations and having a lot of trouble sleeping. Hearing the words, \"everything is completely normal\" was the best thing in the world. I didn't care I had to spend around $80 to get all these tests (I live in India which is why it was 'cheap' and also a reason I put it off for so long and opens another can of anxiety I won't go into). Knowing that my heart is normal and okay was a huge relief. I'm sure some of you can relate.My next step is to find a good counselor or psychiatrist/psychologist, heck, I'm not even sure the difference between the two! Another thing I am worried that India does not have much of or good ones at that.I just wanted to share the good news of finding out everything is okay with my heart and my breathing. I think knowing this in and of itself will help me a lot in controlling the anxiety when it strikes. I love this subreddit and have been a lurker for a few weeks now, but have gleaned a lot of good tips and stories from all of you."
    },
    {
        "name": "t3_4bhp5g",
        "created": 1458687015.0,
        "ups": 2,
        "downs": 0,
        "title": "I did it.",
        "selftext": "I really hate talking to strangers or going to new places.  (New places like: first time visiting college, work, etc.   Not like: Going to india or something)    I'm currently studying and making no money at all. I feel bad for it, because I wanna help my family, but every little thing is stressing me out.  Thankfully, my dad helped me a little, so I went to an small job with my dad, carrying boxes out of an container. Nothing special.    I don't have to do it and it's more random when I have to. (I really hate it, when I suddenly have to work tomorrow)    That's why I didn't go last time when he asked.    But today I went there... and the truck with the container didn't come. :|  Wasted 2 hours by waiting and driving, but at least we got 1 hour payment for being there.  It's still exhausting as fuck. I still hate it. I wish I could do some small work from home.   But I don't want to be a burden to my family.      And yeah, the title isn't the best. I know."
    },
    {
        "name": "t3_21c1f6",
        "created": 1395794916.0,
        "ups": 7,
        "downs": 0,
        "title": "Any college students that used their university’s disability services for their anxiety?",
        "selftext": "I am a senior in college and have had anxiety since my sophomore year. I only recently found out that the university offers disability services to people with psychological disorders like notifying professors, organizational skills, and finding long-term counseling, as well as other accommodations. I was leery at first because I didn’t want to be labeled as having a disability and I figured I had made it through almost two years without those accommodations, but now I wish I had because my work is suffering and all of my teachers probably think I am a slacker. I am worried that I will have to make a choice between them thinking I am a slacker or I am weak, and honestly given the choice I would rather they thought I was a slacker. Best-case scenario would be that they accept that I have a problem and try to help me, but I am not hopeful of this. I am planning to get a Master’s degree from a really good university in the fall and I want to register for disability, knowing what I now know, but I am still not 100% sure. As of now, I have emailed a counselor for help and looked up the documentation necessary for an application. I would need a diagnostic report including:* A specific diagnosis stating that I do have anxiety* A description of current functional limitations* Information regarding medication (none)* Information regarding current treatment (will probably be only cognitive behavioral therapy)Have any of you used your university’s disability accommodations and did they help you?EDIT: One other thing, the university wants a reason why no accommodations were provided in the past. Do \"ignorance of the resources available\" and \"I'm kind of a stubborn bitch\" count?UPDATE: I brought up looking into counseling options in my new college with my parents last night (nothing about applying for disability yet, or probably ever) and my mom went really quiet as my dad just blew up. He thinks that if I know that grad school is going to cause me stress and anxiety, then I just shouldn’t do it and sit at home, where there is no stress whatsoever (that was sarcasm). His exact words were “don’t taste poison just because you have an antidote” (it’s apparently a saying in India); I think that meant I shouldn’t do things that I know will stress me out, like grad school, just because I have the option of counseling or dropping out. His reasoning is backwards…I looked into counseling because I want to be able to do research and do my best work, and live away from home at my new college without having to worry about my anxiety causing my work to suffer. This way I’ll have help and a support system, and it’ll actually be a much better system than the one I have at home, where I can’t talk to anyone about it. (Except, you know, millions of people on the internet.)They know the absolute bare minimum about my anxiety and depression, namely that I had it for some period of time two years ago, and the only reason they know that is because I failed two courses my sophomore year and back then they told me to get therapy. You know, because my grades were down. Apparently, as long as I am functional and able to do my work without breaking down my mental health doesn’t matter.I think that this has convinced me that I do need to get a therapist. And to get a support system for myself outside of my head and avoidance techniques. I have a hard time talking about issues and getting personal with my friends, and with therapists, but maybe that needs to change if I can’t talk to my friends or family about my problems. The person I emailed hasn’t emailed me back yet but I am going to her office today to make an appointment."
    },
    {
        "name": "t3_1m0uw5",
        "created": 1378745668.0,
        "ups": 6,
        "downs": 0,
        "title": "[Rant] I just need to write this out (x-post from r/self)",
        "selftext": "I don't know where to write this. I don't think anyone I know would actually understand this. So, here you go, reddit. I am a 28 year old Indian woman living in the US. I have been here about 4 years now.I have a weird kind of anxiety, I am just very worried about what some people think of me and how they'd judge me. Most of these people I worry about are people from my college during my undergrad. days. I was somewhat different from people in my class, had my own strange (old-fashioned) ideologies and perhaps appeared too stuck up. I also lacked any sense of fashion/style. And I often thought of myself as superior because I was different. But the fact that I never was among the \"cool\" crowd got to me quite bad.To top this, I got into a relationship with a guy who was 10 years older than I was and even got intimate. (this was a pretty big deal in India in my city, people who got to know about it were very scandalized) That relationship was all sorts of weird, once again. While it offered me some respite in terms of improving my self worth (wow, at least one guy likes me/finds me attractive!) , I was constantly feeling inadequate. I was not even twenty, very inexperienced about everything in life and had a terrible need for validation, while the guy was well traveled, could articulate things well and looked like he had figured his shit out. As I grew older (about 22-23), I realized how that guy was not really as mature as I thought he was and the relationship was actually stifling.Anyway, this whole 'uncool girl mixed up in scandalous behavior' was something that I couldn't handle at all, in college. Not that anyone asked me anything about it, I barely had friends, but still, I had this nagging feeling that people would gossip about me and laughed at me.I have actively avoided getting in touch with many of my classmates (they're all on my fb though) Now, I have moved on, I have changed in many different ways - I dress better, my ideas have taken a huge turn, I am liberal/progressive than ever before and am finally with a guy who is \"normal\".But then, even now, if I have to post anything on FB, just any thing, I get this picture of all of those people sitting in silent judgment of me and mocking at me. This makes me very anxious. I honestly, logically don't give a flying fuck about any of them. I don't care about their existence. But they still bother me because of this imagined superiority that I attribute to them.I am not sure what to do. I reorganized my friends' list to put them in a restricted list. I could remove them from my list, but that just sounds ridiculous and illogical.If you read this, I can't thank you enough! Thank you very much. I hope I can lend you a listening ear when you need it. I also appreciate any comments that you can give. Just a \"hi\" after you read this would make me very happy too! Thanks again."
    },
    {
        "name": "t3_5hiq0n",
        "created": 1481377643.0,
        "ups": 2,
        "downs": 0,
        "title": "First post..my story",
        "selftext": "I'm the son of a decently priveledged Indian Family.  I'm a decent looking  guy. People who just met me think I'm getting girls all the time because I can sometimes fake confidence with alcohol. I'm 22 now and I'm at the point where I have anxiety when I talk to girls. My anxiety and lack of congruence and shyness has actually deferred girls away from me. I had interviews to my dream jobs and my anxiety didn't let me be myself in the final round of these interviews. I was maintaining a 3.2 GPA, but this last semester my anxiety led me to cloudy judgement. I cheated on assignments and got caught. Ultimately I will have a cumilative of an under 3.0 GPA and could potentially get suspended or expelled. The ironic part is that the class was a 100 level class. I just have so much anxiety these days that I can barely be by myself without having a panic attack let alone do assignments. I basically feel like I just ruined my life this last semester because I couldn't control my anxiety.  That in effect has made me tremendously depressed. I've been struggling chronic back pain for the past 5 years. I've been going to Panama to deal with it by doing eccentric stretching and I'm not sure if it's working. I honestly believe that my anxiety is only making my body more tense and stressed. I have to thank God because I have parents and a sister who is incredibly supportive of me. Without them, I don't know if I would be alive. It does suck because my closest friends in highschool and college have been looking at me like I'm alien because I've been so weird around them. It's just been the biggest six months of my life that has ultimately been the worst 6 months of my life because I'm self sabotaging myself. It's frustrating because I feel like I have the power to turn this situation around and it's definetly not too late for me.But my anxiety is so crippling right now but I still can't justify that in my head for all my blunders this semester. Just decided to vent. Thanks for anyone who listened. I truly am not seeking pity from anyone. I know what's going on in Syria. I've seen the slums in India first hand. I've seen what real problems look like, and I truly want to help people in general. It's just frustrating because I'm struggling to be a regular person myself"
    },
    {
        "name": "t3_2cqc55",
        "created": 1407305989.0,
        "ups": 4,
        "downs": 0,
        "title": "sometimes it comes back [Rant]",
        "selftext": "Okay, so first I want to give a little background on my life with anxiety. I am a 22 year old woman now, and my anxiety started when I was about 14/15. I was in high school and was in incredibly rigorous college courses, as well as being involved in many extra curricular activities. Anxiety and depression run in my family and I had already dealt with depression for years. My first full-on panic attack was at my synchronized swimming pageant, where I collapsed prior to a routine that was particularly difficult (holding your breathe for extended of periods of times is very intimidating when you already are hyperventilating). Anyway after this incident, I was put on zoloft and xanax. This began a five year battle with what I consider addiction. I also developed an addiction to narcotic pain pills, which i think was mainly due to that 'invincible' feeling that opiates give you. I went on a school trip to India in the summer or 2009, and because of all the drugs I was on, I didn't have any anxiety at all, I had the time of my life. When I got back however, my addiction worsened even further (a lot of this was due to my mom becoming disabled and becoming an opiate addict and just not the mother I'd had before). Anyway, this ended up changing the entire path I had planned for myself after high school. I graduated with incredible academic achievements, the absolute top of my class, a dream student, but in reality I missed something like a hundred days of school my senior year due to anxiety, and was taking something like 16 xanax a day, 2 temazapan at night, as well as something like 60 mg of oxycodone a day, on top of zoloft, buspar, etc.. (this is a very conservative estimate to be honest, I was a total mess). I ended up losing over 40 pounds and spent most days in bed, but most people didn't realize anything was even wrong, and told me how good I looked because I was so thin.I had plans to go to college, and was being courted by the most elite universities in the United States, but obviously I was in no condition to go live on my own and keep up in such a challenging academic environment. My doctors didn't know what to do so they just kept giving me more meds. I hated myself, I hated my life, my friends were at school living the life I had dreamed of, and I was sleeping and crying and drugging my life away. I couldn't stand it anymore and wanted to move forward, so I enrolled at a very very good college that was also close to home, hoping I could do this. Well, the constant cycle of doping to do school, running out of medications early, suffering withdrawals, missing class due to withdrawal, and then the anxiety of making up so much work got to me a little over half way through the semester. I just broke. I stayed in bed for a week in my dorm room, not eating, not talking to anyone, not showering- it was the darkest week of my life. Eventually I told my boyfriend, he helped me move my stuff out and tell my parents what had been going on ( i had been lying to them and pretending I was going to class like everything was normal). When I got home I was even worse with my addiction because I was so ashamed and felt so weak and worthless. It was terrible. For about a year I did nothing with my days, though I did step up my counseling a TON, and was seeing many different types of anxiety specialists, as well as a spiritual healer who helped the most. I finally decided in Fall 2012, with the help of my family (my sister especially, she has GAD as well), that the drugs I'd been on for years were the reason I had ruined my life the past few years. I decided to wean a bit off the opiates and barbiturates and then went cold turkey. It was, by far, the hardest thing I've ever done. I wouldn't wish opiate and barbiturate withdrawals on my worse enemies. (Marijuana helped SO much though.) I had been doing A LOT of these drugs, so the withdrawal lasted several months. But i knew I had to do this to get my life back. By March 2013 I was the happiest I had been in a long time. I felt so alive and so calm, and invincible because I had survived the withdrawal. I turned 21 in April and I got my social life back, made new friends, got a new part time job, I was thriving. I have been thriving (and totally pill free!).Then, all of the sudden, a few months ago, I started getting severe panic attacks again. It started driving 2 hours on interstates to visit my grandmother. I've never liked driving, but in the past I was on so much xanax, I hardly ever had panic attacks while doing so. This was terrible, I was shaking and sweating for two hours straight and I really don't know how I survived it. Worse yet, when I got there, I knew I had no option but to drive myself back. I don't know how I did that either, but it helped knowing every minute I was getting closer to home. Since then, my driving anxiety has snowballed. At first I just avoided interstates, then just faster roads, and now I freak out just driving to work. It's just the fear of having a severe panic attack while driving, I am not afraid of crashing or dying, I am just afraid that I can't do this. I remind myself I am doing it, but I just hate it. This rebound of anxiety has now ballooned that I doubt my abilities to do anything without suffering panic attacks. I even have had attacks at work (and my work is the chillest place in the world) and at the grocery store. I have a trip planned to take the Amtrak to visit my sister in a month and a half and I'm terrified I won't be able to do it. I'm terrified I'll have a panic attack on the train. I'm even more afraid of the 6 hour layover in Union Station in Chicago. What will I do if I freak out?? I'll be stuck in Chicago, far from home, completely alone, with no one to comfort me or to make sure I get on the train. It's all I can think about, even though I know that's the worst thing I can do.To try to help myself, I scheduled an appt with a doctor who does biofeedback, as well as an appt with a doctor to prescribe me a small amount of xanax for the trip (which I had promised myself I would never take again, but what else can I do?). I have been doing yoga everyday, which makes me feel calm for the time being, but I'm still so scared.Sorry I really just needed to get this off my chest. I've been feeling positively insane lately. If anyone has any advice, or words of comfort, they'd' be greatly appreciated. I know I have it a lot better than I used to, I have a job, a social life, etc. and am working towards going back to school, etc. but I'm so afraid my anxiety is just going to take away everything I've worked towards.TL;DR-I've struggled with anxiety for 7+ years, and had dependence problems for the first 5 of them. I stopped all medications almost two years ago, but recently my anxiety has reasserted itself into my life. I  am worried about my ability to cope with this and am afraid I will lose everything I have gained the past two years. I need comfort and advice that (my favorite anxiety quotes) \"everything will be alright\" and \"this too shall pass.\""
    },
    {
        "name": "t3_2istv4",
        "created": 1412921470.0,
        "ups": 6,
        "downs": 0,
        "title": "[Help]Doctors ignore my basic problems they just scream depressionx10. Who do i go to for a diagnosis i mean psychiatrist,psychologists, therapist. I really want to die in a painless manner.",
        "selftext": "Please don't delete this post just asking for some advice but i am probably breaking a rule but if you do deleted it don't pm me about it i get upset like really upset i am stupid like that its my flaw not yours. I really am helpless now. I am 22 years old and a Indian.Somethings about me i am suicidal and have been diagnosed with depression which might be true or not but fuck that.I have been to 3 psychiatrists now and here is how it went.1st one)This was the worst one oflot all advice he gave was eat more medicine he increased my dosage randomly.  We found out that he was a greedy doctor who only made me go to a certain chemist and recieved a certain commission on it. My mother flew into a rage when she heard about that so my treatment stopped completely.. until we decided to go to him again he give some miracle pills idk i felt like i was flying i was ridiculously active and positive but what's this medication killed my appetite completely i couldn't even take 1 biscuit with a little coffee i would vomit. I loved this my weight was going down rapidly 20 kilos in one months until one day i went berserk i had a panic attack and i took every single cleaning agent mixed it and drank it and then drank a lot of water. This backfired however i started vomitting it back and their was fragnance my family suspected something and i told them i was rushed to hospital and had a stomach flush out or whatever. After you commit suicide they assign a psychaitrist to you and guess what this was the same doctor my mother told the doctor they will take them to him later and  called him andguess what he said he needs to keep taking the pills or he will kill himself again. My mother threw down the phone and swore to kill him if she saw him.2)This doctor i wasn't honest with him i was confused what to tell him and basically i told him i am lazy and i am the loser he agreed! told my parents i have no depression i am lazy and they must pay more attention to me but they didn't but this is not my mother's fault don't blame her 3)This time i went to a psychologist but she was counselor or something and eventually i ended up with a psychiatrist again  she said the same thing i have depression and gave me pills.All these pills do is supress my suicidal thoughts by a limit i had a raging suicide drive before not now.Here are some of the problems i face.If your teacher is teaching a subject i must pay full attention to it if even for a one minute i take a pause my mind is gone i lose control of it i go on a day dreaming parade some of this day dreams are frankly scary.They usually involve me being married, dying(disease,trapped in space, suicide,divorce....,having superpowers and in this case i am never the hero of the story.. but i am a badass the hero/heroine is someone else.If i am watching a video and if even a slight pop up or distraction comes up i will lose focus get angry and go to downloadhelper in firefox dl the video and watch it.I completely stop i mean like a discipline habit walking a mile in the morning,praying what i was doing for no reason to trivial reasons.I am starting to forget stuff like completely. This happened recently.I am an annoying person this isn't self hate i am annoying i type like i have a lemon in throat and i talk even worse i bring up irrelevant points and this causes my friends to lose interest and they take to each other and this upsets me and i literally go around somewhere sad and wanting to cry and sometimes even cry.Here are the important things.I failed college. I have no friends. I have no job or no job skills and i am in India this place is ridiculously low on jobs unless of course you want to be a slave at a call centre. I am doing nothing in my life like not a single damn thing i just panic,cry,video games,simple on a wet bed i am a bedwetter i am disguising however i am not like this one i want to meet someone i get cleaned up wear clean clothes,shower i don't have friends because i don't know anyone anymoreI am never able to convey my problem to a psychiatrist never i wander off Now my problem.What do you think when you go to a psychiatrist and counselor,psychologist? This will solve my problem this will help i will no longer be lazy and miserable now the change starts! fuck yea or something like that but me i don't i think nothing i don't even make a list what to tell to a psychiatrist i will go early and sit in the waiting room and i usually go first but if it isn't i will sit in the room and day dream.My post in sw http://www.reddit.com/r/SuicideWatch/comments/2ipmde/i_just_want_to_die_i_cant_fix_myself_and_i_am/ got one comment not their fault they have better and real problems to deal with but yea.I actually wrote this on adhd sub but i feared they will probably delete it because it breaks rule so i posted it here while replying to someone who messaged me on sw fuck i idk i think i have no future if i am like this."
    },
    {
        "name": "t3_48mgqc",
        "created": 1456959506.0,
        "ups": 7,
        "downs": 0,
        "title": "Relocation helped in controlling symptoms",
        "selftext": "Hi r/Anxiety. Thank you for the continuous support I receive from reading about the ups and downs in the lives of so many. Ups - makes me believe I can get there tool; downs - this might sound selfish, but I cannot escape the thought that \"it isn't as bad\". I just hope all those downs get converted into ups.I'm from India and recently (November-end) moved to a new city with a new job. This is the third city I am living in - home, then city A with job and now city B. I got my first major panic attack in city A and that triggered off a serious of horrible symptoms - younameit. Ironically, all of this came up when I was helping my then colleague deal with his bouts of anxiety. I underwent a course of betablockers after I found out that no, it was not a heart attack I was expecting.However, ever since I moved, I realise the symptoms are going down (and also understand that they may come back in a second - hope not). The most nagging symptom was perennially ringing feet. Gradually, the chest and jaw aches went and I can feel the ringing slowly disappearing. It's weird because work and city A had nothing to do with it. I loved city A and miss it so much. My job was also fun with a great boss and wonderfully friendly colleagues. But, I'll take this change with open arms. I am still coping up to the new city and the unknowns still give me the heebiejeebies. I just wanted to share that I have not felt better in a long time. I also have started to diet and excercise and lose some weight (after gaining horribly after an accident that left me bed-ridden and quitting smoking unsuccessfully for two months and half).I don't know for sure if this is foolproof, but perhaps if its possible for some of you to have a change of environment, please do so. It might help or at least lower whatever you are going through.I am going home tomorrow after some time for some days and am eagerly looking to meet my folks and friends. My folks still don't know about my anxiety and hope they do not need to from here on. I can also face and talk to them without much hesitation.Thanks for letting me talk. Hope by the passing day, things go better for you. As always, here's a tip: take a deep breath. Love to all. EDIT: tl;dr - I got diagnosed the middle of last year. Moved to a new city in November. Feel much better now. "
    },
    {
        "name": "t3_15jqrr",
        "created": 1356685824.0,
        "ups": 7,
        "downs": 0,
        "title": "Long-term Ambien Use? Experiences?",
        "selftext": "I've been on Ambien 10mg nightly for close to 5 years. Initially, it was prescribed to mitigate, almost daily, severe, migraine headaches. Basically, it's worked as described. Most nights I get a good nights sleep. I haven't been without it every day for years. The only time I was without it was on an overseas business trip to India. Upon understanding the ease with which pharmaceuticals are procured outside of the US, I was able to remedy the situation after a couple of days. I've been on this shit for so long, that my mind runs in circles if it believes that its host has not gotten its 10mg daily dose. The migraine remedy treatment has had a slew of benefits. Fewer migraines, more sleep, and an ability to tolerate quantities of alcohol. Pre-treatment, I couldn't drink a glass of wine or a bottle of beer without feeling like shit the next day. Five years out, the only thing I have to show is poor short-term memory and the need to drink at least a bottle of wine or (in the summer) a six pack of beer or more. Upon telling my psychiatrist, she told me that I was abusing Ambien and told me that the Ambien and alcohol mix has caused an alcohol addition too. Now, I experience severe cravings. At 5:00 most evenings I get a severe craving for alcohol. I feel like there is no fix except alcohol and there is nothing that can stop me from procuring it. No matter what I am drinking that evening, I know that I must stop at 8:00pm or experience sleeping problems.All of this frightens me. even with Ambien, I can stay awake for hours re-numerating on a day's event. I may not fall asleep until 1 or 2 in the morning. My shift starts at 7:00. I am not a young man, I am in my late thirties and am not cut-out for sleep depravity. It's just passed 8pm and I've stopped drinking for the day. Two hours left to sober-up and then go to sleep using ambien. It'll be the same thing tomorrow.Anyone else have similar experiences? How did you break it? My physc has put me on a different sleep med and has suggested anti-craving medication. If you saw me, you wouldn't know I had problem Is there anyone else out there like me?"
    },
    {
        "name": "t3_465t7a",
        "created": 1455701886.0,
        "ups": 4,
        "downs": 0,
        "title": "Anxiety and Addiction (UK)",
        "selftext": "I have always known that I suffer from moderate social and general anxiety disorders. That is to say, I have always been extremely shy, felt different from others, and find most social encounters and events fairly distressing if it is not with close friends. Whether or not the frequent bullying I endured throughout childhood was the result or cause of this, I'm not entirely sure.It is only within the last few years that I have learnt about these official terms and symptoms for anxiety disorders, and instantly matched those up with the unexplained struggles I go through every day, realising I am not the only person who’s brain is wired-up like this.Some days I will go bright red simply from a short conversation with a cashier or waiter. Other days I can seem like the most outgoing and loud person in the room. The latter is usually the result of some kind of chemical influence - that is my crutch. I am in my late twenties, and the crutch has taken many forms. Early on in my adolescence it was alcohol, however as I get closer to my 30th birthday, the crutch has frequently been made up more of illegal substances than the socially acceptable alcohol.The one and only time I have seen a doctor regarding my anxiety was two years ago, after 6 months of daily use of a \"legal high\" available online called etizolam. This drug is actually prescribed for anxiety in India. Although it is not a benzodiazepine, it is in the same family, and has similar effects. When I produced a long list of my experienced anxiety symptoms I had written down for my GP, he immediately looked uncomfortable. I expressed my concern about the increasing withdrawal effects I was suffering from etizolam. He didn't know what etizolam was (fair enough), so he googled it. He asked if I had any pills left. I said \"no, I took my last one earlier today\". He looked slightly concerned for a second, before handing me a prescription for the beta-blocker propranolol. He assured me that this drug would block out any withdrawal from etizolam, and would help me feel less anxious in my day to day life. There was never any mention made of mental health councelling options available. Looking back, for him to research the type of drug I was taking and not suggest some form of substitute or tapering plan, and instead instruct me to go cold turkey, was putting my life and long-term mental wellbeing at risk.What followed were five days of the most excruciating withdrawal symptoms after stopping etizolam cold turkey. I couldn't go into work. I couldn't leave my flat. I couldn't stop shaking, let alone sleep. My terrified girlfriend came close to calling an ambulance several times during my more severe panic attacks. If you've ever gone cold turkey from a short-acting z-drug, you know what I'm talking about. Unfortunately, I had no idea this was in store for me (thanks for the heads-up Mr GP).Eventually I recovered, and decided to stop taking propranolol, because to be honest, it does NOTHING to help my anxiety. But I can honestly say that those five days were the worst days of my life. I feel my GP let me down and just prescribed me something to get rid of the uncomfortable conversation. So I stopped taking etizolam, but continued to allow anxiety to rule my life.Anyway. This post has somehow become a wall of text. Sorry about that (it's one of my many crutches doing all the talking).Fast forward to today. To deal with a high-stress job, I started using diazepam to deal with my anxiety. This has become a daily habit for about nine months now. I have been attempting to taper off for two months, however I am not prescribed the diazepam, therefore I am concerned that the sources I obtain it from contain inconsistent dosages, especially after some research online. I am also going through some very stressful life changes, and honestly I don’t know if this is even an appropriate time to attempt a taper, even a slow one. I also need general anaesthetic for a shoulder operation which is desperately needed for a partially separated AC joint. I've been putting it off for months because I know that I would be a fool not to disclose my high tolerance to diazepam to the anaesthesiologist. Disclosing this prior to the operation without firstly disclosing it to a GP will, I imagine, lead to the operation not going ahead (correct me if I’m wrong).So, TL:DR – is a UK GP likely to prescribe me diazepam if I present a tapering plan? My guess is not. Is an anaesthesiologist going to allow an operation to go ahead on a patient who is addicted to illegally obtained prescription drugs? My guess is not. Are the NHS likely to provide me with the counselling I need to beat anxiety in the long-term? From what I’ve heard recently, my guess is not without being on a very long waiting list.To be honest I don’t really even know why I’ve written all this out. I can’t bring myself to come clean to my girlfriend about this most recent addiction, after everything I put her through with etizolam withdrawal. She’s got her own problems to deal with at the moment and I can’t face losing her over this. However it’s only a matter of time before we travel somewhere where I can’t obtain diazepam and ruin the holiday with withdrawals.I’m the only person in the world who knows about my addiction, and I don’t feel like I’m able to discuss this with anyone. As soon as I lower my diazepam dosage, I become agoraphobic and barely able to interact with friends, who just don't have a clue why I might be behaving like that. I feel incredibly alone, trapped and guilty and I just want this weight off my shoulders."
    },
    {
        "name": "t3_4c8jbq",
        "created": 1459163456.0,
        "ups": 2,
        "downs": 0,
        "title": "Highest of highs ---&gt; Lowest of lows in a week.",
        "selftext": "Im 17 and in highschool. For the past year I have tried to make friends but they all ditched me sooner or later. But last week, things were looking up for me. A month met a someone (lets call him Liam) in class who had other friends that party. I met up with him and 5 other girls and guys last weekend. I knew I wanted to make a good impression with these people and pushed myself more outgoing than usual. It was succesfull and I made some new friends and my social life would make a 180. I was having the highest of highs in a while, or so I thought. Tuesday I ate lunch with Liam and he asks me \"Why were you being all anti social at the party?\" I said \"No I wasn't whatever. I had alot of weed to smoke (not true)\". I was feeling pretty bad at this point but when this saturday came around I contaced Liam (I knew he was with the group) to see if he wanted to hang out. He said \"Im eating dinner with fam\", I look at snapchat story and its him hanging out with the group. So now im in the lowest of lows again, vaporizing weed all day alone in my room. https://www.youtube.com/watch?v=VrDfSZ_6f4U (this is 100% me)I ordered some beta blockers from India so im hoping those will help. TL;DR The taste of a good social life and then being rejected makes you feel worse than never getting to experience it at all. "
    },
    {
        "name": "t3_4obb9q",
        "created": 1466075527.0,
        "ups": 0,
        "downs": 0,
        "title": "Being oneself when you’re in a sea of others",
        "selftext": "How does one become himself or herself forever. Never being swayed by other people, and never manipulating or being manipulated. How does one reach this state of mind/presence?You are at a party, where you have people of all colours and voices. Some are bold, and others diminuer. The entire group may have a few commonalities, or there may be various sub-groups with similar elements. Now how does one participate in this discussion, without imitating the group’s tone, or energy. How do you find yourself and maintain it throughout your interactions? Is it better to cave in and follow what the group dictates?How about both. Both. A little bit of them, and a little bit of me. When a group sees an outsider they instantly deem them to be unsuitable for conversation. They think that the individual is too “out-there” and is trying an experiment with us to see our limits. See a group, needs an outside entity to define it. It’s Team Microsoft V/s Team Apple. Team India V/s Team South Africa. Hinduism and Buddhism. What we fail to understand is that groups inherently want the same thing. All of them want to share knowledge, insights, resources and share a common goal. Now whether you are a part of that goal or not, is up to you. When you’re an outsider or an “individualist”, you do not follow the same goals of that of the group’s. So then what’s your goal then? If its nothing, then that’s perfect. You have no goals from interacting in the group. Therefore you can actually talk to them, without treating them as “assets” that you can use over time. They will appreciate it, and talk to you more. A man with no agendas, and wants nothing? – Holy Moly, what’s this guy’s game? People will get attracted to that, and soon you’ll find like minded people around you.In the other sense, you’ll actually develop meaningful relationships with people, as the outsider who loves the members of the tribe unconditionally. You can be a reliable source of information and aren’t selling yourself all the time.So now, what’s your anxiety all about? Why continue to be in the dark about your inner-self? You want to express it, and so does everyone else. Now imagine a world where everyone expresses their inner-self. You now have a civil society that enjoys talking to other people.Our other hang-up, is that we always try to change/help people. We try to figure them out constantly, to figure out how they can become more a part of the tribe. Give this up, because you and me and everything in the unniverse is the same thing. We all have the same motivations and intrinsic intentions. Like a feather that flows with the air, you determine where you want to go by bending sideways or floating left."
    },
    {
        "name": "t3_3z8bns",
        "created": 1451822336.0,
        "ups": 2,
        "downs": 0,
        "title": "Being yourself when you're feeling anxious",
        "selftext": "How does one become himself or herself forever. Never being swayed by other people, and never manipulating or being manipulated. How does one reach this state of mind/presence?You are at a party, where you have people of all colours and voices. Some are bold, and others diminuer. The entire group may have a few commonalities, or there may be various sub-groups with similar elements. Now how does one participate in this discussion, without imitating the group’s tone, or energy. How do you find yourself and maintain it throughout your interactions? Is it better to cave in and follow what the group dictates?How about both. Both. A little bit of them, and a little bit of me. When a group sees an outsider they instantly deem them to be unsuitable for conversation. They think that the individual is too “out-there” and is trying an experiment with us to see our limits. See a group, needs an outside entity to define it. It’s Team Microsoft V/s Team Apple. Team India V/s Team South Africa. Hinduism and Buddhism. What we fail to understand is that groups inherently want the same thing. All of them want to share knowledge, insights, resources and share a common goal. Now whether you are a part of that goal or not, is up to you. When you’re an outsider or an “individualist”, you do not follow the same goals of that of the group’s. So then what’s your goal then? If its nothing, then that’s perfect. You have no goals from interacting in the group. Therefore you can actually talk to them, without treating them as “assets” that you can use over time. They will appreciate it, and talk to you more. A man with no agendas, and wants nothing? – Holy Moly, what’s this guy’s game? People will get attracted to that, and soon you’ll find like minded people around you.In the other sense, you’ll actually develop meaningful relationships with people, as the outsider who loves the members of the tribe unconditionally. You can be a reliable source of information and aren’t selling yourself all the time.So now, what’s your anxiety all about? Why continue to be in the dark about your inner-self? You want to express it, and so does everyone else. Now imagine a world where everyone expresses their inner-self. You now have a civil society that enjoys talking to other people.Our other hang-up, is that we always try to change/help people. We try to figure them out constantly, to figure out how they can become more a part of the tribe. Give this up, because you and me and everything in the unniverse is the same thing. We all have the same motivations and intrinsic intentions. Like a feather that flows with the air, you determine where you want to go by bending sideways or floating left."
    },
    {
        "name": "t3_2oni75",
        "created": 1418081572.0,
        "ups": 2,
        "downs": 0,
        "title": "Afraid of taking the train for the first time?",
        "selftext": "I just read in the papers about an accident on the rail how someone slipped and fell and got crushed under the train.I have never taken the train all by myself before and am now starting to feel anxious about doing it for the first time.It's for a job interview.I feel very uneasy thinking about it.What if i miss a stopp?will I make it there safely?.I live in India btw so many careless idiots and instances of accidents.Doesn't make it any easier.Anyone suffer from the same thing/or in the same situation right now guys?"
    },
    {
        "name": "t3_1rioks",
        "created": 1385525896.0,
        "ups": 4,
        "downs": 0,
        "title": "Effective treatment for anxiety",
        "selftext": "Please help me find treatments for my jitters and anxiety. I am a man of limited means but my heightened state of anxiousness is making things difficult. I cannot afford to see a doctor now (I recently quit my job -- wasn't being able to handle the pressure). Are there over-the-counter medicines that can help? I live in India, where getting fleeced, even by doctors, is always a possibility. I'd appreciate any guidance."
    },
    {
        "name": "t3_1zxsa9",
        "created": 1394361805.0,
        "ups": 2,
        "downs": 0,
        "title": "Travelling with Anxiety",
        "selftext": "Dear Reddit,I am flying to India on Friday and I am suffering from panic attacks and anxiety. I couldn't sleep last night because I was up worrying about the flight and the fact that I wouldn't be able to escape the plane in case of a panic attack. Any tips on how to avoid panic attacks or fear of flying in general? Any suggestions welcome. Thank you in advance. "
    },
    {
        "name": "t3_23vc0h",
        "created": 1398385242.0,
        "ups": 5,
        "downs": 0,
        "title": "[Help] A lot of anxiety about all the alone time I'll have this summer.",
        "selftext": "I'm very happy in college and I have great friends and an awesome situation here. This summer I'm going on a school trip to India and then I have an internship for 6 weeks afterwards. Then, I have to go home from mid-July through August before returning to college.The thing is, ever since I started college, I have a lot of anxiety surrounding home. My family sort of blew up (divorce) during high school, but I really love spending time with my family and I'm so happy when I'm at home with them. Though I had a really solid group of friends throughout high school, I went to one of those schools when everything was a competition--school, popularity, how many guys like you, etc. Now, whenever I think of my friends from home I feel empty and anxious. Either way, most of them will be in other cities this summer, but even if they were home at the same time as me, I know it'll be really difficult to see them. I just feel like I've grown really far away from the person I was in high school and I can't handle being around them, I don't feel like I can be myself and I'm not happy.So, I think I'll be spending a lot of time alone this summer. I know it's a chance to chill out, start therapy, do yoga, read, paint, etc., but my birthday is in August. The idea of my birthday coming and going and no one cares except my mom and close family members makes me so anxious. I feel like these big dates really reflect where you are in life, and if I'm alone on that day (meaning, not celebrating with friends), I know I'll feel like I don't matter and I'm easily forgettable.My heart is clenched I'm so anxious I feel like I can't function. I don't know what to do. /r/anxiety, if you have advice for anything, like summer activities, solutions to my issues, or how to deal with these underlying anxiety issues, please let me know**TL;DR: Will spend a lot of time alone this summer because I'll be at home and won't want to see high school friends. Really scared about spending my birthday (in august) alone.**edit: word"
    },
    {
        "name": "t3_2c6vf4",
        "created": 1406792474.0,
        "ups": 3,
        "downs": 0,
        "title": "Boyfriend traveling out of the country for a few weeks, anxious about not being in touch",
        "selftext": "My anxiety mostly revolves around being afraid that something terrible happened to my SO/family member if I can't reach them or haven't seen a \"sign of life\" on social media type things. It's the worst with my boyfriend-- I'm sometimes get panicked even if his work commute takes longer than usual, and I see that he hasn't \"seen\" an FB message from me or something.So these next few weeks are going to be hard. He just flew to India, arriving at the airport there around midnight India time, a few hours ago. He hasn't checked in with me yet-- probably because it's around 4:00am over there, and the hotel reviews for where he is staying say the coverage is spotty. But I'm still feeling worried and anxious and sad. Really, I think the first time I know he'll have reliable Internet is on Sunday, which is when he'll be staying with some friends. But I really hope he's able to check in sometime before then =/. Just wanted to post here and get encouragement from people who might get it. My friends try to be sympathetic, but I know they don't really get it or know how to help. "
    },
    {
        "name": "t3_1l8uw4",
        "created": 1377702009.0,
        "ups": 5,
        "downs": 0,
        "title": "Cipralex + Wellbutrin = Progress",
        "selftext": "Hi my fellow self-conscious Beings. yea, just wanted to share that I was on Cipralex for six months, and I noticed the difference in my anxiety/obsessive thoughts right away. Then I went on vacation to India and I was still taking it daily, but asking myself what it was doing really. So, I stopped taking it while on vacation. And I was fine. Then, I came back home to Canada, and yea, I called the pharmacy right away and filled out my Rx. Was on it straight for another three months and I noticed it was making me drowsy. Went to doc. Told her and she put me on wellbutrin additionally. and kunggggggg. was very good. Still pretty good. Last week I thought I would taper off the cipralex and began taking half-pill. whoah did I notice the increased anxiety right away. Was getting used to it, then had a busy week and I couldn't take the chance so back on the full cipralex, and back to feeling somewhat zombish again. That's when it struck. Don't take 1/2 cipralex, take 2x wellbutrin. Eureka! "
    },
    {
        "name": "t3_2uovno",
        "created": 1423033385.0,
        "ups": 1,
        "downs": 0,
        "title": "starting to freak out about upcoming travel so much so i dont want to go anymore...",
        "selftext": "i thought it would be fun to sign up for a group travel to india for like 20days..with a bunch of random people ive never met before.  this is gonna be awkward since im scared of social interactions.  im especially terrified of the meet and greet where im sure we take turns introducing ourselves and telling a bit about ourselves.  I hate speaking in front people and im going to stutter.  I have a feeling people will be getting into groups within the group and ill just be a weird random outsider. this is going to suck.  "
    },
    {
        "name": "t3_148i6z",
        "created": 1354614262.0,
        "ups": 6,
        "downs": 0,
        "title": "My experience taking holy basil for anxiety",
        "selftext": "It's my second year of college. I've always had anxiety, but other than being a huge obstacle to socializing, it hasn't hindered me in many other ways.My first year of school was great, and I was really excited to come back. But the combination of me having too much work and my realization that college has no meaning or value for me whatsoever (along with a number of other factors) ruined my mind. I was always anxious, sometimes because of something in particular and sometimes for no reason at all.I was talking with someone who is into herbal remedies, and I eventually ended up buying some holy basil capsules (Organic India). I'd tried St. John's Wort to no effect, so I figured I'd give this a shot, but I had very little faith that it would help.I was taking two of those capsules twice a day, and a few days after I started, I walked outside, saw that it was a beautiful day, and for the first time in a very long time, I felt absolutely overjoyed. I couldn't stop smiling.For about the next month, my mood continued to be much higher (though I still had my moments, of course). It didn't really help me to do better in school, but when I messed up, I was able to brush it off and not get upset. I felt grateful to be alive, and nothing could stop me.Then I started feeling worse. The anxiety began to return, and as it continued I decided to myself that I should stop spending my money on those pills. I figured the effects were probably all in my head anyway. So I stopped.Things continued to worsen, but I was still functional. At some point last week, I had a lot to do and found myself unable to do any of it. I felt totally paralyzed, and all I could do was sit and cry. I told myself I'd go to therapy the next day (for the first time). In my desperation, I took two capsules. Within an hour, I felt incomparably better. I actually felt *good*. I still wanted to go to therapy the next day, but I felt unable to because I wasn't really upset. So I decided that this time I'd stay on it. It was obviously helping.Unfortunately, the past two or three days have been the worst, ever. I am a total wreck, really miserable, and I can't seem to do anything, which is just fantastic, seeing as the semester is ending and all the papers are due and exams are beginning. I have made up my mind that tomorrow I am going to go to counseling at my school. Sticking with the holy basil for now, too.My advice to anyone considering it: give it a shot. I wasn't confident about it at all, but it has definitely helped me a lot. If it works for you, it will be well worth it.I'm not sure if the return (and subsequent worsening) of my anxiety is a result of becoming tolerant to the medicine. Maybe I'm doing better than I would be without it. I don't know. It does seem to me, though, that when I am in a really terrible state and I take some, I generally feel a lot better within a couple hours.I think maybe a better idea (at least in my case) would be to take a lower dose (half of what I am taking now) and take more when I'm not feeling okay. It's something that you'd probably have to experiment with to see what helps you.While my experience has been mixed, I've been able to spend a lot of time feeling really good that I probably otherwise would have spent very upset. So I definitely think people with anxiety should give it a shot!"
    }
]