[{"created": 1584758294.0, "author": "chikoogamer420", "title": "Islam is the cause of my depression. Does anybody else feel the same way?", "selftext": "I suffer from clinical depression. I don't know if you could empathize with me but I often feel severely depressed reading about Islam and its growth in this world. Islam has caused so much harm to humankind and it continues to do so. This is highly depressing.Every day, there are Muslim fanatics either trying to convert non-Muslims (they call them __Kaafirs__) to Islam or kill them in the name of jihad. Muslims do not integrate into the country they migrate to; instead, they try to take over and convert it into an Islamic state. This is why the situation in Europe is so worrying. Angela Merkel started the madness of bringing in hundreds of thousands of 'rapefugees' into the EU and is single-handedly responsible for starting the obliteration of European cultural values. What's even worse is that Muslims outbreed the native population significantly. They don't believe in condoms (supposedly unholy) nor family planning.Britain especially is seriously screwed. There's a jihadist attack almost every other day, Muslim rape gangs molest and rape young white girls and extremists want to introduce Sharia law. They even held a protest in favor of Sharia and displayed a huge banner with the words \"Jesus was a Muslim\".In my home country of India, Muslims are a minority comprising 14% of the population. Many of them are anti-India and pro-Pakistan. They do not tolerate any other religion. It's not safe anymore to practice your religion in or near Muslim-majority neighborhoods. Our government is trying to introduce a law that would grant citizenship to minorities fleeing religious persecution in the Islamic states of Pakistan, Bangladesh, and Afghanistan. Indian Muslims are going berserk, vandalizing property and hurting innocent civilians.The purpose of religion is to make good human beings out of us all. In that regard, Islam is failing. I would argue that Islam is a regressive political ideology masquerading as a religion.I have stopped consuming the news. It was degrading my mental health reading and watching all those Muslim atrocities. But even now, memories come back to haunt me. I feel helpless like I can't do anything about it. Politically correct leaders around the world are failing us.So, have any of you been in a similar situation? How did you get out of it and move on? How did you find inner peace?", "is_suicide": 0}, {"created": 1584407083.0, "author": "Ezrakadabra", "title": "little rant", "selftext": "I feel like I'm close to another little 'break down', it's the kind where I just scream and cry, curl up and just lie on the floor for a while. I have no idea if this is common for people (I'm still new to talking about this shit O.O). Anyhow, I've been depressed for as long as I remember and I was cutting myself for a long time but haven't in a little over 4 years or so. But lately the urge has been a bit too much, I won't lie, it's gotten easier over the years, because I really didn't want to add more scars (I FINALLY started wearing short sleeves and stuff out in public, maybe a year and a half ago).. It doesn't help I don't have any ganja, I live in the Netherlands and the 'coffeeshops' (I still don't know why they call it that, I probably looked it up once but forgot) have been forced to close down due to the pandemic, but ganja was working pretty well for me. Some strains made my anxiety or paranoia worse, or sometimes when I'd smoke too much, but at least 75% of the time it made me feel much calmer and helped me to enjoy my day at least a little, make things bearable.. I also have back pains and other random little pains that I can shrug off when I'm slightly stoned (I rarely get completely stoned, think I might have a high tolerance or something). So anyhow, that sucks. I quit drinking beer a few months ago because it became a problem and so now I'm down to only chocolate which is soooooort of comforting but I can eat an entire bar and then just feel like I'm ready to cry while also jumping all the way to the moon from the sugar rush (I eat very healthy stuff most of the time, so when I eat something chocolaty or sugary it's like.. WOOOOOSHHH!!). &amp;#x200B;And don't get me started on the corona thing T\\_T (don't worry, I got myself started anyway, this is a weird statement why do people make this.. why am I doing it?!) ... anyhow, all those damn idiots hoarding food and toilet paper, my boyfriend finally managed to find some toilet paper today and some dried red lentils (which is one of our staple foods) and it stresses me out so much.. and I worry one of these days we're going to be out of something and we have very little, we've been very low on money these past few months especially (we've never had a lot to spare anyway) and I'm always craving comfort foods and stuff that I can't have and to then run out of basic things is really unpleasant :( &amp;#x200B;Also I just moved from Scotland (my boyfriend and I moved there initially and I was super hopeful and he got a cool job but then he quit and we quickly ran into money problems again and now we had to go back again because things weren't working out and blablabla) and my friends, the only real friends I've made in YEARS, are now all far away.. Two of them are still in the UK (one was going to India but now she couldn't because of virus stuff) and the other is somewhere super remote in Norway (good for him though, I think) and I really miss them every day and I'm not on any social media, I don't have a phone, I only use email (I just recently started posting here on Reddit out of sheer desperation, hi...) to talk to my mom (I don't call my parents cus I rrrrrreeeeaaaally hate phones and especially talking on a phone) so I've been extra lonely.. my boyfriend has to work a lot, especially now because co-workers are getting sick and taking extra measures not to infect people.. because he works with sick kids and nobody can risk infecting them which is another worry of mine! I'm so scared he's gonna catch the virus from some random person in the supermarket or something and then spread it to the kids without knowing it and they could die from it and I honestly don't know if I could live with that..On the bright side, he won't get it from me.. I haven't left the house in weeks, months(?) I don't even know.. I went outside with him, a few weeks ago, to go to the stores.. and I think we went for a walk in the woods once.. Today I stood out in the garden for a few minutes.. but sometimes I get so nervous or scared or both for no good reason that I don't even like being near the windows where people could possibly see me. &amp;#x200B;I'm turning 31 next month... I thought my last birthday was somewhat of a miracle because I used to say I wouldn't make it past 30.. But also.. we arrived in Scotland on my birthday (I even had cake, yay!) and I was so hopeful and optimistic about everything.. Before we left I made some good changes, I was eating well, lifting weights, I was growing my hair and my beard (yeah, I'm a boy, lemme know if I surprised you, cus that might make me smile) both of which were very bushy and full and then I got sick, a week (maybe two at most) after we arrived and was stuck in bed for a whole week or something and it was awful and I fell back into my old habits soon after that. It all went downhill from there. I shaved my beard because it became very annoying while I was sick and struggled to eat, later that year I also cut my long hair after my boyfriend's mother commented on my grey hairs (why do people insist on pointing that out?!) and while I used the excuse of ''I wanted to try short hair'' and told everyone that I would have regretted not cutting it also (which is partly true).. I miss my long hair so much.. it was almost at the longest length I've had before and I really wanted to go beyond that.. &amp;#x200B;Another random annoying thing; my twitchy eye has returned, it started a few years ago and came and went, but it's back now and it really bugs me.. always my right eye, feels like it's the lower right corner but I'm not entirely sure (haven't really bothered looking in the mirror, cus I don't like looking in the mirror half the time ofc).. &amp;#x200B;Anyhow, I gotta eat dinner now and this is probably not a ''little'' rant and I might delete it or whatever later if that's possible.. but I expect it to be buried below the other posts and that's fine with me.. honestly, even if people comment (hi again), what exactly is that going to do for me? I'm too much of a hermit, maybe I'll leave it on as a form of exposure therapy.", "is_suicide": 0}, {"created": 1584345110.0, "author": "shmoomooPS", "title": "Hey so I dont know how to say this exactly. But I moved half way across the world and I feel so alone.", "selftext": "So essentially about 6 months or so back I moved from india to usa. I'm in a midwest state. I moved cause I got a green card and everyone told me not to give that up. I got my first job (fresh outta college) and I moved. My parents are back home, all my friends are back, the person i love is also back home. I feel alone most of the time. I spent today evening crying thinking what did i do to end up here and be in this situation. Also to add to this, my family back home is really going through financial hardship (indian economy is screwed and the middle class - upper middle to lower middle took the worst hit). I dont want to tell my parents anything cause they themselves have way too much to deal with. Also I think pretty soon they're gonna loose the house I spent 22 years of my life in. I dont know what to do. I feel so trapped. All I do is run my body on autopilot and just do the minimal to exist and do my job. I want to take steps go gain more skills and improve my situation but all I do is fucking cry and feel like shit. These feelings peaked today. I was mainly suppressing these feelings so that I could function but I couldn't today. Nothing really triggered it. All I did was take a nap and wake up crying. I usually wake up feeling fucked up.Sometimes I go to sleep hopin I wouldn't wake up. Or wake up back home and this is all an emotional nightmare. I think I surely missed out on some other details but I hope this paints a picture of my situation. Any advice on this would be appreciated. Thank you for reading! Hope everyone gets through whatever they're going through.", "is_suicide": 0}, {"created": 1584039121.0, "author": "srvrd", "title": "My brain feels like it's going to explode!", "selftext": "I have been troubled since my teens but it was never anything serious as in it never had any effect on my ongoing life, or so i thought. I am from India so like most of Indian kids the problem for me began after i completed my high school (10th standard). I was always interested in arts. Most of it was due to the fact that my mother reads a lot and was a very good painter (stopped after she married). I was an average painter but pretty good with pencil art and cartoons particularly. I also spent a lot of time reading classical literature mainly horror and Oscar Wilde. So, naturally i wanted to take arts as my stream in senior secondary and study English literature. I was good in sports and won a few school tournaments. My results were above average too as i scored 90% so my father decided I must take science and be an engineer. I resisted and try to explain him but he got all fired up and things got physical. Just as i was about to punch him my mom stopped me and told me not to and I couldn't say no. I took science and in a few months decided to prepare for several entrance exams for some architecture schools as it was the closest to being in the creative field since i was never gonna score enough marks to enter a literature school. I cleared the exam too with and all India rank of 4k something which was decent to get me a good private college or the low tier govt institutes. So again it was denied by my father and i was forced to take up engineering in computer science as i was good in programming. It's all been downhill from there. I smoke heavily and drink more than i should. It was worse while i was in college where I had my first meal in a bar before i drank to the point i felt nothing. I could walk easily to room no matter how much i drank and sleep in peace. I stopped that and switched to weed. Till then I had performed horribly but managed to perform well in my major project and even presented it in a conference. After that I've felt nothing. I don't have a job. I don't feel like studying, I don't read anymore,  Whenever i pick up a pencil i feel like my hands are gone. I can't draw shit anymore. I used to draw a line and then another and it used to fall together into a picture but now i can't even draw a decent landscape anymore. My hands start shaking and i can't feel the picture in my head anymore. I used to have a journal which I've stopped updating around 2 years ago so i don't write anymore too. My Les Paul has been lying in a corner and i noticed today that the frets have been completely damaged by fungus. I wake up everyday, cook my breakfast (my only meal), take a bath, smoke weed till midnight while listening to some punk, grunge and motorhead.  I'm tired of  telling myself that you're a man, deal with it. I pushed all my friends who tried to help me away from my life, broke up after school and never felt sexually anything after that. I feel like all my feelings are dead except the anger. I close my eyes and all i see is red which feels darker than black and feel this constant stream of rage and all i want is to break things or whip myself with a belt. I hate everyone around me and now I don't even go to birthdays or any occasion as I'm sick of trying to act normal and fit in. I just sit in my room and stare into my laptop screen playing games like a zombie, some days drunk and mostly stoned. Now even these two don't work for me and I'm thinking of getting into going heavier stuff. I know this is wrong but I can't help myself and have no one to talk to as i don't even talk to my parents anymore. I don't need any charity I just wanted to get these things out of my brain to people who have no idea who i am. So, thank you if you took the time to read this. Have a good day.", "is_suicide": 0}, {"created": 1583205557.0, "author": "r_734", "title": "Everyone says you matter!!!", "selftext": "20 M final year computer engineering student,India.Everyone says that \"you matter\" but I don't believe what it means and I don't believe that at all.is really literally everyone matters?I am not talking about universe's some scientific theory way or god's great plan way but from the point of that person's living through satisfied life way.Because I have first hand experienced that if you don't have knowledge,money,love,power, beauty [physical appearance],sense of humour or even people pleasing qualities nobody have any business with you.I have been a people pleaser and attention seeker a for my whole life and now I simply just can't do it.since I have dropped people pleasing here and there I don't do any thing.i realized and came as incompetent and looked down guy in every aspect of life.say it such friendship,career, family, values.everything.I don't play good with people in group like sport team or my college project team.keep them hanging and being dead weight not finishing my part of work,being late ,not contributing.And don't forget the deadly combination of complexes and bad habits(no addictions aside from mobile phone and constant need of entertainment).It's living hell.i can't tell every detail here but it's pretty bad.i not suicidal per se because that requires certain degree of courage and will power.Am I fixable? Can I be happy or content again ever in my life?I laugh watching funny videos but that isn't happiness,right?So please answer.", "is_suicide": 0}, {"created": 1583037259.0, "author": "s_mart_10", "title": "HELP", "selftext": "Hey,I don't know why i am typing this but i think i need some help.A man knows where he need help so here i am.I am 21 years old male from jhansi UP (INDIA)I feel kind of numb.I am preparing for MBA and i have two interviews lined up and i think this my last chance.I literally don't know that what i am feeling is depression or not but i am finding it difficult to explain.I don't have any problems in my life which are rare for the guy of my age.Normal love matters, family issues, career issues.I think for the first time in my life i am feeling restless and can't help it.I think i don't know where is my life heading.I don't know where to start and i am like lost.I have friends, i have girls whom i flirt, i watch porn daily (things i used to love) , but i don't care about all of these things.I get irritated easily.I shout at my parents and then cry in my room silently.I have never opened up with someone like this, online.I feel empty inside like i don't know what i want to do..what gives my happiness.I get sad very easily which is rare for me bcz being an extrovert.I think people are ignoring me.Ignoring my health, ignoring my messages, the people who used to love me are moving on.Idk what can i do to let them know that i am sad and feeling so alone and lonely inside.My favorite football team just lost a match (Liverpool) and i am crying about it and its literally new thing for me.I have a big interview on 3rd march in Bhopal( 2 days left) and i am suffering from cold headache cough and fever.I am so deep down that i have to write an email to whoever it concerns.Thank you", "is_suicide": 0}, {"created": 1582969090.0, "author": "lindseyotts", "title": "Living on my own for the first time; best friends boyfriend makes me feel like shit constantly", "selftext": "I’ve been struggling with depression for about 5 years now, and this past year I finally reached a personal goal of moving out on my own for the first time at 26. My best friend and her boyfriend as well as one other guy are living with me, and that’s why I am able to afford to live here.Despite it helping me for a while I inevitably started struggling with the usual stuff again after a few months, and that’s when her boyfriend really started to show his colors in terms of what he thought of me.Her boyfriend is an extremely practical, very numbers-kind of guy, and also, according to the way he talks to me, never forgets anything or makes honest mistakes.I do understand that I need to be better about things, remember to do them on time and such, but the way he talks to me makes me almost not want to do them because I feel even less motivation or drive to get the fuck up and do them. It takes all of the VERY little energy I have and crushes it.Sometimes it even happens that I am doing a task and accomplishing something well for once and he messages telling me to do it NOW and it just undermines my whole feeling good that I’m out of bed, doing something and being healthy.He has,in the past,said things to me like:“The great lindsey manages to mess up again!”“How do you not remember to do this thing? Are you stupid?”“YOU FORGOT TO TAKE YOUR LAUNDRY OUT AGAIN???”*yes in all capsThis happens in a group chat that everyone sees.I’ve told my best friend how I feel and while she says she understands, she obviously sticks up for him a bit because she sleeps with him, spends every day with him, has feelings for him, etc.She chalks a lot of it up to his cultural background (he’s from India) and says that he’s just like that, but I often feel as if she dismisses the fact that I don’t even like being around him because I feel he despises me and thinks I’m a lazy idiot, despite knowing that I have mental health issues.A lot of the things have been more minor, too. Putting mail on the table instead of the mail basket he bought for us.Putting either too many or too little dishes in the dishwasher. (I still don’t know which I am guilty of, he’s said I do both all the time)Accidentally nudging the little handle on the bathtub once.Idk, maybe I am really a shitty person to live around and be with, but i feel like I’ve put more effort in the last year than I was before, with having real jobs and paying bills and such, but it’s still a daily struggle to even exist, and I just want to not wake up to someone berating me in all caps.", "is_suicide": 0}, {"created": 1582857651.0, "author": "BredCatXD", "title": "I cut down on meds few weeks ago", "selftext": "I have been seeing a psychiatrist for 3 years. My mom and I often take a journey (5 AM in the morning) by train of 3 hours to go to another town where the main hospital is located. The doctor fixes the day for us to visit him. It causes alot of physical and mental harassment since the trains are very crowded in India. Not only that, but we have to wait the entire day in line (in the hospital) just to see the psychiatrist. My mom never lets me stand in queue to get us registered for the appointments. Instead she does it herself. You won't believe but the lines are always long and the amount of patients that the psychiatrist sees in a day is crazy (maybe because it's a famous hospital around here). When I visited him, the psychiatrist prescribed me a anti-depressant named, BUPOZEN 150mg tablets. I have been eating this tablet religiously day and night like a stupid zombie for 3 years. My parents have always forced me to take it daily thinking there is something wrong with me. They aren't even aware that this tablet is a anti-depressant. The doctor never tells us about it. Just expects us to believe him and take the doses daily. I never skipped a day on the tablets thanks to my overly caring parents. It is very painful to take them though for it feels like I'm some kind of prisoner needing constant reminders from my parents to eat them.All these years, I've doubted if they ever made me feel better but I think I have lost my ability to think after I started taking them. I just couldn't think after taking them. He also had some medication named GPAM that he prescribed me early on when we first visited him in 2017 but later told me to stop taking it  after few months. Since then I have only been adviced to take the BUPOZEN tablets. I googled about this tablet one day to find what they were in 2018 because the psychiatrist never told us what they were and what they did even when I asked him. Later, I discovered they were anti-depressants on the internet. I wonder if I'm so mentally ill that that the doctor thinks I don't have to right to know about my medications (that I'm taking) or does he fear that i will stop taking them after I get to know about them? Many times I tried asking him what this tablet was or what it did to me. He always told me that they are meant to increase my concentration in studies. But I never found any increased levels of concentration with it. Instead I have avoided my studies all these years whether I took them or not. I strongly think that he lied.I even showed symptoms of schizophrenia and some degree of bipolar according to my psychiatrist.  Once, he was even forcing me to get admitted in the hospital at one of the appointments so he can monitor me closely and check for more mental illnesses. He told me that he would try giving me different medicines and observe my behaviour after I took them to find my illness. I didn't agree to it because mental asylums in India look like a haunted building with crazy people all around. They don't even have proper beds for the patients. The place didn't look so hygienic to me. Moreover, it was mandatory for one of my guardians to stay with me 24/7 while you are admitted there to make sure you  don't harm yourself or the others. They make your parents take responsibility by making them sign some papers before they admit you. All of this scared me and to be honest I saw one of the patient in that particular mental asylum whose body was all shaking like a ghost, like he was possessed by something. He was being interrogated by two doctors while his body was shaking badly. They didn't show any empathy towards him. So, I made some excuses telling the psychiatrist that I have exams to give in college which I did have. He got angry with me but had to accept the excuse.Now coming back to 2019. Few weeks ago, I fought with my mom over something and threatened her that I would stop taking the medications. She apologized and requested me to atleast take it once in a day and we agreed on that. I often threaten my parents when things don't go my way because they are over caring and make illogical decisions regarding my life. My life is literally rotting away and a part of me blames them. I think my condition has started getting worse after I cut down on the tablet. I only take it once now instead of twice a day. Should I have not cut down on the anti-depressants? I'm very sad and have started getting suicidal thoughts back. I cried few nights after I cut down on the meds because I was feeling worthless. I'm getting back suicidal thoughts and all the crazy things that I used to do before I started taking the meds. I'm very confused. Did I take the right decision cutting down on the meds without taking the permission of the doctor? What do you guys think I should do?", "is_suicide": 0}, {"created": 1582562692.0, "author": "munaf08", "title": "Wow wow woo cant believe am I dreaming please it shouldn't", "selftext": "Hey guys I am in 18 year old Indian who suffer from depression social anxiety ADHD (I don't know I have ADHD or not but I definitely have lack of concentration) got beaten by poverty I am also a college student and doing really shit job to for 8 hours to earn rs 300 (4$ maybe) per day support my family because my father dies when I was 5 year old and now you are thinking I am a boy with severe depression no friends (forget about girlfriends I suffer from anxiety even I stand near the girls) Never got good marks in school and now you will advice me to meet psychiatrist. But in India if you go to a psychiatrist people will call you idiot mad retarded and you know I am extremely sensitive to rejection due to all this shit in my life I decided to do a suicide but can't do that because my mother made a lot of sacrifices for me if I will die who will take care of them. But I can't tolerate depression and then I ask doctor Google to solve my problem initially I got really confused because there is lot of antidepressant but in end I decided to take fluoxetine modafinil and atomoxetine for my shit brain. In India you can get medication without prescription except drugs with abuse risk. just go and tell pharmacist you are in emergency.thats an only upside of living here. in the next morning I decided to take fluoxetine 60 mg modafinil 200 mg and atomoxetine 60 mg. Initially suffer from little anxiety but after an hour my anxiety gone my concentration increases like I am using full capacity of my brain. My angerness  and shamefulness totally gone.first time in my life I initiate conversation with my classmate after 2 hours I become so happy can't describe in words my friends asked me did you win a lottery I said I win happiness. They got confused my family see you change in me and my coworker they get shocked.hey i am not lying never experience this feeling before. but I am worried what will be the long term side effect of this medications but don't care about that it's better living in depression. I am really grateful towards inventors who invent or discover (I don't know) this medication. Oh sorry I take your lot of time please apologize me and for my bad English.", "is_suicide": 0}, {"created": 1582430870.0, "author": "perth1985", "title": "Homeopathy for Anxiety and Depression", "selftext": " Hello FolksI am just curious if any of the members have had success in using homeopathy for psychiatric illness.I have heard of many cases in India where patients were able to stop their medication or reduce it substantially using [homeopathy.](https://homeopathy.one/)One of the successful psychiatrist is Dr.Mahesh Gandhi,who left allopathy and became homeopath as he felt the medications were drugging his patients.It would be great to know about the experiences in the west.", "is_suicide": 0}, {"created": 1582401227.0, "author": "Sure-Walrus", "title": "WTF is going on?!", "selftext": "I've noticed myself being in a mental decline for some time now which seem to have accelerated rapidly recently. This seems to spiral out of control despite things on paper looking good.  I'm a male in mid 40's, have a wife, two teenage kids, steady and well above average paying job with a lot of freedom to set my own hours, routines and focus areas. I'm healthy and fit, not good looking but not ugly either, have a few long-time friends that I actively communicate with electronically and every few months we get together to hit the bars and shoot the shit. I live in a nice spacious house, have very manageable mortgage and leftover money for travel and stuff.Sounds great, right? Then why do I feel like shit and that this is a pointless struggle of a life that has seen it's apex and this decaying body and mind on it's way towards the inevitable nothingness. That I guess could sounds like an average middle age crisis that ppl I fix by buying a motorcycle or whatnot. I might just as well find my fix by killing myself to be done with the dark thoughts and existential crisis that seem to just get worse by the year.Don't take this as a suicide watch thingy, we're not there yet. But for the first time in my life last night I started evaluating that as one potential solution. I'm a long way from it as I feel a lot of responsibility not to cause misery for my family but since things escalated like this I thought it's time to do something which triggered me to write here.I'm a long time reddit lurker but never had an account until now. Guess that's kinda selfish to only contribute when in need of a community that might be going through similar thoughts. I could talk to my SO and friends about this but I don't want to be a drag. And once I voice out such deep shit there is no taking it back and I'm afraid of getting branded as that \"sad and depressed\" guy. Have shared some thoughts with my SO but as this kind of shit is not something she can relate to I don't want to get her concerned. And I do know my friends go through some deep shit every now and then, but prefer to keep our interaction as something fun instead of it turning into suicide / depression hotline.Thinking about the potential reasons that might drive this decline towards the abyss I have self-analyzed a few potential reasons and characteristics that might play a part:I am quite an introvert and the older I get the more social anxiety I seem to experience. I can do just fine in a social setting with colleagues and such and I think I could even be considered funny and good company. But that's a role I play that consumes a lot of energy and I would rather just mope out of the way. I seem to also have a tendency to over-analyze the perception others have of me and how my behavior and verbal output affects it. This makes interactions a chore I need to pay attention to and has kept me totally out of social media as it's all about keeping appearances.Secondly I drink and smoke weed on recurring basis. Have done so more or less since my mid 20's. I try to keep to weekends for the most part, but then I do get toasted (while keeping it under control in a sense that I'm still presentable in front of the family). I think this might have had a detrimental effect on my mental health and reinforce my social anxiety, but it's hard to quantify as this shit is not an exact science. But at the same time this combo has brought me such an amount of pure joy and the absence of the depression and existential crisis haunting in the background. And the thought of stopping it gives an outlook of a life so bland that might just not be worth living.Thirdly I'm a 'fake'. I have always found it hard to share what I 'truly feel or think' which probably comes from over-analyzing of others perception I mentioned earlier. I actually am not sure myself what I truly feel, think or want at this point. I'm not sure who the fuck I actually am. It's just noise of million things bouncing in my head. Have done some meditation to overcome this and get pretty decent experiences out of it, but for some reason I struggle to persist on that. I have used bunch psychedelics and MDMA back in my 20's and with that the fundamental self reflections, reconstruction and feelings of universal love are quite familiar. This seem to make meditation pretty easy with some help from waking up app and such. But still it's hard to stick to it. Maybe I'm afraid of discovering things I don't want to and finding myself in a cave somewhere in India with just a cane and rags on my back.Surprised if some one made it this far through this wall of text and what I to easily tend to characterize as a big man whining and first world problems. And interestingly enough it seems that suicide rates of well-of countries go up with age while in developed countries the trend is the other way around.Would be great to find people to reflect thoughts on this. Perhaps in this thread but also through private messages.Even as I am about to submit this I wonder what will people think.. LOL.. sad.", "is_suicide": 0}, {"created": 1582213313.0, "author": "helpmeorjustkillme", "title": "I beg you to read this , If you can't help just talk to me.", "selftext": "hi sir/madam please help me , I am 18 years old male from India. I am suffering from severe mental and physical illness . and there is literally no one I can complain about. i have exams from next week every other day , of maths , physics and chemistry .I haven' studied anything all his year , I tried a lot but I can't just concentrate and even I did I get severly mentallt tired in couple minute , no matter hom much I try . Biggest problem is my memory , I feel like  a 80 year old man with dementia . I have been diagnosed with bpd and ocd and they even gave me a anti depressant , but none of their medicine was working on me , so I left taking medicine which makes my father angry and he didn't take me to hospital againso here I am I don't have money, I have no skills , no friends , even no family I guess . I tried modafinil but that didn't even affect me lolpeople were saying how modafinil was helpful for them but for me it feels like nothing , I tried 100mg then 200mg then eaten 500mg but no effect on me .is there any advice you can give me , any trick to make me study . If I failed exam which I will my father is going to kick me out the house and last year I had failed the exam so this is my 2nd time in same class if i failed this time I am going to kill myself .Is there free forum where people could help me , i tried a lot to post on reddit but my adhd and anxiety stopped me . this is all i could write right now , my head is shaking my vision is shaking because of the force applied to write this message . also i was not a idiot , I was a lot intelligent then most people around me , that's why people expect a lot from me .only thing keeping me from killing myself is I don't wanna die cowardly or I don't want my mother to cry over my dead body . &amp;#x200B;so this is what  could rite for 2 hours of mental torture , peope think everythink is in my head but they didn't even know what i really suffering from.", "is_suicide": 0}, {"created": 1582016881.0, "author": "nonospott", "title": "Feeling overwhelming pressure and stress from Work lately!", "selftext": "I'm a 23 year old guy from India working in a well known MNC company as a product specialist.Well I'm kind of in a trap. I have been feeling too much stress and pressure from my work because of unrealistic quotas and overtimes. This Job pays above average and I can't get this kind of pay anywhere right now and I cannot continue working my current Job due to the stress. This has put me into depression, anxiety and I'm feeling no emotions at all lately. Moreover my family's (Me, My brother and my Mom) financial burden is on me, although I have an elder brother who works just as hard doesn't really get paid enough, so 80% of my family's finances are dependent on me. If I quit this Job or switch, we won't be able to pay our bills and debts. I'm in a trap and don't know how to get out, I don't know if I have a question, I'm just venting it out. There's literally no work life balance, My work is basically between life and death :( And I have my own personal problems to top it off.These days I just wanna give up and just do nothing for few days. But I can't afford it. I'm trapped!", "is_suicide": 0}, {"created": 1581598516.0, "author": "shi_no_o", "title": "I think I've hit emotional rock bottom", "selftext": "Hello everyone of this community. Been a long time lurker, first time poster.I would like to start by saying that I feel like I've been depressed for the last 5 years or so. Currently 20, hitting 21 in May. Honestly speaking, I don't even imagine reaching the year 2020. I'm not suicidal, just to let everyone know, though like almost everyone on Earth, I have had lots of suicidal thoughts. I have been just going through life on autopilot for the last few years, so anticipating the mere concept of a future has been far from my most recent thoughts.I feel so emotionally numb and yet also feel like I might break down crying every waking moment. Sleep, video games and junk food have been my drugs of choice for the past few years, so as you can imagine, I am not physically in great shape. Sorry to be going off on such a huge tangent, but I would like to give some background information about me.I live with my parents in the USA for about one year now. We immigrated from a third world country close to India. Grew up in an extremely religious Muslim background, though I am an atheist now as of 2 years ago. My parents do not know this, and to keep the peace, I go along with their requests regarding religion for the most part. Both of them have M.Sc in Psychology and yet do not understand the concept of depression properly. I have tried talking to them quite a few times about my current condition, but all they do is compare my upbringing to those of people in worse countries. Since coming here, most of my time is divided between going to classes and work, so I have had no time for social activities. Also, the social activities people partake in all over the US is forbidden in Islam, so essentially I am completely alienated from these kinds of activities. My mother is always worried that American influence will 'corrupt' me, so I have to stay away from most social occasions in general. I have no one to talk to, and no one to describe my state to. This subreddit is the closest thing I have ever had to bring able to relate my experiences. All of you people who comment on these posts to support people, I salute you. To me personally though, not trying to offend anyone here, it feels kind of patronising. What I am trying to say is that I am emotionally vacant and bordering on the side of insanity, though I do not take that lightly. I know I am in a great place of living, living a life far better than a lot of people around the world, and so it always feels like my problems are no big deal compared to other people.I have self-sabataged so much that it is not even funny. I am a huge failure in life, social, physically, mentally, academically as well as in being a good son. My parents work their asses off so that I can lead a good life, and yet all that goes through my head are my stupid small problems. I don't know what to do with myself anymore. Everytime I get motivated to be better, it is almost always immediately followed by a surge of demotivation from my mother's comments. I wanna be a good son and human being who is able to help people, and not an emotional b***h who can't do anything but whine. But, I just wanna be held in someone's arms and be told that it is ok to cry my heart out and that my problems are not dumb or miniscule. I think we all want that. Thank you to anyone for listening to my rant.", "is_suicide": 0}, {"created": 1580916105.0, "author": "MomentaryRelapse39", "title": "I might be depressed. Too broke to see a therapist. Dunno what to do.", "selftext": "Hi, I'm a 25 y/o guy from India.For the last 5-ish years now, I've suspected that I might be depressed. I am doing okay for the most part. I don't have any suicidal or self-harm thoughts. The thing I am most stressed about is the loss of control over my life. I feel like every so often, I spiral into a really bad place. It becomes really hard to get out of bed and do basically anything. Sometimes I stay in that bad place for weeks feeling helpless. And there's a voice inside my head that I've kind of... trained (??) to yell at me things like, \"GET UP!\", \"JUST GET OUT OF BED FOR ONCE!\", \"TAKE A BATH AND IT WILL BE 100% BETTER I SWEAR\", \"PLEASE JUST TAKE ANY ACTION... ANYTHING! BRUSH YOUR TEETH! RIGHT NOW!\"But even that has stopped working for the most part. I feel an immense loss of control over my actions and habits. I think I might be addicted to passive content consumption, porn and masturbation as well. Sometimes I set rules for myself like, \"I'll watch Netflix only on Sundays\" or \"I'll sleep by 11pm at all costs and wake up before 7am\", but after a while, I slip up and fail at those too. And there's a lot of such failures. I don't even know whether it's depression or something else. But whatever it is, it's affecting every sphere of my life. My health, my work, my social life, my self-confidence, everything.When things are going well for me and I'm in a good place mentally, I try to take screenshots in my mind and save the good moments. I keep hoping they will help me when the next bad phase hits, but they seldom do.After struggling with this for so long, I'm getting tired and I have no money to see a therapist. No idea how to deal with this. Please help.", "is_suicide": 0}, {"created": 1580832563.0, "author": "UnicornWithTits", "title": "[help me] Gave everything for an exam. Flunked it. I am jobless, aimless, I feel dead inside.", "selftext": "I gave everything for an exam. I didn't take any job after graduation, I decide to prepare and take a exam through which you can get job in some  government of India regulated sector . I gave everything. I changed my number. I left my friends. Studied 10hour+ everyday. Didn't party, didn't go out any day. Everything was going great and somehow I got nervous in the exam. Flunked it.Now I feel no will to live. I constantly think about suicide. I really don't wanna do it, I know I can do better. Fortunately my parents are very supporting, they didn't get angry but I can feel their disappointment , and they should be disappointed after all. This failure reminded of every failure I had in life. I took many exams, for University entraces, for jobs, and managed to flunk each one of them. I always regarded myself as good in studies, I  was one of the school toppers. I scored one of the highest marks in whole india in 10th grade. All my other topper friends are going well in life and here I am jobless. I didn't go to school reunion because I couldn't look them in the eye. I have good social skills, started one of the most active public speaking community, literally had thousands of contacts in my phone. Then I decided to focus on this exam and killed the community myself. Changed number. And here I am , flunked it.I am not jealous of anyone's success. I am just disappointed with myself. I wish I was never good in studies , I had never scored good in 10th grade, I would have never even thought of preparing for such exams and might have been doing some nice regular job. I wish I could just wake up from this sad dream. I feel like crying, screaming.", "is_suicide": 0}, {"created": 1580780567.0, "author": "BlopsHd", "title": "Never Give up! I won over my depression.", "selftext": "my name is af. Don't wanna disclose everything. I want to tell you a small story. I live in India. I study in India. I left my home country xxxxx Arxxx after completing high school. Then I joined computer science engineering. I love engineering. I love computers. Usually, I am a very outgoing kinda guy. you know the extrovert in the group. it was august 2019 when my 2nd year engineering results came in. I failed. I was detained for 1 year. and all my friends were gonna go away, I don't come from a very rich background. The higher middle class, my dad works in xxxx.  We live paycheck to paycheck. But I was happy. My mom is an angel of a woman. I love her more than anything in the world, I also have a little sister which I love. My family had gone through a lot of depression. anyways, We tried to live happily.  got admitted into a good college, Failed.  I was broken, I didn't sleep for months, I applied for re-evaluation for the papers. I used to look into the eyes of my mom. And used to cry every day, I never slept with peace. I was going to college but was just hanging around the cafe, I never went to class, people we were demotivating me, There were some of my friends who tried to help. But all things used to go apart everything. I was gonna have my mom's dream broken, I have to earn money. I have to keep her happy.  October 19, 2019, my results came in I passed!  I was crying and laughing at the same time. you know that scene from ford v Ferrari when henry ford 2nd cries and laughs at the same time when he sits in the ford gt. I wasn't talking to anyone for hours I was not stopping I was crying and laughing. My mom and sis cried with me they didn't even know why I was crying. when I told she broke. she hugged me. told me why I didn't tell her. I said I didn't want to disappoint her. I love you mom, I love you, sis and dad. this semester I had an idea of a product for a hackathon(competition) statewide. I and my team worked hard. and we won. Now I am working with Microsoft and state traffic control, participating in a nationwide competition. My mom was proud of me.  I am not an engineering kinda guy. I love solving stuff. I love building stuff.  You know what I am joking. I love engineering. I hate my board of education. rant aside. My motive was to help my fellow people of planet earth. Don't feel alone, Pain is temporary. never give up.", "is_suicide": 0}, {"created": 1580206410.0, "author": "sillypeeds", "title": "I am going to die", "selftext": "Hi, Its my first time posting here and prolly the last timeI been going to depression since the last 7 years when my dad died due to heart problems. I tried many ways to get help, talked to my parents, my school counselor (I am 16), talked to my friends but its of no help.4 years ago I moved to the US from India. Naturally people think that indians are smarter than americans but I am the complete opposite, I averaged around 60-70 percent on my grades which was really bad for my family. I thought it was ok since I am at-least passing my classes but this semester I have failed 3/4 classes because of anxiety and stress. I tried explaining this to my mom but she thinks its an excuse and everyone thinks I am a failure. I dont know what to do with my life no more, I am going to end it all, I cant take this shit no more. I am sorry mom, I love you and I am going to miss you", "is_suicide": 0}, {"created": 1580148436.0, "author": "yttrerymden2020", "title": "How can I forgive myself for losing the love of my life due to depression?", "selftext": "Met the girl of my life 3,5 years ago. She's from another country and in that culture men don't show weakness and talk about feelings. This girl is not like the vast majority of women there (because she simply doesn't like these old gender roles) and even said to me early that she love that I am a guy who can show emotions, cry if I have to and not as most guys who try to be macho. But of course her being raised in this culture, even though she doesn't like this cut off emotions/play tough attitude that's how she's borned and raised.I have been suffering from recurring depressions since I was young (now almost 40). Tried all kinds of medications and therapy but nothing has really helped. My previous girlfriend wanted me to talk about how I feel so I'm used to that, but still doing it on this level I've done I will never ever do if I fall into depression again. A problem is that the depressions has led me into severe self hate, and I read out old conversations and it was painful to see how pathetic I acted. Even the smallest things I reacted to like the world was going under. I told her how my life sucks, how I am bad in this and that way. Really stupid and the last thing you should tell your girlfriend, especially early in the relationship.She had never experienced depression and because she had a tough childhood in a poor country I can really understand how pathetic this must have looked. Anyway, my dream is a house on the countryside and I had the chance of my life with this girl. She wanted to move with me to a house and I found a dream house for a very good price. But my fear and doubts made me hesitate and when I finally made a bid it was too late. She later changed her mind and wanted to stay in the city were we live but later I got a second chance because she was up for it again. But I was too picky with house after missing out the dream house and she got fed up with this.Things went worse and worse, I got on sick leave by the time she moved to me. She is super social and positive and this is exactly the kind of girl I want, and especially her. But my negativity, criticism and judgemental behavour made her move further and further away from me. I was never bad to her but depression can get you self absorbed so I overlook her needs and didn't do the things I should. I am a very kind and caring person otherwize (many even say that I'm too kind), but again the depression made me self centered. I only visited her home country once, I didn't help her out that much as I should with learning my language and other things. She didn't know people (obviously) when she moved here and even though we did a lot of things like travel, partying, creative things etc I understand she was feeling alone. Now she has a circle of friends through her job.She did bad things too, like going behind my back, ignoring/rejecting me a lot. She's not a talker and I think she suffers from some problems herself (she can cut off her emotions completely, she has a huge fear of abandonment etc). It was very hard to talk about issues because she basically always saw it as me \"fighting\" even though I was calm and just tried to solve things. She had trouble with understanding why I didn't want to join on all these parties - because when I did I was always social. She called me insecure for not wanting to join and that made me feel insecure and it came to a point when I isolated myself, even at work.Otherwize I am actually a confident as a person. I have mental strength from coping with depressions for so long but overworking just made me fall into the rabbit whole before I could see it coming and stop it. Before I was suffering from severe OCD but I beat it myself with mindfulness and exposure. I am not scared of exposure and always want to improve myself and get better and better.8 months I got diagnosed with ADD which was the reason for depressions and anxiety all the time - hence no other medication worked. I have become better and better - more and more social. But it was too late. A lot of trust issues led to this led to that. And she broke up 2 days before Christmas after me talking her into trying again 3 times during 1,5 month when she said it was no idea because it won't work. We're fine now but it's hard to see her date guys while we still are living under the same roof (only for one more week though).But, she told me that if I only got that house all had been different. If I only had proposed to her. If I only this and that. I was angry at her for some time because how cold hearted she acted post breakup but when I read our old conversations I understand how difficult it must have been for her. And reading her messages when SHE was the one that really pushed us into buying that house (which today I regret I didn't do and can't help but continue dwelling) is painful. I won't do it again but cannot forgive myself that I did it. That I lost the chance of my life to be with this amazing, loving and worry free girl.Also before the breakup I booked an appointment for couple therapy. I hoped that she could get perspective and see her faults too, and see that we actually could fix this. Unfortunately the session was very unfair. It was mostly about my depression and it all made it sound like we were so different persons and she believed it so much that she told me after coming out from the building: \"Thank you for taking me here. Now I know I made the right decision!\". And she wasn't angry at me or anything, she just said it because she was happy to \"finally understand it.\" She even told her workmates this and I hate that I took her there because again it was unfair. I am not the person I used to be, I have changed to much and continue to do so day by day even though it's hard as hell all this.And the thing is when I am not depressed (and now after I got the right medication) we are a super great couple. We are like soul mates and we said it before. And now I am even more a person that fits even better with her than before, but I know she only thinks of the bad times because it makes it easier for her to move on. Fuck, it's hard. I even remember her telling me that she told her mom when meeting me that \"this is the man I am going to marry\". And that night we kissed and continued to say \"I love you, I love you\" to each other the whole night while looking in each other's eyes. It's so hard to think about this, it's true pain.I have changed a lot and she told me that too. Since I got the medication for ADD I haven't been depressed a single second and no pathetic things like how I hate myself, how I suck, how I have no friends (shit, can't believe I sad/wrote this). I have become more worry free thanks to her but there are still a lot to work on and I will become the best I can be. I will go on a trip to India for a month now to expose myself for my fears and become even more worry free (trust me, it's not because I want her back - I want to become more like that for myself). The thing is that she's into law of attraction, meditation, yoga and so on. I have been into meditation and mindfulness a lot before and like these things and will now try to dive even deeper into it. But it' hard with this trip because being honest. The reason I first decided to do it is to prove to her that I am independent and can follow through something like this, not just being something I say I will do. And the reason I choose India was partly also because it's her dream country and I wanted to impress her I think (being in love make you do crazy stuff).aI know the probabilities that we get back together is low even though we said only a couple of days ago that we will see later on. She said that maybe we can start dating again in the future and in that case just skip the past and start all over. But I can't stop dwelling the past, how I lost this chance. How I could be so stupid, scared of change. How I couldn't see what I had.How do I forgive myself for loosing this one in a million girl? How to I stop dwelling? I really need help.Thank you &lt;3", "is_suicide": 0}, {"created": 1580089160.0, "author": "NuttyMcNutbag", "title": "Corner turned.", "selftext": "Just spent a month in India. I went initially for a friend's wedding and decided to stay for a bit. I learned a lot there. In particular I rediscovered the importance of company, family and friendship. Upon returning, for the first time in years, I reconnected with my friends, get up early, exercise, my mind is clear and I don't face the day with dread or shame. I feel hope again.", "is_suicide": 0}, {"created": 1579976471.0, "author": "chikinimo", "title": "Anytime there is a world ending calamity i am really very happy.", "selftext": "This new Coronavirus has me super exicted and feel like a rush holy shit finally the world is ending hell yeah fi fucking nally it ends. It's only disappointing to know sadly everything will be the same.Before there was a virus in my country india from bats called nipah i even wanted to go to the state but could not drag my pathetic ass.End of the world is soothing and calming thinking about dying even suicide sends butterflies through my stomach.I don't take joy in wars,torture or plane crashes i hate that they happen but natural disasters or things like killer virus wiping out 95% humanity sounds crazy energtic although the thought of getting nuked isn't all that bad.As soon as my family approaches me it back to yelling and screaming about how i fucked up how i will be homeless begging  and blah blah honestly world end is nice compared to that.End of my miserable life is so calming it's like extreme excitment not exactly the healthiest thougts to have but nobody cares.", "is_suicide": 0}, {"created": 1579633921.0, "author": "gtx_titanv", "title": "I'm depressed and losing hope", "selftext": "Hi everyone! I'm 21 year old middle class guy, from India I'm very tensed about my career and future life I'm still in 12th class,i failed alot in my life i repeat 9th 2 times, 10th 2 time, I'm doing my 12th from NIOS, I've no friends to share my thoughts thats why I'm here and i upload designs, vfx and 3d stuff on ig and I'm still using 8 year old office desktop for it and i can't offord to buy new desktop because I'm not earning a single penny, I'm really depressed now, i have no clue what to do with my life. My parents have hopes from me that I'll buy a house for us and sometimes they say I'm useless, I'm disappointment, I'm burden on my parents, i cry whenever i think about my career and future life. Sometimes i got suicidal thoughts but then i think about my parents, please help me what should I do with my life?", "is_suicide": 0}, {"created": 1579570387.0, "author": "spiritual_soul", "title": "My condition before results every time.", "selftext": "The sem 5 results have released. I have no courage to see my result, as always. Not even once since I came to this college, my result has not left me broken from inside. I spend days, weeks and months every time the result releases, to accept it and try to analyse my mistake and motivate myself to do better next time. Because I can still make up for it. But can I?For the semester 4 exams, I was determined to do my best. I decided that this is going to be my final attempt in trying to do well in exams. Because this time I was performing to win. I was even enjoying the subjects. But what did I get? only passing marks. I was left shattered, broken and wanted to give everything up and live the rest of my life in anonymity. But giving up on anything is never an option. I wish it could be. But we always have to finish if we have decided to do something. So I still had to face the next exams. I was under depression by then. It's been over 2 months. And I still am. I  tried to get better. But I can't. Because I can't get rid of the root. A  part of thinks that I am giving an excuse to myself, just to get a  break in life. But the rest of me knows the reason. I haven't been able to achieve anything in these five semesters. I consider myself a loser. I  have wasted lakhs of my parent's money. I don't want to tell them this because I don't want them to react by pitying me or because they care about my mental health. I can get better only when I can make them proud at least once.It's not that I don't like what I'm doing. I love it.  But the exam pressure doesn't let me enjoy. It evaluates me on how much  I can recall and on how big answers can I write within the given time constraint. I want to ask India, \"Is this the right way to judge a  future engineer? By seeing how much they can reproduce under pressure?\".", "is_suicide": 0}, {"created": 1579315765.0, "author": "pnaisuls", "title": "Im new to this please dont mind.", "selftext": "&amp;#x200B;**You:** wait**Stranger:** ???**You:** im in depression**Stranger:** oh why**You:** dont say anything**You:** just let me vent**You:** if you have the timw**Stranger:** go ahead**You:** jee mains is like the make or break exam in india**You:** either you get a rank anf go to a really good college**You:** or you fuck up and enter a viscious cycle**You:** bad college**You:** bad job**You:** and an entirely fuckall**You:** life**You:** and ive made a glorious entrance into the latter**You:** now.**You:** im 17**You:** i literally ahve one friend in school**You:** my class has all the studious people of my school**You:** i try my best to talk to them**You:** they NEVER respond**You:** so**You:** i have to study well to be worthy for them**You:** but i need friends to keep focus**You:** im totally fucked**You:** it wasnt always like this**You:** till grade 8. i had really good friends**You:** i was quite intelligent and smart for my age.**You:** i had interest in astronomy and all the other geeeky shit.**You:** highly advanced for my age**You:** i really dont know what happend**You:** since them ny grades have deteriorated**You:** my friends changed schools**You:** and my parents being the orthodox south indians,**You:** made me focus on getting my grades fixed**You:** no dont get me wrong**You:** my parents are the nicest bunch of people ever**You:** they were always supportive**You:** they tried their bbest to provide everything i needed and most of what i wanted**You:** but i subconsiously feel that ive letthem down completely**You:** thats all**Stranger:** oh thats long**You:** thanks a lot for listening**Stranger:** well its the same here in singapore**Stranger:** i hope you feel better**Stranger:** :)  cheers**Stranger has disconnected.**&amp;#x200B;&amp;#x200B;**ps- thanks a lot to the person on the other end for listening. i never got your name but i pray for your well being, health and happiness. bless you**", "is_suicide": 0}, {"created": 1578713327.0, "author": "krvstoff", "title": "I'M 18 AND I THINK I'M BATTLING DEPRESSION", "selftext": "Hey, I'm an 18 year old boy from India... I don't know if I have depression, because i don't know how depressed people act or feel like... I'm in my final year of high school and i have no motivation to study, I don't feel comfortable at home when my Dad is around because he always finds someway or another to scold me and i always feel terrible about it, and i also can't stand it when he scold my brothers or my mom, it makes me angry and frustrated... Don't get me wrong my father isn't a bad person, he loves me and his family, he even is a servant of the church but when he scolds me my feelings get hurt like hell and i can't function properly... I'm afraid if this keeps going on i might self-pity myself more and more and might lead to suicide... My family checks every box in an Emotional Abuse article i read but i can't say anything to them because I'm afraid my Dad will judge meNo one asks me if im good even though i know i look miserable and i also think i have ADD because i find it very difficult to memorise very short notes and can't focus on one thing for a long time.... I told my Mom once but she said that i shouldn't look at it like a problem and left it thereI'm a very emotional person and I can't hold back my tears when people scold me, my Dad seeing this bullies me and calls me unmanly or soft, but i literally can't stop my tears from falling, i want to see what his words do to me and make him realise the wrongs he is doing, i love him and i am very proud that he's my father.... I really don't want him to be the cause of my deathI don't know if this is depression or not but I just wanted to share what I'm going through, my Dad is taking my phone away tomorrow and i don't know how I'll survive without the one good thing in my life... The Internet Community", "is_suicide": 0}, {"created": 1578708414.0, "author": "bondmemebond", "title": "School doesn't help", "selftext": "I'm a teenager from India but I live in the U.A.E. The pressures of school and my family broke me apart and eventually I broke down, crying. I wish that my life was more streamlined and hopefully  will eventually let my true feelings pour out. I have social anxiety and anger management issues in the sense that I held in so much anger throughout my life. I may say that I don't have depression and hide it behind a mask but what would that shit do ? I need to release all out somewhere and this was the perfect place. I hope that the pressures of high school will not get to my head and make me explode. The teachers in my school do nothing except for two of them. I really need help but it's not that i would commit suicide or anything but I have a feeling of emptiness inside. I need someone to listen to me...", "is_suicide": 0}, {"created": 1578680026.0, "author": "manthisisshit", "title": "Need advice of letting go - of how to stop dwelling and all these \"what if's\"", "selftext": "I am a man who have suffered from depression since I was 16 years old, maybe earlier. I am now 38 years old and 1 year ago after mental breakdown due to stress they finally took my case seriously. I've tried all medications in the book; SSRI/SNRI/TCA etc. Nothing really helped, and these depressive episodes has really fucked up my life in so many ways.Friends that got tired of me, missing out on stuff and broken relationships. The last one broke up with me 3 weeks ago after 3 years. We had a LDR for 1,5 years before she sold here apartment in her home country and moved to me. She is the opposite and has no problem of letting go, making decisions, dealing with possible bad outcomes from them. She is a genuine happy and positive person.We had a sessions today with a couple therapist and everthing was so clear. The reason for the relationship with this wonderful lovely woman broke apart because of my damn depressions. I hate them and they made me loose this gem. After finding out that it was actually ADD I suffered from I got ADD medication (amphetamines) and since then life has changed a lot. It took me maybe 6 months to really adapt, but my now ex girlfriends positive mindset and this medication has changed me to become so much better.However the depressions has shaped me in many ways, and even if I'm not depressed anymore the mindset of the depressed me is still there. The dwellings, the doubts, the fears, the \"what if's\". It was so obvious today at the meeting and especially after. I can't stop blaming myself for letting this happen. My dream is a house on the country side and I even bought a house but changed my mind in the last second, lost 15.000$. I should just have gotten that damn house and I would have lived there now with this wonderful girl.I hate who I was and even if I'm not the same person I can't help feeling pathetic because I was like that. Afraid of everything. And I need to be able to let go. Let go of what has been and start moving forward without looking back. I HAVE to stop the dwellings, they are haunting me. I close my eyes and see this house and us living there, every fucking day. I dream about it and I can't distract me from it. It's was the same with my ex girlfriend, in that case not have the guts to get kids with her. Now, I am happy that didn't happen because we were not a good couple. But that's also the thing, it took me 4 years (out of 10 years together) to finally realize we were not a good couple. Even so I dwelled afterwards for such a long time.I get stuck in my fantasy world and even if the medication helps it doesn't help enough. Nor do therapy or anything else. I have tried mindfulness and it helped me with anxiety, but not with this. And I am serious now, if this won't stop I will kill myself sooner or later.I will leave now for a solo trip to India. I wanted to show my ex that I am capable of making spontanous desicions and be an independent guy (travel alone). India is the country she's always wanted to go to and I think that's one of the reasons I choose that. Now I feel terrible due to the breakup and I really don't wanna go, but I will do it. 4 weeks from now and be away for a month.But I need to change, fundamentally. I have a potential that is masked by all these emotions and fantasies that won't stop. Please, any advice whatever it may be and I will listen.Blessings.", "is_suicide": 0}, {"created": 1578157391.0, "author": "nacquest", "title": "How's it like watching movies on depression?", "selftext": "The other day my partner and I wanted to watch the Irishman at home and we started it a little late in the evening. I started watching enthusiastically but got distracted midway with a battle with mosquitoes that were waging a war (yup, urban Hyderabad, India) and I didn't catch some parts in the movie. We only got through half as it got quite late with food orders (we'd not had dinner and he was hungry), eating. He doesn't like watching movies with interruptions. He told me if he had known I was going to be so disinterested, he'd have watched it alone.How's it like watching movies on depression? I've been diagnosed with severe depression. Anyone have such experiences where you're not fully into it even though you want to be?Edit: Added the 'he was hungry' bit.", "is_suicide": 0}, {"created": 1578083170.0, "author": "firealpaca11", "title": "No meds are working for me. What the hell is wrong with me?", "selftext": "I'm from India and I've tried all kind of anti-depressants and none of them helped me. They all caused side effects like insomnia, headaches , anxiety. I took each of them over a period of one month. Things only got worse. It's been two years since I started seeing psychiatrists and I'm on my fourth one now. I feel hopeless. I don't know what to do.", "is_suicide": 0}, {"created": 1577879653.0, "author": "FenderES6137", "title": "Have you ever \"been the change you want to see in the world\"?", "selftext": "Hello, you might be aware of the quote I am referencing. Its a quote by Mahatma Ghandi of India, a beautiful nation with a rich culture (though I've never been)   I'm curios if anyone here has done anything that would be considered weird/against the norms of society /not advised for the reason they felt it was the right thing to do and if so how it turned out. Have you ever been completely honest with someone and dropped all the bullshit? I think it's happened to me a couple of times in my life where I've really expressed how I felt.  I'm interested if anyone has any stories", "is_suicide": 0}, {"created": 1577484648.0, "author": "LightningShiva1", "title": "Please help me.", "selftext": "OK, first off I don't speak English that well. So sorry if anyone feels disgusted at my language.Iam an Indian, we have an examination called JEE Mains, every student who has finished his 12th class (engineering), must write it. Being an Asian my parents had high hopes on me, because society here is entirely different. People value you by your marks, literally everyone asks about your rank.So let me just tell you about JEE MAINS real quick : Over 1.2 Million people write it every year. You can get into prestigious college's through these examinations. The people who get below 10,000 ranks can opt for which ever course they want in any college (National Level). (And yes it's a highly competitive exam). The people who get above 89 percentile of the average score, can be qualified to the next level. It's JEE ADVANCED, about 250,000 people qualify for this exam, and people who get a rank below 5000 in this exam can go to the top most colleges in India.There are 75 questions, in which 60 questions contain negative marking (meaning if you choose a wrong option, your final score will be reduced), and the other 15 questions are integer based. The answer can range from [-99.99 to +99.99].   I have this exam in 10 days from now. Many people prepare for this exam from their 6th grade. (trust me they go through hell everyday) So when they reach this stage they are a little bit different from every one.These ranks define what you are \"in India\".  Nothing else, society here is soo interested in their neighbours kids ranks because now they can laugh at us. You either get a good rank or you spoil your life. That's it. My mom and dad, pay money for my studies, and I feel like I'm not doing justice to them.I know that all my relatives will laugh at me, they discuss about how bad Iam in their homes (100% real). It's like reducing your parents self-esteem, to literal zero.Iam upto no good in this competition, and I feel like I can't do it. (2 years of information in 10 days is not possible). I don't want people saying \"you can still do it stay positive\". Let me tell you it's not possible. No no. I'm just asking for help because I feel like I might kill my self for this stuff.Yes, many students commit suicide for not getting ranks, about 12 people from every state, every year commit suicide due to this exam.Please help meIam not accusing my country, but Iam just reflecting my thoughts on Indian Education System.  That's why I always wanted to live in foreign countries, because atleast there society will appreciate my presence.", "is_suicide": 0}, {"created": 1577407175.0, "author": "bit_-curious", "title": "Everyday I don't want to get out of bed. But I have to...", "selftext": "I am 18 and I get the same feeling everyday for past 2 years. I can't get up. But when you live in india, ur parents just wants you to wake up and study. Oh, I can't even focus. I just feel so weird and numb. I feel like cutting, but I wear all short clothes .I can't afford a doctor or a therapist.I can't talk with my parents about it! I feel lonely, I just wanna give up. But then I think about how I will hurt my family.Do i have depression?", "is_suicide": 0}, {"created": 1577242048.0, "author": "abcdef32", "title": "I'm the bad guy. Help me.", "selftext": "How do you express your sadness?I had a girlfriend, she dumped me and moved to another country. I had an older friend, she stopped talking to me because I called her when I was suicidal.I'm the bad guy. I went to these people with my depression and with my suicide... And with my *TWISTED* mind... And I just hurt them. They became hollow. Not overall, but for me as in, in front of me, they became hollow.I killed them. And they killed me.And everyone says I blame needlessly.And I just feel like I'm crazy like Arthur in Joker. I feel like I'm him... Waiting before my show, with a gun in hand, joking about suicide.But I mean it. I do wanna die. I am unhinged. But at the same time, I know I want to live.I know if I had a friend, a real life friend, I'd share so much... But my sharing is not welcome. My mom says... People don't like to hear bad things.And I keep thinking that she's wrong, that people are not so cruel... But, these days, I'm on the last thread.And no, I'm not in need of suicide watch... I want to live. I want to be happy.But I have no one. I need someone to be happy. I need friends. I need support groups. I need support.My psychiatrist does not keep my medical history private... Or I'm paranoid. My psychologist says I should just hide &amp; bury my sexuality till I move to another country. My parents just say the same line \"just be happy\" over and over.My friends are either too scared of me... Or they are so... Dried up... Because of me.I don't have new friends.India does not have \"AA\" type of meetings... Or I would go. In my city, depression is a taboo. Suicide is a hush hush word.I'm alone. I'm a noticeable person where if they find out \"u/abcdef32 is suicidal AGAIN\" they'll gossip the hell out of it.My ex taunts me. She embarrasses me and shames me. My ears are red just typing this.And if she reads this now, she'll say \"you're always complaining, BE HAPPY\".And I can't be happy. I can't complain apparently. Reddit... Any social media... Is too anxiety inducing for me. I can't find MEDICAL help... I called a suicide helpline for my country, just to see if it could help... And it actually made things worse. I lost the only friend I had made. And my ex keeps playing with my heart.And I just don't know what to do.I want to cut, I want to drink floor cleaner, I want to go to the 10th floor and jump... But if I live through the night, I'll regret it all. Rinse and repeat each night.I want to find a support group but I'm genuinely sure that you can't have those in Gujarat.I'm actually alone.And I don't know how to express my sadness. I don't know how to let it out except by getting angry at myself.And I just want to hit myself, punch and slap.I don't know why I'm so fragile... Somehow I'm broken and cellotaped and broken again.Help me. Give me ideas... Ideas to take out... Express... Show.. Whatever... My sadness.", "is_suicide": 0}, {"created": 1576670402.0, "author": "confusing_rants", "title": "Help, I have no interests", "selftext": "I’m 19. I have no interests. I can’t pay attention to anything. I can’t fall in love for more than a few seconds and then I get distracted. I just surf the internet all day. I can’t even have fun with friends anymore, I’m so distracted and depressed. I have no friends, I’ve pushed them all away. I haven’t hung out with friends in 2-3 years. I can’t read books, or watch movies or TV shows, or play games. All I do is surf the internet and watch the first 1-3 minutes of a youtube video then switch to another one, or maybe I’ll have a thought and google it, like, what’s bigger, India or Canada, why do kangaroos have pouches, what animals are native to America, what is inside of black holes, what chemicals in your brain are responsible for each feeling, why are white people white, how did asians evolve their eyes, was mars ever suitable for life, will Trump be impeached, the history of the democratic and republican party, Elon Musk biography, what is the average penis size, how do giraffes have sex?I am diagnosed with ADHD, and I’ve tried three different stimulant medications, all make me really depressed and anxious and irritable. I’m in college, but I’m going to start failing soon, I know it. I’m fucked. I can’t do anything. I’m unloveable and unprofessional and unmotivated and unfit. Honestly all I want to do is have sex, but that’s pathetic and selfish. Fuck I hate myself. This is why I want to die.", "is_suicide": 0}, {"created": 1576622587.0, "author": "n7ikhil12", "title": "Delhi / help", "selftext": "I am 22 y old engineering graduate  preparing for some job good with girls, have good friends , had good childhood my father was in army , mom works in a hospital I have always been average in my studies I was/ am creative child,  i have this mild ADHD and  i stutter through out my school life and in college life too , my school children used to laugh on me and teachers were also like that \" he is crazy \" , he is like this only . My father used to beat me like every other Indian middle class family  father in India ( by this i don't mean he is not a good father figure ) { he is a hell of man , waking us up , do the brush , go to school a good companion through out , atleast to my sister } My mom is a loving mom like every other mom but I still think she is the best Problem is a Cocktail of my bad school life + (adhd) maybe I don't count it as one+ stuttering +  super low self esteem +           My father wanted a comptent son  maybe I remember those old days and even now he like \" fucking do something \" , \"food is not for free '\"Nothing is free \" , \"you fucking looser \",  \"look at ya sister \"\"You not gonna do anything looser \"  and when I do something wrong like house work or chore or anything way he looks at me with disgust  with those eyes and how useless I am,.   even today he lost his phone like and    All these ended a low self esteem in me, so low if he hit me I let him hit me I don't even defence or anything  when he hits me whole body feels ghoosebumps and those chills is spine I punish myslef sitting in rooms without fan  sleeping without fan on the floor , that I don't deserve the bed too I don't deserve anything I have slept on slippers, licked the floor and even licked the sleepers just to tell me I don't deserve anything even when I am writing this my nipples are hard and I am feeling cold , I kinda enjoy this feeling , have cried whole night begging to die a painful death ,Super painful death dieng of starvation or dieng on a railway track I have such a low self esteem I want to be beggar ( I will even let people hit me , throw stones at me whatever they want  I have. Such a low self esteem I can even eat shit like real poop when I have those 3 degree chills in spineI imitate like retarded children of those movie try walking like them smiling and laughing like them I don't even ask like buy me this or buy me that or this I want , that I want because I don't thing I am.worthy of anything on the other hand my sister she asks for anything and she get that too , there is no discriminatory behavior with her or me  I don't ask for anything just beacuse I don't think I am worthy and what my father will say this asshole don't do shit and asking for this and that , which I know he don't think that way I am turning into a mechonist maybe this is the one side I HAVENT EVEN SEEN LIKE MY FATHER FOR MORE THAN 24 HOURS ON AVERAGE OF 365 DAYS IN THE YEAR OF 2019 Other side :-I show my anger on things trying twisting them once I get irritated I started hitting things not to larger degree but yeah Kicking doors slamming windows grinding teeth I will get the job in a year or two then I am gonna show my dad his place , kicking him aur like verbally harassing him ridiculing him.P.S - I MASTERBATE A LOT , NO LIFE ROUTINE", "is_suicide": 0}, {"created": 1576479296.0, "author": "KirannBhavaraju", "title": "My Girlfriend broke up with me, the worst part, i understand why.", "selftext": "I am my ex girlfriend now have been in a relationship for 3 years, now. we had been talking less lately, me being in Germany and she being in India. i work two jobs and i am trying my level best to make ends meet and clear off my student debt. Well, long story short, Today in the morning we texted and it was the general sarcastic, passive aggressive take on every thing we spoke and suddenly she said that she didn't love me anymore.  She said she would hurt me being in this relationship because she would not be able to give her 100 percent and couldn't believe in the concept of love anymore.  She also said she was thinking of discussing this with me and tried finding faults in me for the past month or so, but she couldn't find any reason for breaking up. Today she thought it was better to tell me the truth that was bothering her for so long.She was my first love, we graduated college together and had all our firsts.  My brain understands what's happened but the person inside me refuses to believe. I am extremely depressed and all of the sad songs i used to hear make way more sense to me now. I don't want to fuck up my career too... but i think if i keep being this depressed i definately would. Can somebody help.  Opinions on how i can overcome... similar experiences maybe.?😶I really loved her. and i can't breathe when i think of our times together. i feel someone's sitting on my chest. I can't eat. I am 25 and she's 24.", "is_suicide": 0}, {"created": 1576249300.0, "author": "Jaithra_Eswari", "title": "Don't know what to do with my life", "selftext": "I am a student from India studying in 12th grade who is struggling with studies and getting depressed often because of it .I have been depressed ever since I moved from Saudi Arabia after completing my 10th grade .I have my finals coming up in a few months and it's the marks that decides my future,get low marks you are done for,get 90% above and ur life is gonna be good but it's really hard to get that kind of marks for someone like me .Everytime I get motivated to study in a few days the school does something that just completely ruins my mind and I get depressed and start crying .I am not getting good marks so I am often called for special classes which means that I have to stay after school and study and that just hurts me so much I feel like a loser sitting in school while my friends are at home .I have not liked this school and it's much different compared to my school in Saudi Arabia .I have often thought of suicide which makes me cry a lot when I think of it and that if I killed my self I would make everyone I know extremely sad or depressed .It's that thing that keeps me alive that I have people who still care about me even though I am not the closest friend to them .My parents do everything for me they buy anything that I ask for and I feel like I am not doing a favour in getting good marks for the things they do for me which most of the parents don't do for the child .So I am in this state of mind of not knowing what to do right now.Sorry for making this post really long.", "is_suicide": 0}, {"created": 1576042968.0, "author": "user029833747732", "title": "Why does it feel like I'm trying to feel lonely and sad just for attention?", "selftext": "It all started to go downhill since a few years back when I shifted back to India. I was 10 back then. I had no friends, and the fact that everything was so different didn't help. A couple of people befriended me along the way. I hardly stepped out at all, and being socially awkward, I never made good friends or approached anyone. Heck, the first time I actually had a proper conversation with a girl was when I reached high school. I was clinging on to my only friend at the time, not realising how toxic he was. A few years passed. In grade 11(I was 16) of school, I changed my stream and got shifted into a class with all girls, with just a handful other boys except me.It was the first time I stepped out of my comfort zone, and made a handful of close friends, most of which were girls. Two years have passed since, and it's almost the end of my school life. A lot happened in these two years. I lost all motivation and had breakdowns every night. My grades fell to the lowest, and I failed in every test. My parents were worried sick. I had friends but I never talked. Only listened.I don't know why I wrote all that,sorry.I feel empty and down every day and always make these scenarios in my head where I try to gain attention by taking drastic measures. I just want people to know how I'm feeling, but now in doubting my own thoughts. Am I making myself sad and secluded just for attention? It seems that all I want is a friend to comfort and hug me as I weep.It's almost 3:00am now and I have an exam tomorrow, for which I haven't studied one bit.I know I have lost all drive, but I think that I dumped myself here just so that people notice me. But no one has noticed me yet. Sorry for the rant, I'll probably delete this post as soon as I feel better. I would love it if someone would comment.(Ah why does it seem like I'm just trying to get attention again?)", "is_suicide": 0}, {"created": 1575997025.0, "author": "curiouspupil", "title": "I am not sure if I am depressed/normal or whether I need to change myself", "selftext": " Hi,I am an introvert. I live in south India, where extroversion is valued and introversion is treated almost as mental illness. This is actually not a big problem for me, I can fake extroversion and just blend in to some extent. But lately I have been feeling depressed/sad, this gets worse after attending family functions or events where there are lot of people I know around, interestingly it is not a problem at all if I am around people I don't know at all. I guess I am kinda comparing ,measuring up myself with the rest. I am the kinda person who thinks and advocates to not compare with others, because it gets you nowhere. It's easy to think and be like that for a day or two or maybe a month, but I guess, in the longer run, it is hard to actually implement it. The biggest problem is that I find that I am very different from the world around me, not just because of introversion, but a lot of other reasons too. I like a simple life(i am not being dramatic :), I really do and prefer it that way), just a home, food, clothes and whatever little pleasure I like. But the world around me is not so and as I interact with it (especially people I know), for longer durations, I kind of get depressed/sad, I guess it is because - as you become an adult (I am male 29 now), you would be expected to meet some expectations (i.e getting married, leading a better lifestyle etc.. ), these are the kind of expectations I am not interested in, I would even take off the whole day next to get back to my normal self. **Are there people like me? or am I just the weird/abnormal one?** (I would be happy to know that I am not alone in this). Do you think distancing myself from others is a good idea, not like - going to the desert/woods and living away from society, or completely cutting off from family/relatives, but maybe like relocating to a different country. I don't really like to do that, but if this is a problem of life time, then I guess it is a viable option. And I don't want to change myself, I am proud of way I am(I really am). I am scared about future(how it is going to turn out), life before adulthood is a lot easier. Thank you. ", "is_suicide": 0}, {"created": 1575900586.0, "author": "someonereadme", "title": "I need help.", "selftext": "tl-dr; I have lost all motivation and intent in life. All I do is waste time and live in daydreams. I need help.I do not know if this is the correct forum to post, but I come from rural India where there are no therapists available, so this is my only available space to look for help. I am 24. I graduated from a fairly good uni where I gave up sitting for jobs to pursue my dream of working for the government. Three attempts later, I feel I have lost. I cannot get in to my dream job, and I have no skills necessary for any other job. I waste my time away on the internet, mostly browsing random stuff and porn. Everytime I sit up and decide to set my life right, I go back to the old way within two or three hours. I do not have many friends, I live with my parents. I am afraid everyone will be terribly disappointed when I fail again this year and turn out to be another jobless person in the country. I have no hobbies except for occassional reading. I honestly don't know where to begin. I want to start a new life. But I honestly do not know how to. Every attempt so far has failed. I need help. Any help. Where do I start? What do I do? Please excuse me if I sound stupid or clueless, I am both.", "is_suicide": 0}, {"created": 1575527564.0, "author": "Nigbroid", "title": "Idk what to do anymore, I’m more lost than ever", "selftext": "Currently a freshman in college doing my first semester. I’m kinda undecided with what I want to major in, so I just am finishing up some general Ed classes. This past 2 years have been absolutely hell mentally. I’ve been sad, and I keep on getting sadder and sadder every single month. My senior year of highschool, I made so many mistakes that made me a chill and made me extremely insecure. When I was applying to college, I was too afraid of even living with a roommate, cause I was riddled with anxiety and I feared living with a bad roommate. So I decided to live with my sister in her apartment. I was expecting for my first semester to be extremely fun, and I would figure out what I wanted to do, but that didn’t happen. I’ve been more alone than I’ve ever been in my entire life, my anxiety and depression has gone through the roof, and it continues to get worse everyday. I’ve joined clubs and went to some events on campus, but I feel worse every single time I go to them. I regret not stepping out of my comfort zone and dorm, because I could’ve met a bunch of people. Every time I come to my sisters apartment after classes, I feel so depressed. I feel terrible and alone every time I come back here, and I don’t know what to do. Even when my sister comes back I don’t feel better. I’ve tried new skills to get my motivation up, but nothing is working. All my friends are having a great time at their university, and I just want to as well. I also started catching feelings for this girl I used to see back in highschool, and now I feel even worse. Everyday I wake up with chest pains, dreading going to school every single day. Finals week is coming up, and immediately afterwards I’m going to India, and for some reason I’m not even excited to do that. I was looking forward to next semester, but I’m so lost I don’t even know if it’ll be good or just as bad as this semester. I’m constantly worried about the future and I hate it, I just wanna enjoy and live life and I cannot do it, it’s driving me insane.I keep blaming myself because I could’ve made this semester better, and I wanna move past this regret but I keep thinking about it every time. My passions don’t even make me happy, and I feel so lost and sad I don’t think I can carry on anymore. I feel like I’m trapped in this apartment for the rest of my college years, and I really don’t want too. I’d tell my parents I’d like to move on campus, but it’s just too much Money. I have enough to do it for one semester tho, but I don’t know if it’s worth it.I know it’s best to tell yourself it’ll get better, but for some reason nothing has been getting better. I don’t know how long I’ll be able to do this. I never thought about actually killing myself, but the thought of dying doesn’t scare me. I don’t think I have a purpose anymore.I’ve been going to the gym every now and then, but I can’t even eat anymore, and I’m slowly losing motivation to attend the gym. I also wanted to start talking to the girl I like, but I don’t know if I can, and if I do, I don’t know if it’ll lead to anything.I’ve been stressing about my future so much and I don’t want too. I want to just relax and enjoy life, but I cannot even do it for one minute, I always feel like I’m not doing enough. It’s driving me insane.I’ve been through these moments before, but I don’t think I can carry on anymore, thus has been the worst point in my life.If anyone has some advice, please give it to me, I want to enjoy life again and I want to have a purpose.", "is_suicide": 0}, {"created": 1575356039.0, "author": "adrija_basu", "title": "Where did I go wrong?", "selftext": "I literally don't know, where did I go wrong in my life. Did I start failing in school or did it started in college? I just don't know and sometimes when I think about it. I just get frustrated. This literally pulls me down. I'm gonna tell my story inshort but I need you guys to tell me what should I do or else I might end up on street doing drugs or something. So, it all started when I was in school in 9th grade and here in India parents wants their children to become doctors or engineers, if it were a middle class family. I was good in maths, so started studying for JEE (Entrance Exam for Engineering in India), but I was not that good. Made it through the examination but my marks and rank were not that good because you see I was kind of distracted in heart. Always chasing the one who never did love me back. After passing through exam. I got a college but it was not good enough. I made friends whom I live very much. I must say, I have group of 18 friends. Although none of them are my best friend. Meanwhile, my relationship with school friends starts breaking apart. Now it's like they don't even remember me. I have tried very much in the beginning but it all fall apart. And now when I need a job. I'm not at all capable of getting one. I apply in job posting online on LinkedIn, their websites but nothing works. Besides this, now I feel like I'm worthless and I'm the only one left in the crowd to get a job. It's stressful. And wait I did not tell you guys one more thing. After I passed the exams, that girl and I started dating but it ended after 2 years because it was long distance and eventually admiration fades with distance. If it was love then it would not have faded. Those were the exact words. \"I don't know but it feels like the love that I used to have for you....just faded with time.\" And then I just started playing 10-11 hours a day to fill the void she created.So this was me, last 5 years of my life. I just don't know what to expect of my life or what to do with it. Just PLEASE somebody HELP ME!P.S: Account name is just an alias.", "is_suicide": 0}, {"created": 1575237423.0, "author": "jakeperalta85", "title": "Help me :/", "selftext": "Hey guys, I'm a 22 year old recent graduate and I have no fucking idea what to do, I graduated in May, went travelling to Eastern Europe for a couple of months, came back home, got a job as a business dev. Executive ( sales ), shitty company, had a big argument with my manager and as a result of that was laid off. Now again here I stand, the job market in India Being quite shitty, and me having no idea what I'm interested in makes it worse. I don't recall having any dreams, passions, just wanted to he happy in life, but happiness still evades. People say do the closest thing you're interested in, but I have no such thing I'm passionate about! The only thing I've been good at is making people laugh and people have told me all the time I should be a standup comedian or something but  I hate India's comedy scene, but I may try that in a couple of years going to an open mic or something but I just don't see it as a lucrative thing for my career. I live with my parents ( which is essentially the norm in India unless you're married or in another city) so I have no expenses, but my dad himself said \" don't you think you should help me take care of your expenses\" and that made me quote sad and he's right, I wanna start making bank but idk which area I should venture into and I think I'm gonna hate every job I take in corporate, but there seems to be no alternative, then I look at YouTube's and insta hoes making mad money doing bullshit and like I'm happy for them but what the fuck? Right? Anyway, I digress, any recommendations for a clueless fuck like me?Tl;Dr - No passions, interests, I have a feeling I'm not gonna be making much money plus will hate my job so not really looking forward to life, but looking for suggestions", "is_suicide": 0}, {"created": 1575184995.0, "author": "Kusha97", "title": "In a really dark place right now", "selftext": "Hey guys first time here. I'm a student in a dental college in India. I just failed my third year exams, one out of three subjects. I've sent the papers back for reevaluation because I'm quite confident in what I wrote so that's not the real problem. The real problem is my parents, who think that I just didn't study hard enough. They've pretty much stopped talking to me, and I've been sitting alone in my dorm room for about a week now having dark thoughts. You know, the classic Asian parent deal. Looking for advice on how to convince them that I really did study hard and am not at fault.", "is_suicide": 0}, {"created": 1574087711.0, "author": "hardyhddd", "title": "Love can fix me but don't know where to find it", "selftext": "This may be a long one. I hate my life. Mostly non self-made. I have been bullied when I was a child. So, didn't make a lot of friends. I was bullied because I had crush on a guy and to him I looked ugly (I had acne at that time). So, I got threats such as 'I will pour acid on your face. Nevermind, your face already looks like that', 'I will beat you up with my friends near the school gate.' I could not tell at my home because if I did, I would get punished for having crush on a guy. An orthodox Hindu family living in South of India. My mother did not allow me to play outside either. As a result, on my 17th birthday, I had only one girl wishing me. I wanted to become an actress when I was in my 8th grade. My parents found that out and beat me up. Seriously, they did raise both my sisters beating them up too. I recognized their lack of love towards us. They think that spending money on our education and sending us to schools was love. I could never share anything with them. I could never see friends in them. I became very sensitive. I took anything anyone said that was not an insult also as an insult. I developed sleep issues. I went to do master's at one of the IIT's, India's pemier school. At that time, my parents were apparently cheated by my dad's parents. My dad had worked hard for them and is the main reason they are well off financially. They made him sign off his portion of the property to his brother. Just as I was finishing my bachelor's in a useless school and started master's in a premier league school, she kept feeding these thoughts in me about how they are bad, kept on repeating. At that time, I had problems with my advisor and this tied with that lead me to a suicide attempt. After the first week, she would bring up the suicide every once in a while and made my life a living hell. Somehow, I managed with everything and finished my Master's. I got admission to a good shool and an ivy league school in the US. My parents refused to send me until I got married. They even hit me. By that time, I was already in a relationship with a guy from IIT. So, I refused to marry. I said I would leave with the help of my friends even if they don't send me. Eventually, they yielded because they were scared of their image in the society (mainly my extended family). I went to US. My boyfriend stayed in India. I had problems with my advisor again. Then, problems started with my boyfriend We had already slept together by then. He said he didn't want to be with me because I was whining about my advisor all the time. I was at a point in my life where I could not make friends, I seemed to be running into problems with my bosses andy relationship was failing. After begging with him, he reconciled. I visited India in the December of that year. He treated me so well. Again, after returning, I was having problems with my advisor. My boyfriend's mom would call me and make plans about cleaning her house if I were married. This led to fights between me and him. He went to his ex. I got to know about it. I asked him to repay some money he borrowed from me and then move on. His dad picked the call and verbally abused me. Unable to bear these, I told my parents. I took a break and came to India for six months. I was depressed. My parents taunted me everyday saying my depression was self-made. That I chose to be in a relationship etc. They didn't know that I went physical with him at that point. My boyfriend reconciled again. After my leave of absence, both of us went to US (even he got an admission in my school). This time, the wounds we're deep. I couldn't let go. I used to bring up the past. I even said that he would have slept with his mother. He finally hit me, physically abused me. I locked myself in the bathroom. He threatened something and made me come out and he hit me so much. He apologized to me a lot the next day. After a few months, it became hitting me became a regular thing. He would choke my neck etc. Then, I started hitting him. He was talking to his ex again and I asked him to be honest and to split decently if he wants her. He didn't leave the house. He didn't let me leave the house. He would be gone outside for hours with his phone to talk to his ex who was still in India. I got really mad. Once I got drunk and told him that he would go to jail for hitting me and I started hitting him. He recorded it. After that, he hit me black and blue, poured cold water on me, pushed me, didn't let me leave the house. I left the house when he was not watching. I didn't take my specs (can't see without them), no keys, no purse, no phone. He followed me to the nearby park and called cops. The cops initially said they would take him but because I still had so much feelings for him, I somehow, changed things and made them take me instead. My biggest mistake. He did bail me out and all that. He paid the lawyer fees too. Anyway, the hell I was living in only got worse. I forced him to leave the house after that. He would come to my house everyday, used my spare key. I asked him many times to not come and to return my key. He then would call ally friends. After a few months of going through such  events and severe depression, eventually I decided to leave US and he left too. We are from the same city. I still had feelings for him. Up until we returned to India, he said we would get married. As soon as he came here, he dumped, didn't take my calls and everything. Apparently, he was lying about getting married because he was scared I would turn him to cops. I attempted suicide. As he said he didn't want to have anything to do with me. My parents were forcing me to get married and they were calling guys home. I kept telling them that I had a problem. They asked me to think of them as their friends and tell them things. After the suicide attempt, my life became a hell again. Tauntinge of having slept with my ex everyday, spoiling their name in the society, etc. After a few months, my ex reconciled after a lot of begging and everything. The reason I beg him is I don't want to marry another Indian or date another as they take 'not being a virgin' seriously. I didn't want to make the rest of my life a hellhole. A known devil is better than an unknown angel. Even while I was in the US, I tried to move on with an American. However, I remember my dad calling me a prostitute in the past when I had told him that if my relationship with my ex didn't work out, I would find another guy. Currently, I like my job but I don't have good reviews at work. I like what I am doing. I got a chance to go back to US to finish my PhD which I dropped amidst all this chaos and also due to lack of interest in the subject matter. I am torn between whether I should stay in India in a job that I like doing or go back to US and run away from my parents and my ex. I wish to go on dates in the US and get over my ex. Honestly, I want someone who would love me. I don't know if a stranger would accept me and love me. Relationships start with both people being in a good state of mind. I don't really know what to do. I feel like I am going to kill myself in about a month or so. My boyfriend said he would be better off with me being dead. My parents said that it's up to me if I wanted to commit suicide. They said they would lose respect amongst their family members if I died. But, they said it's up to me. What should I do? Should I run away and do a PhD I don't like and find someone who might love me or should I stay in this hellhole and work at a job that I like while having no one to love me?", "is_suicide": 0}, {"created": 1573927466.0, "author": "PontiusPies", "title": "Spiralling down a black hole", "selftext": "I feel like I am spiralling down a black hole. It feels like I am trapped. I can't breathe, my heart is beating against my chest. Like it's thumping really fast out of it and I can't breathe. I haven't experienced pain like it before. It feels like a heart attack. I have felt depressed before after being abused.When I went for treatment in hospital, I was sleeping, I was under the care of a doctor who hailed from India. Nice man to begin with. I was sleeping when he pulled the curtain around ng bed, and put his finger into my butt hole. It was painful and humiliating. I woke up and questioned him. He said that he didn't and it must be the hallucinations from the fever. I could feel pain and  quite frankly I couldn't poop for a few days. So I know I didn't imagine it.Every time I am granted permission for medical purposes I get fear and back out. The memory of this doctor replays in my mind and I just bail. I'm extremely depressed because my church is not really helping. They have assigned me a Councillor but they tell me that depression is a weakness from the devil. I don't understand. I am really beginning to feel like death will be a welcome for me.", "is_suicide": 0}, {"created": 1573808773.0, "author": "theindian_90sguy", "title": "To give up or not to give up", "selftext": "22,Male, India. 2019 was the worst year of my life, not sure if things can get worse. This year I lost a very close family member to a long illness and then I got confirmed diagnosis of Crohns Disease and got started on steroids for a while which brought on a storm of its own, fast forward to 4 months later, my days became a constant battle of one kind or another with my condition, also while fighting recurring urinary infections for months, After much pain and many different hospital beds got diagnosed with a neurogenic bladder and irreversible damage to the bladder wall, as I was dealing with that, doctors accidentally found somehow I had only 6% kidney function for my left kidney also irreversible, right is okay( for now) and requires serious painstaking changes in medications and lifestyle to keep the right kidney healthy. Thus, begins the most screwed up period of my life, because of everything that happened I had to give up on two dream job offers because I was in a hospital bed on the day I was supposed to start(yes, both times). Couldn’t give exams required for higher studies because 10 days before they started I broke my wrist.All of this has culminated in a very fragile mental state where I am having breakdowns every week, total loss of energy or motivation, not eating enough, bouts of insomnia or excessive sleeping for days,spending most of my time in bed and still losing weight, sudden bursts of anger, uncontrollable leg shaking and all the stuff that comes along with all of that, having very negative thoughts about my life in general and wondering is it even worth it at this point, and to what extent am I ready or am I strong enough to get through this, where does it stop? When does it get better, if it ever does?Finally decided to get some professional help,Been through various blogs and forums and mental health websites and confused withIf I should see a psychologist or psychiatrist?Really in need of dire help?Any suggestions or help is appreciated", "is_suicide": 0}, {"created": 1573654231.0, "author": "KimJongIllyasova", "title": "I'm embarrassed to be viewed as an 'immigrant' - I've lived in this country nearly my whole damn life", "selftext": "Little bit of background, I was born abroad (in India) and we moved here after I was legit 4 weeks old. Chill right? America is my home and I honestly don't consider myself any different than anyone who was born here/ lived here forever.But... recently, on *my official bios for work &amp; Wiki page* (I'm an editor in media/tv), it *shows my birthplace* and introduces me as **\"Indian-born American\"** and for whatever reason it's making me insecure. I feel more foreign, less American, and feel like people will view me inferiorly for immediately seeing **\"Born: India\"** &amp; not take my work/art as seriously. I feel like I'll be called out for being an \"immigrant\" or some shit - at the end of the day I don't really identify as an immigrant; maybe it's from a place of insecurity but that's just how I feel. I just wish I was born here, and was seen as 'American as possible' - maybe I'm just insecure about my heritage or see it as *inferior* compared to the American-ness and I'm putting it up on some pedestal. Maybe I see immigrants / people from Asia as 'lesser' or something and I'm overcompensating for it? I dunnoAll I know is that it bothers me, and not sure how to process this shit + get over it. I'm just curious what y'all think of if you have words of wisdom to help me out with this stupid identity bullshit. I've always identified as Asian-American or just straight up a normal  American dude - am I hateful/resentful of my heritage? What can I do to get over thisAppreciate you reading this---**TLDR:** Came to America when I was super super young, didn't care until recently my Wikis/Bios say \"Born in India\" and it makes me feel insecure / less American. I don't *feel* like an \"immigrant\" per say, and I feel like my birthplace makes me viewed as lesser. Mental block / issues - how do y'all recommend I get over this or work thru itS/o to any other immigrants / children of immigrants / people struggling with identity bullshit. ^Thanks!", "is_suicide": 0}, {"created": 1573524754.0, "author": "blackbird2808", "title": "I am lost in my own fabricated world and refuse to face reality", "selftext": "I was a lonely kid growing up cushioned by my parents both financially and socially, mostly due to my health complications.I used to fabricate my coolness to make friends and they would just be there to take advantage of me..basically i lacked real friends till i was 15.So when i was 12 my father was just crushed under heavy burdens of his decisions and become an alcoholic so in my final year of high school i decided to get my shit together and was the topmost in the school. I instantly got respect and recognition but the only friend i had was jealous of me now he used to point out tiny things to demean me, but i never minded that but eventually i distanced myself from him.Then for 4 straight years i tried to become as socially accepted as possible but forgot about Carrer..i got some real friends who value and help me whenever needed ..and got love of my life.But during this time i lost grip of reality i used excuses instead of action, making fake incidents playing victim and taking approval from everyone.So now basically here i am depressed with all the bundle of lies with me, having a mindset that i know better not trusting anyone and slowing becoming socially awkward.Day after tomorrow is my test that will determine my life's course it is dream of my mother who sold everything valuable to make me study and my father who is bipolar and on brink of stroke. I just want to be normal be happy be a person of action instead of just dreams and talks. I want to be truthful and accepting reality.I have sucidal thoughts even in happy moments and to me ending my life seems a better option than facing my problems .HELPP.S. I'm from India so and even so from a small town so therepy is not even available. And i don't want to risk everything i have by telling anyone truth.", "is_suicide": 0}, {"created": 1573328137.0, "author": "firealpaca11", "title": "ADHD+Depression; Feels like I've hit a dead end.", "selftext": "I'm a 19M from India. I've tried all the major medicines available for ADHD. None of them worked. Some of them caused terrible side effects. I became depressed after a while and then my psychiatrist made me take antidepressants so that I could concentrate and get through college. They also caused horrible side effects. Idk if all the meds I took fucked up my brain because I'm not able to do anything these days. It feels worse than when I didn't take anything and was unaware of my ADHD. My attention span is like 2 minutes and I have no motivation to even do simple day to day tasks. I just want to be able to finish college with bare minimum grades. If only I could sit and read a few lines from a book and get it in my head.I'm feeling hopeless. How is that not a single medicine helped? I just feel like crying.", "is_suicide": 0}, {"created": 1573085495.0, "author": "firealpaca11", "title": "Feel like my brain is deteriorating", "selftext": "I've not been functional for the past few months and I'm struggling to get by each day in college. I have ADHD and depression so concentration has taken a huge hit. My attention span is like 2min max. I'm taking meds but they're not helping much.I'm not even able to read simple stuff on reddit. How can I study? I have exams coming up and I'm going to fail all of them. ALL of them. I'm redoing 4 courses already and way behind a my peers. I might not end up finishing college in 4 years and it makes me feel miserable. I see all these posts about people taking a break from college and continuing a year later but I guess that sorta thing is possible only in western countries. I live in India and I don't think my college will allow it. Even if they do there's no assurance that I will recover during the break. I don't want to study an extra year while my friends graduate.  I'll be alone. I can't afford to pay for another year. I feel like crying. I don't know what to do.", "is_suicide": 0}, {"created": 1572905487.0, "author": "iamgayafoo", "title": "What should I do if I can't afford therapy?", "selftext": "I don't want to burden my parents as they are already under huge financial constraints and at the same time , I feel really miserable months by months , I feel that it is getting too heavy to live and I want to heal myself . My best friends tried their best to cheer me up but I am afraid that I will keep disappointing them and end up losing them. Lately , I don't feel like I am myself. (Btw I am residing in India) . Any help please?", "is_suicide": 0}, {"created": 1572452388.0, "author": "incognito_anxiety", "title": "I feel like I'm slowly decaying away and this is honestly the worst way to die.", "selftext": "I'm not good at anything. I've a degree but I don't have a job. I don't know how to get a \"good\" one. I live with my parents and I feel so fucking ashamed (even though that's the norm in India but still, I'm going to be 23(F) in two months). I feel like shit. My depression and anxiety has taken a toll on my health, especially digestive health  - binge eating disorder. I have zero confidence left in me. And if this goes on for a longer time, they're definitely gonna get me married (arranged marriage - India). I just don't know how to help myself. My narcissistic father controls all my finances, social life, basically my entire life. I just don't know what to do. I keep on telling myself this just the \"before\" part of your life. The \"after\" is going to be so much better and totally worth the \"before\" part. I'm fooling myself. I'm slowly decaying away. I'm dying. I can't actually take my life because 1) I'm a fucking coward. 2) My mother's entire life would be a waste. So yeah. I've no other option than to decay slowly.", "is_suicide": 0}, {"created": 1571503165.0, "author": "Braaahh_skrtskrt", "title": "Am I just making excuses?", "selftext": "Tbh I can't get anything done I get intense anxiety while waking up to go to school N avoid literally everything cuz it feels overwhelming Idky My hygiene is deteriorating...  Sleep n food cycle fcked up I lie on bed whole day looking @ my phone only then I feel \"fine\" ...But this is my last yr @ school N in India its really crucial specially for a commerce student like me..  I can still do okay in school 75 % kinda but it is not enough...  This is the 3rd yr w/ seasonal depression Every year I think I got better it gets worse.. What it I'm self inducing it or just making excuses ... IDK", "is_suicide": 0}, {"created": 1571443577.0, "author": "i-have-ADhD-brOSorry", "title": "Is this depression?", "selftext": "Okay I know you shouldn’t assume depression, but I’m 16 and I’ve been through lot of trauma. I have ADHD and People don’t usually like me. I’m not rich and I’m ugly as hell. I’m not too smart. I live in India so parent kid problems i have them. I’m can’t sleep. I dream people calling me a failure. I want to kill myself every week. My ADHD makes me a nervous wreck. I can’t do anything right. I don’t have anyone to talk about these stuff. Is this depression? Should I get help?", "is_suicide": 0}, {"created": 1571096082.0, "author": "merelychaotic", "title": "Life keeps getting harder and harder...", "selftext": "Hi. I recently turned 18. This is a throw away account. And I figure I need a place to talk about things, I've been delaying this post for a long time now.Shit just keeps getting harder. Im in school still, I don't feel like going to school, I don't know what I'm gonna do in my life, I haven't decided what colleges I wanna go to, I just dont know anything.My family sucks. They don't understand anything I say, always keep poking me about things, when they're angry they tell me im a failure and at times, i feel like one too. I don't like talking to anyone. I sit alone in school, alone in my room at home, don't go out cause there's no one to go with and if there was, what would I do, where would I go?I've lost all my friends in the past year. Literally all. None left. No one for me to share things with. There isn't anyone I like romantically. Even if there was I doubt I'd have a chance. Self confidence is all over the place.And the worst part is - I'm not properly diagnosed with depression? Like, all the symptoms add up and I study psychology so at a very small scale I can tell I am depressed but I dont know the extent of it. I can't go and see any therapist cause I dont have money and also cause that would mean me being away from the house and the family can't have that, it's like they wanna keep me locked up.I have a lot of suicidal thoughts. In the past 1-2 months, their frequency and quantity have increased by a ton. I started having them when this year began, then it reduced around June or July and ever since August its been bad again. I see myself dead, hanging in my room or something.Even during normal conversations with my mum or dad, or with a teacher or a classmate, I just zone out in the middle of saying something cause I start wondering what it would be like if I just wasn't here. If I was dead. It's fucked up, everything would be going great, I'd be watching a video or a movie and I'd be laughing all of a sudden I'd stop cause I just don't wanna be in this world anymore.I dont wanna work. I dont wanna study, go to college, have a \"great life\". I didnt ask to be born. I feel like I dont belong with every group of people, in every situation.Is there any help that I can get? It's the first time since I'm explicitly asking for it. I dont need pity or grief, I need help, I know that. Any kind of help is appreciated. Please note that I'm from India, the culture and the system here is a bit different and... yeah. :(", "is_suicide": 0}, {"created": 1570889995.0, "author": "throwawaycozuknow", "title": "Scared to find out if I am in the wrong", "selftext": "I have depression and get anxiety attacks and cant fucking stop crying. I think I went to a traumatic childhood but I dont know what can be considered normal. Children in India get beat up all the time. Is it okay to get beat up for spelling mistakes? I’m not sure.I have googled the symptoms and they seem to match, but I’m not a doctor. It just sucks. I wish I could be sure that I’m fucked up coz of how my parents treated me. My parents tell me that they’ve sacrificed their lives for me, spent their retirement funds in my education so that I could succeed. They say I’ll always be indebted to them. I dont feel that way though. They are also the people who didnt let me pursue the course that I wanted and refused to pay for it. I hate myself for that. I hate myself for letting them bully me into it and now I’m stuck in a field that I have to keep on working in to pay my student loans and my family coz they have spent their funds on me and have nothing left. I feel so alone. I feel detached from this world. I feel so unloved. I remember being poor and so we would all sleep in the same king sized bed, all 4 of us. And I’d get pushed out and would sleep half on the bed and half of my body falling out. And I would cry silently every night. And all I could think was of getting away. My parents didnt let go of any opportunity to scold me, beat me, show me how dumb and stupid I was, but barely can I remember them encouraging me. The times they did, seem formal and detached at best. I was expected to function normally no matter what. My brother was born autistic and so he was loved. And I loved him too. But when I would tell them that they were partial to him and loved him more they would tell me that I was jealous of an autistic child and that was bad. That I wanted him to be mental. That I wished he stayed crazy. I stopped complaining after that.I had no friends. Nobody in my class would speak to me mostly. When they did, it was to make fun of me, taunt me, or to just annoy me. I really didnt mind that. It didnt affect me. I liked to read a lot and so I would just keep reading the stories in my english book or get something from the library. I surrounded myself with stories. My parents hated each other and my dad seemingly beat me when he was mad at my mom or they had fought. I would get beat up for talking coz he didn’t feel like it. I got beat up for hugging him coz he had come out of the shower and wanted to pray and me touching him had made him “unclean” and so he couldn’t pray.Several times I got beat up for not studying throughout the day. If my father was pissed  and found me without a book in my hand, I was definitely going to get beat up. When I bring it up now, my mom says thats normal and that every child gets beaten. She says that he spent his retirement fund on my education and that even if I pay him back, I’ll be forever indebted to him. It pisses me off that I will always be indebted to him. It feels like he was wrong and they messed me up and so I dont want to owe him anything. Worst of all, I feel all this talk of me being jealous of my brother turned him against me. We used to be so close. Now he barely talks to me. He started beating me up too a couple of years ago until I moved out. I have always thought that all of this was the reason for my depression. But what if its not? What if I am actually a horrible and self involved person that small things that my parents did for my good, I concocted as negative in my head and am making them evil? I am just not ready to get a verdict from a therapist. Coz I know I am too unhinged. I cant be right when the entire world hates on me right? I mean I dont get along with most of the people, dont like to talk to many, and have speakable friends that I can count on one hand. I feel that I have just made a huge issue out of this in my head and if thats true, what the fuck do I do?", "is_suicide": 0}, {"created": 1570602339.0, "author": "harsh_naik16", "title": "I well like this cycle of killing myself and not facing my fears is not gone end.", "selftext": "It's stared when I was 15.Like I got depression because of school (and had anxiety) then after 2years of locking myself at home, and just avoided seeing therapist (cause I felt like a victim or I was too young). I started get out side again and passed my Secondary School (India), and joined college, 2years after that I started hating going out side again it's been 2 or 3moths now already, and I also had a nicotine and weed addition which I have not touched since 4months now(idk if that is a problem too). Like it's been like 5 fucking years now, Depression fucked me hard, I well like this cycle of killing myself and not facing my fears is not gone end.I'm Sorry for wasting ur Time and that garbage English but I hope you help and sorry if it's was too long I had to Share this!!! I will appreciate if you share you advise!!!!", "is_suicide": 0}, {"created": 1570574060.0, "author": "SuperMarioPlumber", "title": "Mental health coverage", "selftext": "Does your insurance cover mental health? I am from India and I don't know if the company offered insurance covers my therapy sessions.", "is_suicide": 0}, {"created": 1570326872.0, "author": "UnusualBreakfast", "title": "A pill for indifference", "selftext": "I am just writing all these to get stuff off my chest. I don't think I'd even do this if I wasn't drunk, because I keep all my thoughts and emotions pent up all the time anyway. I come to this subreddit because I've no one appropriate to say all of this stuff to.I'm a 23 year old man from India. I'm from Kolkata and most people in India would know that now's the time for the largest festival here (called Durga Pujo). I'm back with my family for this event (I work in Bangalore). Today's the seventh day (Mahasaptami) of the ten-day event. Regardless of whatever I do in life I feel like I cannot get rid of this ever present all-encompassing loneliness and isolation I feel from everyone. Festivals only make this worse. I see so many people everywhere and I cannot help but imagine them in nice, comfortable lives with atleast one person in their lives whom they can turn to. I know this is a bullshit thought. Millions of people in this cursed country are living way worse lives, but I can't help feeling alone about it all.I sometimes wonder if it's the presence of a girlfriend or any relationship in my life that would make me feel more attached to something in life. But I do not know. I don't have the guts to approach women. I'm pretty average looking and I feel I'll never have someone for me. There are thousands of smarter and better men than me everywhere and owing to the fucking fucked up sex ratio in this land I don't honestly think I've got a damn chance. I can only stare at women from afar, browse Instagram, jerk off to some random women or porn off the trenches of the internet and fall asleep alone. I don't even yearn for happiness anymore. I just want peace. I want the strength to look at it all and TRULY not bother about anything anymore. I've had enough.", "is_suicide": 0}, {"created": 1570161440.0, "author": "BlopsHd", "title": "I passed!", "selftext": "Hello everyone. My name is affan i am from India. Around 6 months ago I gave my final exams to pass to the next year. I am doing my graduation course in computer engineering. I am very hands-on kinda guy. I hate books but can study for hours and hours if its hand-on. Anyways. I have a lot of pressure. I am eldest one in my home and the whole future of my family relies on me. On August 20th August 2019 my results came And I had been detained. I was broken. This means i have sit down for a whole year. And continue without my friends for the rest of program. I can't go for masters because I won't be considered because I was detained.i didn't tell it to my mom. Or my sister. Or my dad. I then applied for re-evaluation of my papers. Secretly. And Today my results came in. And I passed! I was crying with happiness. I had been struggling for the last 43 days looking at my mom lying. Today I cried and I told her everything she told she would've supported. Anyways just wanna say anything is possible if it needs to happen.I want to thank My God, My family, and most importantly my friends from Reddit and real life. I hope everyone of you achieve success in your lives. Bye!🙃🙃🙃🙃🙃🙃🙃", "is_suicide": 0}, {"created": 1569037678.0, "author": "Overlord1141", "title": "Just disappointed.", "selftext": "I know some of y'all might feel the same about what I'm about to say or have something to say, but I genuinely do not care. But I need to say this.I've been stalling and stalling and stalling the fact that I need to accept this. I'll never ever be truly happy. Because I don't want to be. The only thing I've ever wanted is to be the best. Which I most certainly will never be at anything because I can feel nothing but frustration and dissatisfaction and disappointment because I'm not already the best at it, irrespective of what it is or how long or how many times I've tried it. This movie, \"Good Will Hunting\" has this dialogue that I'm paraphrasing, I don't try anything because I'm scared I'll be disappointed, that's why I don't try anything. I'm afraid people will leave me and that's why I leave them first. Though I know most people aren't rude enough to just outright ghost me, I do know the sort of person I am. A narcissistic piece of shit. Don't get me wrong, but I know for a fact that I'll never ever actually make friends ever because I just lie and lie and lie. Believe me, I've tried to  not lie. Really tried. But I believe my own lies so yeah. I wouldn't know when I did lie. Or maybe I'm lying to myself right now too. Doesn't matter. What I do know is   I'll always be alone and it's me who's decided that. I don't know what I want. What I do know is that I just can't try anything. Right now, I've dropped a semester on top of not appearing for my last semester's examinations and flunking even after cheating through the semester's before. I don't mean to boast, but I am not stupid. I am studying ,or supposed to be studying engineering in one of India's premier institutions of engineering, and I know for a fact that at the very least I'm in the top half of the IQ pool in the college. But as I said. Not the best and hence I've just never tried. Sometimes I just wish I would have just chosen to join a local college, that way, I'd at least have a bubble in which I was the 'smartest'.Before you ask, no I'm not particularly interested in engineering I just chose it because I was relatively good at it and it was also what I was suggested. And no, I don't enjoy anything. All I do need/want is to be the best. For fucks sake, I can't even play an offline PC game without cheats or a competitive one without getting more and more upset every minute I play. But as I'm at home doing nothing, I need to do something to not want to continually bang my head on the wall, so I just do it. Day in day out getting more and more numb to the prospect of living everyday. I just wish I had the guts to do all that I want to do to myself.", "is_suicide": 0}, {"created": 1568921680.0, "author": "Richardparker800", "title": "I don't wanna fall back into depression, that being, the worst time I've had in my 18 year old existence.", "selftext": "If you're going to read this, please read all of it, because there's no TLDR in the end. And I'd really appreciate it.I wanna let it all out and be honest for once, with random strangers on the internet as my audience.This is gonna be long post, you don't have to read it if you aren't fond of \"oh woe is me\" threads, like no one is.You'll see why I put this on the depression subreddit, just please have enough patience to read all of it.It's been around three years since I actually studied. I don't know when it started, when I completely fell off the hook, and stopped understanding anything that went on at my tuitions, which were, for an examination known as JEE, being an Indian student from the lower middle class, I started preparing for it officially since 9th grade, which is, the start of middle school. Unofficially, I've been preparing for it my whole life, without knowing I was doing so, and don't get me wrong, I enjoyed doing so. My father, a college professor brought me up free of any \"distractions\" like television and movies, lest I fall off the path and become like the other kids were. I read a lot, in the absence of any other form of entertainment, played on my 3DS, which was a birthday present, which I'd get for a few weeks after my annual examinations and then it'd be confiscated, following which I'd steal it back and play on it all day. Being brought up in a household where every hobby could be monetised and be used to benefit my career, where I'd solve textbooks that were two grades above of me, just to get attention from my father, which is yet an unresolved complex for me, why I'd do all of that willingly only to be thrashed if he caught me with my 3DS or with a comic book behind the textbook I was supposed to be doing. He'd enroll me in courses, I'd excel at them, I'd get rewarded, and I'd be punished if I didn't perform. Upon developing an interest in music, he enrolled me in an academy, and when I scored 80/100 in the initial grade examinations by the trinity board, failing to achieve distinction, he made me clean the car and wash the dishes because that's all I was fit for, in conclusion to those grades. It was just the way it was. Amongst all this, I won awards for debating, quizzing and being actually good at it. I was, an edge above everyone, a peg above all of my peers whom I'd see as dumb and shallow for wasting their lives on going to birthday parties and trying to solve simple linear equations, knowing deep down that I wanted to be a part of it, I wanted to have friends, I wanted to be invited. All this time, I'd whore for attention, I'd be the class clown, I'd fight for no reason just so people would notice me and they did, and not in a good way. All this carried on, after which I dropped out of a public school at the behest of my father and joined what they call an open school, where I'd only give the examinations and for the rest of the time, I'd go for coaching and tuitions. My grades started slipping towards the end of 10th grade, it wasn't as if I was slowing down, I still knew more than anyone around me but I couldn't study for some reason, I'd just play on my stolen 3ds all day, and attempt to write a novel on wattpad. I genuinely craved for a childhood friend, which I still do, someone who's been with me through thick and thin, someone who'd call me up and ask me how things were but that was something that my father didn't allow, guys from class calling at home to talk about anything except studies. He still gives me shit about how my then-friends didn't talk about anything academic on the way to the mall, where he took me for my 14th birthday. I dropped out of a school where I had to attend among other kids and thought, \"oh well, I have all the time in the world now, I can finally start studying and get into what, IIT Delhi!\"Forward to two years and a few months and I'm at the bottom of everything, I failed to score on every single avenue I was presented, the boards, JEE, grade 5 piano, everywhere.This journey, which I'm retracing as I write this, went from me not understanding shit in class, to me bunking classes to smoke or just fuck around for five hours and then telling myself at night that I'd study tomorrow and make up for it. So I didn't understand shit in my coaching classes, big deal, not a lot of people did, this was a peg above the standard board examinations too. But that was all I had, and to my misfortune, I was in the top batch which I secured through my former prodigal self, to whom my school teachers would say that I'll definitely get into IIT, or even MIT, and I wish I hadn't believed them, cause believing that I could sail through without knowing the syllabus or even the name of the chapter that was coming in the monthly test the coaching would hold was a huge mistake, obviously. I wasn't getting shit as to what went on in that classroom, that premier batch of the best coaching institute of that city where a lot of kids, like me, had dropped out of normal school. I couldn't study at home, I don't know why, just found it difficult to look at the book without feeling sleepy or just being out of it in general, and I'd waste 23 hours of my 24 hour day doing nothing, sleeping, listening to music, trying to look good, but hey, I didn't go to school, who was looking anyway? As it should've been, I just rolled downhill, carrying my grades with me, realising that I wasn't that smart after all, there were 40 other kids like me in that 50 student batch, but they were studying and they were scoring, I wasn't, I was pretending to understand and act smart so I could live up to my previous reputation as a fucking prodigy which I slowly realised, I wasn't. I wasn't anything of that sort, I was on my way to be one of those kids I used to laugh at, who would find regular curriculum difficult, which I'd breeze through. This carried on, 11th grade passed, I started dating someone from my batch, cheating my way through every test they held so my father won't turn my life upside down, for which I needed to remain in the top batch, where the founders of the coaching taugfht. 12th grade started, I was still where I started, at 0, with an year left, and the teachers would say that it was enough to score well, if you studied for 10-12 hours a day, but hey, I wasn't studying for 10 minutes! Every night, I'd think that I'd study the next day, fix everything, and go where I wanted to, which was, IIT, and even that dream escalated downwards, from the best, to the second best, to the third best, and finally, any above average engineering college because fuck, I was nothing, nada, I had no idea what they taught me in those two years, and it was all gonna come in that dreaded examination, which was, in January 2019. In August 2018, I made a post on Reddit asking for help in studying, asking for someone who would sit me down and make me study with them, and the most sane advice I received was to throw my phone away, which is, again, stolen from confiscation, cause hell, I wasn't allowed a small Nokia, lest I talk to me friends when I'm supposed to be studying. To throw my phone away and spend every waking hour studying, which I didn't do. I'd still watch movies all day, sleep, or cry because I wasn't studying and everyone was and my future was in flames. All the while, I was dating her, and I must say that her presence was extremely needed, she studied all day, talked to me at night, made time for me since like me, she didn't have school either and helped me study. Not wanting to disappoint her like I was disappointing everyone around me, I'd lie to her about how I was studying and how everything was good, and it carried on. I didn't know when and why, the pressure of seeing my future burning down before my eyes got too much and I started to cut. I had self harmed before, in 9th or 10th grade but this was unlike it, I loved the feeling of making cuts on my thighs with a box cutter and feeling my wounds burning as blood dripped down. Once, trying to explain why I found it so hard to study, why I couldn't pay attention to anything study related, I went on Google, and like any self diagnosis, it was errored, pointing me towards ADHD. I told my mom, she asked her brother who's a child specialist at some private hospital, who said that if I had ADHD, the symptoms would've shown themselves sooner, and not in high school. Some time later, again, I googled the reason as to why I slept so much, when I'd always been a light sleeper, why I never felt happy, why I couldn't focus, and there it was, depression. I didn't give a shit, I dismissed it completely, being surrounded by people on social media who would talk about depression as if it was a statement, and I thought to myself that this wasn't shit and I wasn't supposed to blame my inability on something I don't have, hypochondria is not something that befits a student. I had a friend, he was somehow going through the same, with exactly the same premise as me, we'd hang out, he got me smoking until I couldn't stop, we'd talk about how shitty everything was late into the night, he'd cut way more than I did, and time passed. He visited a therapist, somehow convincing his parents, came back and showed me a prescription for Toficalm and Bupron, his diagnosis reading \"depression, ADHD symptoms and NSSI\". He studied a little towards the last few months, got into a below average college, and is now out of state. We don't talk anymore, and no one around me, including my then-girlfriend liked his presence.In March or so, I begged my mom to let me see a therapeutic presence so I could ask, or confirm, because I hadn't yet started believing that I was depressed, because as of now, almost everyone I know is supposedly depressed, no one has friends, everyone has a therapist, even 13 and 14 year old girls, I don't believe them, the same way I didn't believe myself either. She took me to see her friend, who, after everything, told me to drop the whole engineering dream. I told her I didn't want to, she told me that I didn't want it. When everything was over, in May, my father sat down in front of me and cried about how seeing me fail hurts him too, as much as it hurt me. Obviously, in the absence of my passable grades, I was offered two choices, to drop an year, and reattempt the next, in 2020, or to pursue English honours in his college, under the Ward Quota, which still isn't an option, which never was, even though her friend encouraged me to take it and go out there and enjoy. I willingly accepted the drop, seeing it as a chance to turn things around and fulfil my IIT dream, and join my then-girlfriend where I wanted to go, IIT, where she went, with all her insane dedication towards studying and being successful. This was, in May, my birthday month, the lowest point I've had, with the absence of friends, surrounded by the people I disappointed, with no one to call me except relatives, who'd ask me how I scored. My father's friends, who had seen him bring me up, strongly disapproving all along, convinced him to take me to a counsellor, or a therapist. It happened, I told her about me cutting, smoking, and everything bad in my life, and how I still wanted to study and do engineering. She, from there, recommended us to jointly see her and a psychiatrist, because, as per her, after 8 sessions, I was, clinically depressed. My father refused, firmly believing in a no drug approach, yelling at me as to why I can't talk to him about it, why I couldn't just study, why highschool was such a big fucking deal. This carried on until my mom begged me to stop destroying the family, because supposedly my father felt betrayed and hurt due to my inability to open up to him or spend time with him, or even be alone in a room with him for five minutes, and he was taking it out on her and my sister, while I'd stay in my room all day, sleeping or watching Bojack or some other show. The psychiatry never happened, the counsellor told my parents about my cutting since I was 6 days away from being 18, technically being 17 and posing a danger to myself. They cried outside the hospital, made me promise that I'll never cut again while my therapist told me to start off small, by studying thirty minutes a day, she made my dad enroll me in a couple tuitions, where I'd be forced to study and so he did. I still didn't study, I lied to her about doing so, and she admitted that I can't be put on any kind of medication due to my father being firmly against that. After this was over, she told us that our next appointment was in two weeks, which never happened, because the first question that my father asked me when I asked to go was why I still needed it, why I still couldn't talk to him about about whatever problem I was facing, and again, why highschool is so difficult. Once or twice, he'd bring up my self harm, telling me that it's the sign of a weak man, following which I'd go to my room and let my anger out by sleeping, which I did after every stressful situation, sleep it off, smoke, repeat. Things got better with time, I stopped cutting, I started to understand what went on in the classroom, filled with the same kids I looked down upon a few years ago, who struggled with the same curriculum as I did. I still couldn't study at home, unless it was homework, and I couldn't stop smoking, though I lessened it significantly. What still ate me up, and still does was the fact that I wasn't self studying. Even an hour a day. I'm no longer anywhere near intelligent like I was, I'm slow and dumb, I can't make do without self studying. I'm cheating on the weekly tests they hold, I'm failing at the test series my father has made me join for JEE, thankfully, due to which he has accepted that it's way out of my league and he shouldn't expect results over on that avenue. Anyway, June-August, this carried on, I wasn't really happy, as, again, time was running out and still is but at least I wasn't in that phase, the cutting-smoking-repeating-never feeling happy tirade. Come September, the pressure builts in with about three months to go, during which I need, need to study and finish the stack of unopened textbooks lying in front of me. I need, to stop cheating, I need, to start, fucking, studying. And then she breaks up with me, citing the absence of time to talk, because even though we were in the same city, it was more of a long distance relationship as I wasn't allowed to go out for anything except my tuitions. My one and a half year, stable and happy relationship, ended, because it wasn't fulfilling. She couldn't find time to call me for days on end, being in one of the best colleges in India and studying and excelling, while trying to live the life she missed out on in highschool, with proms and parties rightfully taking priority over me, leading to fights and guilt and eventually, her telling me that she's not in the headspace for a relationship, with no time to date.I'm scared, I'm scared that this will all end up as a repeat of the last year, I'm scared sick that I'll fall back into that phase and yet, yet I can't study. Yet, I'm lying in bed all day, calling her up, with her screaming at me to move on and let her do so too, to get on with my life and study, instead of throwing it all away. Eventually, I convinced her to let this be a break for the relationship and not a complete end, because God knows I can't let her go, the shitty fucking person that I am, I don't want her to move on, I want her to stay. But I know that she'll leave soon enough, as we're still fighting like we did, about how she could spend 5 hours at a party but how an hour is a lot for her, when it comes to calling me, because I'm just there on a screen. I understand how selfish I'm being, how much guilt I'm putting her through with her thinking that I'm not studying because of this, but I couldn't study before and I can't study now and I don't know what to do. The relationship is beyond saving, with her developing into something she never was once college started, acquiring anger issues and a tendency to be a prick and tell me that she's sorry later, after she's told me to stop acting like a kid and study for fucks sake, and get on with my life. She doesn't know that I wasn't studying while she was there, and I can't tell her that either, like I couldn't tell my therapist. The relationship is over and I'd love to move on but hey, she had friends who took her out the day she broke up with me, I don't have a single person who texts me first. The ones I've talked to, about the break-up have told me to move on, which I know is what I should do, but again, I can't. I'm slipping back, I purchased a new box cutter, like the one I used to cut my thighs with, I can feel my day just being wasted, I can't cry, I just can't, I can just be a sad piece of shit and watch the sun rise and fall and I watch Netflix and live on a diet of unhealthy proprietary food, with Instagram and Reddit sprinkled in between amidst me running my hand over my thigh, feeling the marks I made some time back. There's a well of guilt in me, eating me up, for all the sacrifices my parents have made for me, and how I've done nothing but disappoint them, which I shall do again, in a few months. And yet, yet, I can't study, I can't pick myself up and sit at my desk and try to study without getting distracted, and then doing anything, anything, except studying. I miss her so much it hurts, I can't let her go, I'm just wasting my life doing nothing, not even being happy about anything. I'm just this sedentary sad piece of shit who sits in bed all day and holds his head in his hands at night, not knowing what to think, missing his ex girlfriend, not wanting to admit that his happiness did indeed rest on her presence. I can feel myself going back here, and I don't want to. I don't wanna fail again, I can't fail again. I need to move on from her, and I need to do something about my life, and I need to be happy as I do it. When she was sad, she'd study furiously, she'd engage herself in productivity, slowly not feeling my absence and then being fine a few days later, surrounded by friends. I wanna be like her, I wanna study 15 hours a day, and I don't wanna be sad and most of all, I don't wanna slip back into that hell. I've already cut on my thigh with a blunt pair of scissors, I don't know if I'm depressed, but I'm acting just like I was then, and the sadness has increased exponentially with her leaving. It's dumb, it's so fucking dumb, I'm 18, it was just a teen relationship that didn't carry through and yet it's breaking me, but who am I kidding, I wasn't studying before her, now that she's not here anymore, I'm becoming more and more depressed, like a normal person does after a break up, coupled with loneliness, guilt, and the crippling knowledge that I'm going nowhere and that I serve on purpose to anyone, even myself.I don't wanna start cutting again like I used toI don't wanna smoke everyday I don't wanna be sad all the time I don't wanna waste my life like this, at a crucial point like this, my last chance at a good engineering collegeI'm tired and I don't wanna kill myself, which sounds like a great option, but I know I can't do that.Please help, tell me what I should do, anything, to just get out of this and move on and do something with my pathetic existence.", "is_suicide": 0}, {"created": 1568865753.0, "author": "sausalito7", "title": "35, turning 36 in a few months and trying every day", "selftext": "To be better than before And I don’t know if I’mSucceeding. It is super difficult thinking I’ll never find a romantic partner that fits, that I won’t be financially stable ever, and I won’t ever have kids. Being part of a family business and helped it grow to a size we didn’t think we would before hand. Raised hundreds of thousands for educating underprivileged kids in India. Lead teams of volunteers. And I’m right now considering transitioning careers and it is just super difficult to think about the future in any hopeful way. My parents are getting older. My little sister is going to grad school. And I feel so guilty and horrible that I haven’t done more. Feel like a complete loser. And nothing will ever get better. And maybe folks would be better off not having to worry about me? I don’t know maybe mourning might be better than worrying. I know that doesn’t make sense - it just feels super difficult to think it’s not too late for me to change. It’s a brick wall of a thought I keep hitting.", "is_suicide": 0}, {"created": 1568290579.0, "author": "sinkingsoul391739", "title": "My Depression and Trauma cost me my professional dream: med school", "selftext": "CW: depression, sexual violence    The past is currently affecting my mental health. I feel so useless and pointless and don't know where to go with my life anymore.When my father started showing signs of dementia, I was a junior in high school. The reality of the situation didn’t hit me until freshman year in college. At the same time, my grandfather in India was ill, and my mother spent most of her time outside the country. In terms of paying tuition, I was set. When it came to living expenses and emotional support, I had no one.I didn’t think it was physically possible for the human body to shut down. I didn’t know that a human was capable of crying for hours without calming down. I was surprised that I could lie in bed for hours, wide awake, without having any will to move.After conversations with my therapist at the time, I speculated that my growing isolation was my fault. I didn’t reach out to people. I decided to change that. I reached out to acquaintances, people I just met, everyone. Many of them took advantage of my emotional vulnerability. And one night, someone took advantage of me physically. My school was under Title IX investigation. Our disabilities services was inefficient and unhelpful. Professors and classes were known to give students zeroes on exams, even in the event of an ER visit. I would have no institutional support.In the process, mutual friends either cut me off or refused to stand up for me. All my relationships became strained, as individuals who claimed to support me were suddenly “too busy” to help. The one thing folks don’t tell you about sexual violence is that the event itself isn’t the most traumatizing part--it’s the aftermath: the victim-blaming, the shame, everything.I was traumatized for years. I can count on one hand the number of people who stood by me in undergrad. My brain shut down. I skipped classes out of fear that *he* would be there. I avoided libraries out of fear of running into *him* I chose isolated spots just to cry myself to calm. It’s astonishing how much time one can spend in front of a book only to absorb nothing when the mind is repeating a bad memory. I was surprised that I didn’t fail out of school.I couldn’t tell my parents. But when they asked me why I wasn’t applying for medical school straight out of undergrad, I could only open my mouth and say nothing. I could not say that sexual violence had resulted in multiple Cs on my transcript.I said I needed some time. But that’s when I started to fall apart bit by bit. I took pills hoping to go to sleep and never wake up. I shaved so heavily into my skin I drew blood. I sent rants to my friends, pleading for an escape. None of what I did worked. I knew I had to pursue more education if I wished to go to medical school. A master’s degree posed more financial use over a post baccalaureate program. I went to graduate school, got straight As, and applied again.But every single time I applied, every time I was denied an application due to my academic record, every time I was asked why I had academic difficulties only to burst into tears...I remembered that night and what followed. While I can work on healing, medical schools will never forgive me for what happened.  And now, I can't either.", "is_suicide": 0}, {"created": 1568134522.0, "author": "incognito_anxiety", "title": "Am I depressed or am I faking my deteriorating mental health?", "selftext": "For the past few years I've constantly struggled through anxiety and episodes of depression. Getting through college without dropping out was one of the hardest things I've accomplished. And in the past year, my self-sabotaging behavior has almost shattered my blooming career.I've cried over nothing and everything, isolated myself from basically everyone, I've no friends, I've distanced myself from my social group. I rarely go out. Crippling social anxiety and body dysmorphia has made it impossible for me to go out. Explaining how I feel everyday is difficult. It's dark, spiraling, gloomy and heavy. I want to run away and start afresh. But I've zero self esteem or confidence to materialize it. I know I have some unresolved issues from the past, childhood. Neglect and being a witness to brutal domestic violence takes a toll on you even when you're a grown up.But the most painful fact is that I'm not where I expected to be by this age. Not being able to even give a fight anymore is eating me alive. I can't get myself to start any new projects or finish up old ones, I'm too scared I'm gonna fuck it up again. I'm living my life with the Pause button on. I know I'm not happy. But I haven't been clinically diagnosed with depression yet. Mental health is still a taboo topic here, in India. This retired \"psychiatrist\" whom I visited with my father the other day - without any having learned any history of his patient - bluntly said I'm \"not mentally ill, just running away from responsibilities\" and that I should \"learn to control my five senses\". Well, he also told my father that he didn't have OCD, when my father has been under treatment for the same for almost two decades now. I know the \"doc\" didn't know what he was talking about. But I'm still scared as hell because what if I'm playing tricks on myself and may be I'm just lazy and a procrastinator and not sincere towards my goals? What if these mental health issues are just excuse to get out of getting the job done? A small voice in my head has always whispered \"you're faking it\". And this incident has volumed it up.I know I should consult a good therapist but they are hard to find in this part of the country. Till I find myself a therapists, can someone please help me sort my thoughts out before my brain explodes?", "is_suicide": 0}, {"created": 1567997728.0, "author": "libertine131088", "title": "Searching for peace", "selftext": "I am a 30 year old male and I am trying to put one foot in front of the other each day. A brief overview of my story is as follows:Suffered an abusive childhood at the hands of my MotherMy father who I loved dearly suffered with addiction and I found him dead on his living room floor on my birthday almost 3 years agoI had a period of my life 18 - 26(ish) where I was off the rails to a degree, partying, gambling, recreational drugs, breaking the law, living in different countries and a few mental breakdown eposodesAround 26/27 I started working in the healthcare sector and supported adults including a man with cerebral palsy, I helped him make music as he is a rapper and helped him with allsorts, anything he wanted to do really also did his personal care, this gave me a great sense of purpose and looking back was the start of me gaining some sort of self worthNow I work for the NHS in a mental health unit as an an activities co-ordinator I have been here for around 2 and a half yearsI am currently a year into having counselling which has helped me recognise and accept the abuse I suffered as a child and also giving me self worth and teaching me boundariesI gave my Mum a letter about the abuse and havent spoken to her in around 4 monthsI have cut off some people in my lifeI have a 1 way flight to India booked for January 2020I am on a quest for peaceWorking in a super stressful environment even more so I have compassion fatigueHave a lot of self doubt around diseases and sexualitySuffer with a lot of guilt and shame from the pastHave suffered with Pure -O intrusive thoughtsI feel like I have stripped away most people and things from my lifeI accept it has been my choice and im hopeful it will all be worth while on my path searching for peace and self acceptanceIts hard aloneBut im going it aloneFor nowIf anyone has any words of wisdom of experience rebuilding life after adversity or solo travelling or overcoming depression and anxiety or finding love after struggle. Anything. Any inspiration or words of wisdom would be great.I know im doing really well under the circumstances its just neverending. Thank you in advance.", "is_suicide": 0}, {"created": 1567824100.0, "author": "Broken52222", "title": "Help me.", "selftext": "I've been with this girl V for 8 months (june 2017 to march 2018) and she was completely into me. I was preparing for government job exam(thats what we do here in India) and wasn't able to focus on her for a month.she blocked me from everywhere and now I started to crave for her I tried to contact her but she won't listen to me. I was so depressed and it became part of my life I stalked her from different account everyfuckenday and keep going on with my life 27x7 depressed.I also noticed  sad posts on her profile then somehow I found that there is no other guy,  after 9 months (december 2018) she messeged me and we started talking again as a friend (I started to feel great).on Fifth day I told her I still have feelings for her and boom I was blocked again.Everything fell apart. It was like I came back 9 months in a time machine. Again same feelings same depression and anxiety.I joined gym in January and keep going on with my life, slowly depression became sadness and stalking was there too.In February 2019 her best friend J added me on Instagram and we started talking day &amp; night, but I convinced her that her friend was wrong in this and she has mental tortured me.In May V unblocked me and wished me happy birthday, this time I blocked her I don't know why (I was not over her tho).On a good day june 29th 2019 I messaged her and we started to talk and we met same day as she was in my area.  It was not good as those glorious times but I was glad that we are friends. meanwhile I sometimes talk with her friend J too, she asked me how is it going betweet me and V and me, I told her that she don't talk with me that much and is there another guy, she told me there isn't. On August 5th It was V's birthday and my first day at college for masters we met and had a good time and in the evening when I reached home she messaged what was I asking to J. I said \"didn't she tell you what was I asking her\"?and boom I was blocked again. I checked insta facebook, phonecall was blocked too. J SHOWED MY MESSAGES TO V. I was not able to sleep so I sent 1 SMS \"just talk to me for a minute\" and emailed her that you forgot to block me here.At 2 am she unblocked me and messaged me to talk.I literally begged her to stay and explained her what happens to me when she is not talking to me. I can't go through all this again and again. She said \"so I should talk to you just because you become sad when I don't talk to you. What kind of excuse is this?\" I said don't talk to me just don't block me. That's what happened.She blocked me on whatsapp after some days maybe my DP was hurting her eye.But this last month became really hard for me this time its worse than last 2 times, I'm getting anxiety attacks. I read old chats I'm am not able to delete them coz what if she comes back and everything became like good like it used to be ?Instead of helping me J told me to forget V. My friends also say that. But how do I do that ?its not that easy to forget.I check her profile every hour and I'm definitely failing this semester. also I was not able to crack those goverment job exams,duh.What should I do guys ? I can't explain what I'm going through. Therapists are not common in India even if I get one, sessions will be so expensive that I'll not be able to afford.", "is_suicide": 0}, {"created": 1567318443.0, "author": "brushy5", "title": "I think I'm going to get kicked out of college in a week.", "selftext": "I don't know how to talk to my family about how I feel. It's hard enough to understand myself. Ever since I was a kid it's like I've been spectating my own life. Things always seemed to happen around me and I never seem to have any control. I was diagnosed with ADHD but my family didn't really believe in the diagnosis, and so I've never received treatment for it or anything.My parents are from a small village in India, even though I was raised abroad. My schooling was British, but when I got home I lived in a traditional Indian household. My sister assimilated pretty well but I never quite did. My sister was younger so every time my parents made a mistake with me, they could fix it by the time it came to her. Like when I was in Year 2 and our school held a 70s disco for the grade. I told my parents about it and they made me go in a costume from a South Indian 70s movie. I got bullied like crazy for that, because most kids just wore normal clothes. My parents had gotten an arranged marriage when they were young, and they always resented each other since they had nothing in common. My dad expected my mom to act like a regular Indian housewife, and my mom was always bored and lonely since there were no native Indian people living nearby. My dad usually expressed his anger by smashing things, although he never laid a hand on my mother. The bulk of my problems began when I started my GCSE's. It's the exam we do at the end of the Year 11 with the preparation beginning at Year 10. My parent's told me there was an issue with my dad's job and as a result we would be relocating to India at the end of the year. Unfortunately, due to the way the school systems work, I'd be pushed back 2 years. They said the best thing would be for me to do my GCSEs all in 1 year. It was a pretty bad year as I had to work twice as hard and my teachers made comments about me, claiming I was crazy for the attempt. Some made comments to my face, others behind my back.Without their support I lucked out and my grades were great. However, my parents revealed that the job stuff wasn't as big an issue as they had made it seem. And suddenly I was pushed up a grade and in a class with people who were 2 or 3 years older than me (I also started school a year early). My parents even went into school and chose my subjects without my permission. I only found out because a friend sent me a picture asking why my parents had come into school (I was sick and my mom claimed she was going to the doctor). The next 2 years of school was hell, as I was emotionally manipulated by a crush, my teachers treated me like a joke since I was the \"baby\" of the year group and I hated half my subjects. I spent those years arguing with teachers and my parents, and I always felt isolated. I also did terrible in class. I got accepted into medical school and have been here for the past year, but I'm only here because my parents want more than anything for me to become a doctor. I turned 17 a week before I got here. I was not prepared for any part of all this, and I've been severely depressed for the past year. I gained 16 kilograms in the past year, and I spent days on end alone in my dorm. I've been staying in university all summer to make up for all my setbacks this last year. I've tried, but I just hate my classes and I think I'm gonna fail my final exams next week. I'm torn because I hate it here but I also think my parents will make my life even more miserable if I fail. I feel terrible yet I feel no compulsion to study.I apologize for the rant but I've needed an outlet for a few years now. Thanks for reading.", "is_suicide": 0}, {"created": 1567167406.0, "author": "MugglebornSlytherin2", "title": "Suicide helplines wherever you are.", "selftext": "Danny, formely of www.depressionisnotdestiny.com, has compiled a list of suicide hotlines from around the world:Argentina: +5402234930430Australia: 131114Austria: 142; for children and young people, 147Belgium: 106Bosnia &amp; Herzegovina: 080 05 03 05Botswana: 3911270Brazil: 188 for the CVV National AssociationCanada: 1.833.456.4566, 5147234000 (Montreal); 18662773553 (outside Montreal)Croatia: 014833888Denmark: +4570201201Egypt: 7621602Estonia: 3726558088; in Russian 3726555688Finland: 010 195 202France: 0145394000Germany: 08001810771Holland: 09000767Hong Kong: +852 2382 0000Hungary: 116123India: 8888817666Ireland: +4408457909090Italy: 800860022Japan: +810352869090Mexico: 5255102550New Zealand: 0800543354Norway: +4781533300Philippines: 028969191Poland: 5270000Portugal: 21 854 07 40/8 . 96 898 21 50Russia: 0078202577577Spain: 914590050South Africa: 0514445691Sweden: 46317112400Switzerland: 143United Kingdom: 08457909090USA: 18002738255Veterans' Crisis Line: 1 800 273 8255/ text 838255", "is_suicide": 0}, {"created": 1566854024.0, "author": "nairit1996", "title": "I am suffering a lot!", "selftext": "I am 23 years old male from India. A little bit background about myself:1. I never had many friends in my life. I console myself by saying that friendships are temporary,we should rely upon ourselves,but deep inside I long friendship.I had 1-2 friends during my college days but they are all busy now after getting jobs.2. I am fat and unhealthy.When I was 18 years old I picked up the habit of eating junk food,cheesy pizzas whenever I felt depressed. It gave me a feeling of satisfaction and even after so many days I still feel the same.Eating is an hobby to me. I don't have any other addictions like drinking,smoking or playing video games.3.Since I am fat,I don't have any confidence for socializing. I feel that everyone will judge me and will laugh at me after seeing my protruding belly.That is another reason why I am not able to talk with people - irrespective of gender. I become so anxious when I am in public that in my workplace I don't go to canteen for having lunch rather I eat at the desk only.I feel that people will laugh at me if they see me eating.If I hear people chuckling,I think that they are probably laughing at me.I am 172 cm in height and my weight is 190 lbs.In my workplace,no one generally talks with me. I just sit in one corner and see my colleagues making plans.They are so happy while I am suffering. I feel bad that no one even asked me to join with them for lunch.Nor did they invite me for team lunch and outings.I had one girlfriend when I was 17.But she left me after one year when she got into medical schools saying that an engineer and a doctor will never understand each other. ( I am a Comp Science graduate btw).All this things revolves around my head everyday and the situation becomes more grave at night. I even tried to cut myself several times.I feel very bad when I think that I am unworthy of being friends with people.I would like some friends with whom I can have meaningful conversations.But alas! I don't have any. I fear that one day I will be consumed by my loneliness.Is there any way I can survive and end this suffering?", "is_suicide": 0}, {"created": 1566650820.0, "author": "piratecheese13", "title": "The world has a lot of big problems", "selftext": "North America’s US is in a constitutional crisis over someone who publicly told Russia to hack emails resulting in his election and is playing Hokey Pokey with...Chinese trade war who in a semi Civil war with Hong Kong.Speaking of trade, Britain is leaving the EU with no plans other than free trade with South Korea.South Korea is having trouble getting along with Japan. North Korea is deliberately firing test launches and all the world can do is remind them that nobody trades with them except probably Iran.Who wanted to sign a treaty but couldn’t so it probably has nuclear weapons by now.Speaking of WMDs; Pakistan and India are both armed and ready for genocide and what may be the first nuclear war.Africa has infrastructure problems due to hundred year old railways designed to get raw recourses to the ocean.The Amazon is on fire And lastly, Spider-Man just got cut from the MCU because Disney decided not to have Kevin Feige be as hands on in the next movie.", "is_suicide": 0}, {"created": 1566511400.0, "author": "Sad_Timeslip", "title": "Nothing was ever in tune", "selftext": "Nothing was ever in tune. People just blindly grabbed at whatever there was: communism, health foods, zen, surfing, ballet, hypnotism, group encounters, orgies, biking, herbs, Catholicism, weight-lifting, travel, withdrawal, vegetarianism, India, painting, writing, sculpting, composing, conducting, backpacking, yoga, copulating, gambling, drinking, hanging around, frozen yogurt, Beethoven, Bach, Buddha, Christ, TM, H, carrot juice, suicide, handmade suits, jet travel, New York City, and then it all evaporated and fell apart. People had to find things to do while waiting to die. I guess it was nice to have a choice.— Charles Bukowski in “Women\"", "is_suicide": 0}, {"created": 1566420880.0, "author": "prosilicus", "title": "At a really bad stage in life. Only option seems to be to end it.", "selftext": "Hi,So a bit about me. I'm an Indian who lived in Botswana for most of his life. I came to India by myself for a short visit but decided to complete my education here. That was the worst decision of my life. I scored an average grade at the end of school and got into a uni for a B.Tech degree. I fucked that up due to my mistakes and changed colleges halfway. Was going to complete it this year when my college fucked up. They told me I had an exam to clear which they hadn't told me about before even though I confirmed with the exam dept. about which courses I have left to complete. I might have to drop out of the college soon since my time limit is almost over. My parents are decent financially, they funded my brother's entire education (Undergrad and mba) in a foreign country. I do not want to live in India anymore but starting over from start seems bleak as I doubt I will get admission anywhere else outside of India. I really have no idea what to do with my life now. I'm turning 25 next month. If anyone has any advice at all please help.", "is_suicide": 0}, {"created": 1566070406.0, "author": "anatwinkle", "title": "How My Father’s Porn Addiction Led to Lifelong Depression", "selftext": "If you have kids, this might resonate with you a bit more. This a article I wrote to ' Fight the New Drug', an porn awareness organization and I hope you can read it all the way through. Here goes:From age 10-16, my dad came home every single day and watched pornography in his sinister locked room. This was in the early 90's, before the universal prevalence of the internet. I would return home from school and watch my favorite show, Oprah, and every day, he'd rush home before my mom returned from work with that unforgettable VHS shaped paper bag filled with a VHS porno video. My dad in general thinks everyone is stupid except him. Sometimes, he would drive with me to the actual video stores where he would buy the videos while I waited in the car. He was simply in his own world and so ignorant, never thinking how a child could react to such experiences.These years are a humans most critical and formative years neurologically, hormonally and physically. We were an immigrant family, me being the only one born in the US. My sister is 8 years older than me and she had left the house when I was 10. My brother is 5 years older than me and was never home as he was involved in all sorts of leadership activities, eventually becoming a huge entrepreneur. He was always callous and uncaring, especially lately. It all started with my dad.On a normal day, my dad would finish his business and come out of his locked room and want to hug me, but I was totally repulsed by him. I felt he was a scary nasty pervert. Daily, I would sit in the living room armchair feeling frozen and stuck, fully conscious of what he was doing, conjuring up instinctually horrific imagination, and this resulted in me boiling in my own fumes of hatred and contempt towards this man (and the world). I viewed him as a monster, along with his unhinged angry verbal abuse wherein he instigated brutal screaming matches with me and everyone. He would constantly call me retarded, sometimes in public and so loudly and viciously, that people called the police. As I grew up, I tended to refer to him as a psychological terrorist. Everyone in the family endured his temper, but only I endured the psychological destruction of him masturbating in the nearby room to me for 6 years.This had a lot of repercussions, definitely leading up to today.At that time, I didn't speak to anyone about it. I didn't know what to do. I figured no one would care or do anything about it (and I was right, my family knew this was going on). Because I never wanted to ever be in any close proximity, being alone in the car with him was like catatonic anxiety, or go on any family trips, plus I was very cold toward him, I was constantly scolded and resented by everyone. I was deemed an ungrateful brat. It appeared like I was a young teenager with extreme teenage angst and took it out on him. My family were all angry at me. My brother in particular.At age 10, my dad moved into my sisters' room with his giant size desktop, watching the beginning stages of internet porn. I was in the adjacent room and could never sleep, unable to stop thinking about what he was doing and I developed insomnia. For 18 years, I've never slept without sleeping pills.I didn't get my period until I was 16, a cause for concern by any doctor. For the rest of my life, I would get my period about 3-4 times in a year, and that has abundant unhealthy implications. The stress had caused hormonal damage as well.At age 13, I started pulling out my hair (seems like a reasonable response for a girl literally going crazy every day, not knowing what to do, having nowhere to escape to and no one to talk to). As my mom discovered my hair pulling, I explained it to her and she accused me of lying (i.e. that I had really shaved my head). Later, as it became undeniable, her reaction was to call me disgusting. There was no talk about what could have caused this and the idea of getting psychological help was nonexistent. Them being immigrants is not an excuse for ignorance. At the age of 17, I discovered my hair pulling was a condition that had a name... Trichotillomania (TTM) and now I know it is pretty common and it is a kind of self-harm or OCD (similar to cutting or a nervous habit like nail-biting). I’ll have this OCD for the rest of my life. I would clearly choose TTM over depression.I developed depression at the age of 10. As soon as possible, I got a job at 16 so I was able to be out of the house. I made a plan to graduate one year early from high school (by going to night school and summer school) because I was so unhappy, not good at making or keeping friends, anti-social, etc. I wanted to just escape... so I left the country. I saved my money and travelled to India and some other countries for 6 months. No one in my family asked me about university. However, after getting good grades during a year of community college, I was accepted to UC Berkeley and got a degree in cognitive neuroscience. Like a lot of others, I wanted to understand my own mind on a neurological level. After graduating, I moved to Israel alone (another escape from family). But a few years later, they all moved to Israel too.Cut to today, I'm more depressed than ever. My 'leadership' brother is now a CEO of a large company and has refused to use his connections help find me a job for the last 5 years. I believe he still sees me as that 'spoiled brat'. A few years ago, I tried to commit suicide, was in a coma for 2 weeks…..and later, made another attempt to 'escape family' by moving to Italy for 2 years.I confronted my dad around age 27 about his porn addiction once while we were in the car, and because he is so incredibly weird, he responded and said 'empires have fallen and risen over sex.' Whatever that means, it was just a bizarre, sad attempt at an excuse. He and my family think that his porn addiction had no effect on me (or that it shouldn’t have and I should have been stronger) and even when the head of a psych ward said so, they brushed it off as bullshit.I confronted my mom at age 30, asking about what she knew or if she knew (and she did) and tried to explain how it affected my whole life. She simply responded with ' but did he touch you?' From my studies in neuroscience and just from a basic understanding of human development, I know my dad's porn addiction triggered my depression. In my 20's and early 30's, I lived with mild depression but managed it well enough, living a pretty satisfying life. Later, life had hit me with a ton of bricks and it was all downhill from there, where I am suicidal again, my relationship with my family couldn’t be worse and I can barely function. I'm on disability and have social worker(s).My dad has calmed down a lot and has spent significant effort connecting me with all my social benefits for psychological services (to fix what he broke). But there will never be anything as healing as getting the validation from my family that something harmful and, dare I say, abusive was actually done to me by him and I will never get that validation. It is nearly impossible for me to come to terms with that.", "is_suicide": 0}, {"created": 1565890453.0, "author": "IcanSmellyourAnus", "title": "Things that make me happy that may spark a little bit of joy in you guys aswell", "selftext": "9pm sitting at a chicken bbq at the side of the road in india. A very warm and busy part of the city, the air filled with carbon dioxide as I was eating my last peice of rice and chicken, a very malnourished dog comes up to me. his eye missing and tail looks burnt but still wagging and damn guys it has the cutest eyes and i just couldnt say no.so i gave him the chicken and it happily went to its corner and started chowing down.i did not expect this but after a gruelling day in university i felt really happy something i havent felt in quite awhile now just pure happiness that i was able to bring happiness to this dog.thanks for reading", "is_suicide": 0}, {"created": 1565480293.0, "author": "living_a_lie_222", "title": "Looking for input", "selftext": "Hey depressos. Wanted to bounce this idea off yall and see what comes back. I’m at a low spot and not sure what next steps to take. Disappearing in another country and never coming back to my home country sounds appealing to me atm. Like India or Thailand or Peru. Im really not sure. I quit my job a few days ago with no replacement lined up. I’m not in love with my field.  I will not be able to realize that salary in my next job because I will not be able to get references from the place I just quit. It also looks like the relationship I’ve been pursuing will not be going anywhere. So I could sell my stuff or put it in storage and just go on a very long vacation and potentially not return. Nothing is right", "is_suicide": 0}, {"created": 1565351067.0, "author": "Idontcarekms", "title": "I am ashamed that I can't kill myself.", "selftext": "I don't know why I want to kill myself, I just do. I had a good upbringing. I was born in India to two hardworking parents and they always put food in my plate and made me feel comfortable throughout life. I was excited and happy about life until the beginning of the university. My parents pay a shitload of money for me to be here and I am extremely grateful. But I have wanted to kill myself ever since I almost failed out of school in the first semester. I don't have any reason to hate myself, I just do. Most people that are depressed have real reasons or have a fucked up past. I just don't see the point in living. I am in whatever rabbit hole I am in and I don't know how to get out. I don't have a lot of people I can talk to about this. I don't go to my classes and gave up on getting good grades. I just make sure I pass my courses because I wouldn't want my parents to be even more disappointed than they already are. I don't have any interests or hobbies. Last year, I tried to cut myself with a razor (stopped almost halfway through) and recently I wanted to kill myself by just spraying a can of pesticide in my mouth but I couldn't do it. Every time I look at a tall building, all I want to do and think of is to jump from it. I have even tried punching glass to break it and jump from the tallest floor in the building but that only gave me a sprained wrist. So yeah, I don't know why I want to kill myself. And I hate the fact that I'm too pussy to just do it. I also hate the fact that I'm the most fragile motherfucker around.&amp;#x200B;So here I am, in the middle of searching for Oxazepam, writing this hoping that I am not the only one who wants to kill myself for no reason.", "is_suicide": 0}, {"created": 1565070804.0, "author": "jjoolleennee", "title": "Can I get a prescription from a doctor in the USA while living in India ?", "selftext": "In having trouble renewing prescriptions here due to a prevalent doctors biases against medication. I have a friend in the USA who has a very similar history and symptoms and her doctor duly renews her prescriptions and in fact advises the exact opposite of what doctors here suggest - Once you find an optimal dose and since your condition is chronic, stick to it plz.Here docs once they find the med is working, they hurry to taper to a lower dose and eventually taper off. I've relapsed twice after tapering and the getting back on my feet has been an ordeal to say the least. They seem unmoved by this fact and it's FRUSTRATING.Can I have a doctor in the US review my case and pass on a valid prescription I can use to procure the medicines I desperately need here at home ?", "is_suicide": 0}, {"created": 1564622413.0, "author": "YourDailyGinAndTonic", "title": "If you have enough money and time to spare, seriously consider travelling", "selftext": "TL;DR: Travelling can give you a new experience and help with loneliness. It can help you feel more confident and see what truly is beautiful in life. If you're short of money, don't worry. Do your best and if you have the cash to spare travel to a closeby location where you may not have been.I don't know you. I don't how depressed you are and how much you can function. But if you are someone who is financially secure with enough vacation days, consider travelling if you haven't. It's very depressing to wake up with nothing to live for. At least for me, I don't sleep ok or perform at all because I'm completely in a rut. But I don't see life as not worth living for. I've had terrible days where I've wanted to end it all too but while I'm here let me see what treasures life has to offer. For me, travelling is an invigorating experience that makes me forget everything else that crushes me in life. You don't have to go far. You don't need to go halfway across the world. If you're in a huge country like the US, India or Brazil you have plenty of options in your own country. The experience of another culture, cuisine, arts, music and so many other things keep me alive and make me want to hang in there.If you have no friends, don't worry. Travelling alone can be perfectly safe if you do your research.  Another beautiful thing about travel is meeting other people. They don't ask you about your job or anything else that doesn't really matter. You can be completely open to someone who you may or may not meet again. If you're lonely, travelling can really help you by meeting all kinds of unique, beautiful people.Another bonus from this is that you have things to talk about with people after you're back home. You could feel less shy or anxious because you have a story to tell from your experience. If you're someone who's short of money and struggling to make ends meet, it's ok. I am too but I manage to make it work whenever possible. I do it in a very solid budget usually within my state. Whoever you are, best of luck and I hope can find a happy life.", "is_suicide": 0}, {"created": 1563843162.0, "author": "starwars9644", "title": "Fear of being judged.", "selftext": "Hi. I am new to Reddit and this is the first subreddit that I joined. I am a 23 y/o female living in India and I've been here all my life. I'm writing this because this feeling sometimes gets so overwhelming that it is hard to function properly sometimes. The fear of judgement. I have always been a rather submissive woman, obeying my parents, doing things properly and I also have this clinical need to please others. I want everyone to like me. My friends, family, everyone. Sometimes it gets super hard. I have always wanted to do something creative in life. But that was suppressed by my need to please my parents and impress my relatives. I finished school, scored well, got into one of the best colleges in my city and I am currently pursuing my masters in economics which I really really don't want to do. I'm doing this because of how people call me smart because I took this subject. Doing this because of how my dad's face brightens up because of this. But the sad reality is that I just don't fit in. I want to travel, make music, edit videos and make a living out of it. I know that I'm good at it. I've worked with various popular artists in my country but I get credit under a false name because I feel like I'd let my parents know about my double life. I wore a top in a music video that showed a bit of cleavage. My shot was of 2 seconds. The video was viral in my family and everyone was talking shit about me. It fucked up my self esteem real bad. Everyone judged me for my clothes and everyone thought the worst of my character. But the clothes that I wore that's ME. I LIKE DRESSING UP. I like showing skin and it makes me feel confident but it's such a taboo here in India. My family is going on a vacation to Malaysia in 3 days and I'm packing a bikini. I want to get some pics clicked without my parents knowing and I really do want to post them on my Instagram. My account is public because people like my style and my posts and I like the appreciation that I get for my creative posts. But THE FEAR OF BEING JUDGED COMES BACK. what if someone takes a screenshot and sends it to someone from my family? What if people say shit to my parents? What if I don't become the ideal wife for someone because of wearing a bikini on a beach?I'm so so tired of this. My anxiety is through the roof. Why does being true to yourself comes with so many terms and conditions?", "is_suicide": 0}, {"created": 1563702370.0, "author": "Haijal", "title": "Feeling particularly shitty today", "selftext": "I’ve dealt shitty thoughts and general mistrust since I was a teenager I guess from being bullied or whatever it was.  I managed to get through college and was doing pretty good in my career until I decided to move back to my hometown to be closer to family a little over a year ago.  I took a remote position and worked it for a year before I was let go because of the company outsourcing the position to India.So I’ve been living off of my savings for the last four months and yet to find a job.  I’ve been single since I was 24, without even a friends with benefits situation.  I’m turning 29 tomorrow.  I’ve spent most of my adult life alone and feeling like I’ve wasted my prime sexual years you know.  I’ve been pretty numb the last year but I feel like the weight of everything is crushing more recently with the thought of being almost 30.  /rant I’ll get back to my bourbon now 🥃.", "is_suicide": 0}, {"created": 1563451113.0, "author": "Pranav1999", "title": "Event security job is extremely triggering for me; because of the girls there", "selftext": "Hey y'all, hope you're doing okay or at least just getting byI wanted to share here the extreme emotional distress I experience whenever I am out in public. Especially when I am working in a high public environment like my new (and second) job as an event security guard.I am 19M. Never had a girlfriend or many friends. The one time a girl was interested in me, I blew it up.Whenever I am out, and I see all these beautiful girls, either by themselves or with other people, my heart sinks 50 feet in my chest. I end up feeling hollow and as if a dagger has been stabbed in my chest. The pain is so bad, that I want to put a knife in there myself and end it all. I start thinking about suicide and self-harm and how my relationship situation (either friends or romantic) is completely hopeless.This is one of the few situations which can make me feel so bad that I want to end it all.As a cherry on the top, it doesn't help that I have moved to a new country. Honestly, this is where I wanted to live all my life, it's awesome and I am grateful for it. BUT thinking about my relationships I start to feel alienated. As if no matter how much I wanted to be here and how well suited I think I am for this country compared to my own, I will never truly belong with the people here. Extreme alienation, cuz if I don't belong here, then will I ever belong anywhere? (India to Canada for those wondering)I guess I feel so terrible because I know I have what it takes to be social, to start and maintain relationships. But my depression gets the better of me. I may not be as socially skilled as I would like to be, but I know how to get better. The problem is, getting better involves rejection and failure, and as okay as I am with that fact, depression makes every setback feel like the end.I understand that in time these feelings will pass and hopefully soon I will be able to deal better with them.But for now, it hurts. Hurts too bad. And it always has.Thank you", "is_suicide": 0}, {"created": 1562924250.0, "author": "reallyserius", "title": "I have achieved more in the last year than any other year of my life and I still hate myself.", "selftext": "I turned 30 in October last year.I had gone through a rough breakup, and decided I needed to turn things around:* I lost 50 pounds and gained a lot of muscle. I look great* Ran a half marathon (my first) in &gt; 2 hours* Started performing really well at work. Get sent all over the world now, all expenses paid. Been to Israel, India, Japan, USA, Germany, Austria, all for work* Bought an amazing house I rent out. I hardly pay my mortgage, yet still get a lot of my own private space (own kitchen, etc)* Learned to ride a motorcycle. Got the nicest one I could reasonably afford. It's very fun* Tattoos. Always wanted em. Now I got em. Look pretty neato* Focused more on my music with the free time and managed to put together a few tunes I really like* I am well liked, well respected, have made newer, better friendsWhy do I still have the feeling that if I were to die/dying I wouldn't care? I don't think I'd ever commit suicide, but despite all the success I've enjoyed in the last year, I just don't fucking care. I don't even know why I'm doing any of this. I feel as though if there were nothing to achieve, life wouldn't be worth living, but everything I have worked for over the last year has left me feeling no more fulfilled. Maybe briefly, but then everything always returns to a dull grey hum.I used to be happy. What the fuck happened. I'm genuinely starting to feel as though I just don't deserve to be happy if I can do all that shit inside a year and still feel worthless.", "is_suicide": 0}, {"created": 1562874428.0, "author": "koltoboss56", "title": "What could be worse than losing your grand parent?", "selftext": "Well today after coming back home from school my mom tells me that my grandfather has been diagnosed with cancer...I am seriously speechless about this .... he is best grandfather anyone could have had ...he is 84 year's old and still perfectly healthy he doesn't even have diabetes or cholesterol ....and just all of a  sudden he is diagnosed with cancer....man he has been my constant support even in my worst times... When my parents used be angry at me it was grandpa who used support me in that kind of situation ....he has helped me a lot ....man I am seriously going to miss him...I literally feel like to go and meet him now but he stays in India and I am here in Dubai with my parents ..... Guys I seriously need help 😭 😭 i am trying to stay as positive as possible but the thought of losing my grandpa is just not going from my head I am not even able to concentrate on my studies......pls pray for him it's a humble request🙏🙏🙏", "is_suicide": 0}, {"created": 1562598199.0, "author": "truckplane", "title": "I might be about to crack", "selftext": "I am going absolutely mad... the pain is just too damn much!I don’t think I will be eligible for any emergency services till I cut my wrists ( I am in India), and I don’t have the money for psychotherapy, not that I believe it would help me much. My job is driving me mad, and I am afraid to just despite all the harassment I have to suffer (my employers owe me money which I haven’t been paid in over a year, and they never pay what they promise), and the fourteen hour work days. I am afraid that if I just quit, I will be unemployed for a while, and for an unemployed person, finding a job in the field of his choice is extremely difficult. I just can’t bear all this anymore.... I am suffering too much. I am spending hours everyday crying and shaking all over in fear, anxiety and self hate. Please help.", "is_suicide": 0}, {"created": 1561976774.0, "author": "MustHasUpvote", "title": "I don't know how much further I can go.", "selftext": "My father forced me into medical school and I've made it past 3 years. The third was the hardest because we started clinicals that year and that is just torture. Early mornings, on your feet for hours in rounds, doctors chewing you out in front of the entire ward if you can't answer a question, practical exams, having to study when you get home in the evening but still leaving enough time to sleep to prepare for more of the same the next day.I failed a rotation so I'm on break until the next opportunity to redo it comes around. The break started out okay. I got to catch up on sleep and pick up things I always wanted to try like programming and graphic art but these days my brain just can't stop hyperanalyzing my situation. How will this affect my scholarship, my father's disappointment, the impending return to hell when it's time to redo the rotation.Recently, I only eat once a day. I don't leave my dorm room much. My friends try to reach me but I'm never in the mood. I smoke weed to avoid the thoughts most nights. I can't remember the last time I we nt out to shoot some hoops or kick a ball. Used to watch pretty much every sport on TV, most I see now is the pop up notifications from my sports app. My girlfriend is upset about the distance.I have a great life. I'm in medical school, I have a girlfriend, I have a caring family, I have financial security, a scholarship, friends, no health problems. There are some people out here starving in Yemen, no medical care in Palestine, no water in India, no access to anything in Venezuela. What am I whining about? Why do I feel empty? Why can't I make it work?", "is_suicide": 0}, {"created": 1561915251.0, "author": "TheSexyTarantula", "title": "Chronic depression, Anxiety, PTSD, and no means to get any form of help", "selftext": "Im from india. My head isn't working straight anymore. I am but 19 years old. I don't smoke, drink or do drugs. The only thing that i was ever addicted to was video gaming, and that too in 8th grade. from 9th grade till 10th grade i was in an intensive residential jee coaching institute. Funny thing being, in those four years i was constantly sleep deprived, lacking proper nutrition and was always on my toes, but i was never depressed. quite the contrary. I enjoyed it. I had so much hope. My morale was never low. sure i had some low points, but never as low as I am now.  But then I fucked up the jee, even though i was one of the very top students, and my father refused to let me take a drop year. Now,  I have just finished my college 2nd year. Nothing cheers me up anymore. I am an athlete and i used to love to run. To me, running for a while always cured all and an ailment I head at the time. It doesn't work anymore. now i almost even despise it. i took mechanical engineering and i love my stream, but i even worse because of that.. my teachers suck, suppress all and any kind of creativity or individuality in thinking, and their humongous egos instigate most progress. I fear for myself. its been more than two years since i laughed. since i was anything but depressed. sometimes i sleep more than 10 hours and cant leave my bed, and sometimes i cannot sleep at all. I feel like i'm drowning, but i don't have anybody close enough to even talk about this. my parents are are quite happy about me but have no clue about this, forget how bad it is. Im broke and cant afford  professional psychiatrist. my parents, have in other situations have already made it clear that they never would support that form of help. None of my friends are mature enough or close enough to listen tome without being unsettled and leaving the conversation. i feel alone, so terribly alone. i feel like a loser that's nothing but a burden on the society. I always feel like i'm not worth the food i consume, the water i drink or even the air that i breath. i logically know that i am none of the above, my cgpa is the equivalent of a 4.0,  and actually mildly successful in academics and whatever i have taken up, but i not able to do anything to change the way i feel about myself. I need help. I cant get help. i don't know what to do. ", "is_suicide": 0}, {"created": 1561314083.0, "author": "batterman99", "title": "I just cannot take it anymore.", "selftext": "Hello everyone . My name is kartikeya , i am a 19 year old guy from india . These past 6 months have been too much for me I have continuously failed exams even though i put a lot of study in them . My father has been the epicentre of my depression and anxiety . He has been a terrible father . According to him , only paying for studies and food is a duty of a father .I have two elder sisters who also go through such anxiety because .Although they are very much talented, my father has continuously said mean things to them . My mother, who has been married to my father(now separated) for 28 years , has been a victim of domestic abuse by him . My father always calls me in the morning and tells me how useless i am and would end being a cab driver instead of a successful person . He once even went on to say that that he would have gotten me aborted . I am continously going down the hole of darkness and i do not know what to do anymore. He is pressurizing me to study in a bad college with low fees instead of a good college with a little high fees even though i put my soul to get in it . A thought has been looming over me for the past few days . A thought  of killing myself , because it is an easy way out . I do not get any mental and emotional support from my families and friends . Sorry for such distorted sequence of events .", "is_suicide": 0}, {"created": 1561291425.0, "author": "Throwmeawaythanks99", "title": "Passage from Lost Connections (a book about depression) that really resonated with me. For anyone working a dead-end job they hate...", "selftext": "I've never been into economics or politics but this bit gave me some hope and I wanted to share. It's about UBI (which I wasn't expecting to pop up in a self help book.) I'm not even sure if posts like this are allowed, but I couldn't sleep last night and it was 4am and I only read two chapters of this book on a whim yet it really stuck with me. Mainly directed towards those dealing with depression that somewhat concerns our shitty societal system, not being able to see a future, and hell-bent attitudes against change...I know this looks long, but I found it so fascinating I ate it right up\"In the middle of the 1970s, a group of Canadian government officials chose 1 —apparently at random—a small town called Dauphin in the rural province of Manitoba. It was, they knew, nothing special to look at. The nearest city, Winnipeg, was a four-hour drive away. It lay in the middle of the prairies, and most of the people living there were farmers growing a crop called canola. Its seventeen thousand people worked as hard as they could, but they were still struggling. When the canola crop was good, everyone did well—the local car dealership sold cars, and the bar sold booze. When the canola crop was bad, everyone suffered.And then one day the people of Dauphin were told they had been chosen to be part of an experiment, due to a bold decision by the country’s Liberal government. For a long time, Canadians had been wondering if the welfare state they had been developing, in fits and starts over the years, was too clunky and inefficient and didn’t cover enough people. The point of a welfare state is to establish a safety net below which nobody should ever be allowed to fall: a baseline of security that would prevent people from becoming poor and prevent anxiety. But it turned out there was still a lot of poverty, and a lot of insecurity, in Canada. Something wasn’t working. So somebody had what seemed like an almost stupidly simple idea. Up to now, the welfare state had worked by trying to plug gaps—by catching the people who fell below a certain level and nudging them back up. But if insecurity is about not having enough money to live on, they wondered, what would happen if we just gave everyone enough, with no strings attached? What if we simply mailed every single Canadian citizen—young, old, all of them—a check every year that was enough for them to live on?It would be set at a carefully chosen rate. You’d get enough to survive, but not enough to have luxuries. They called it a universal basic income. Instead of using a net to catch people when they fall, they proposed to raise the floor on which everyone stands. This idea had even been mooted by right-wing politicians like Richard Nixon, but it had never been tried before. So the Canadians decided to do it, in one place. That’s how for several years, the people of Dauphin were given a guarantee: Each of you will be unconditionally given the equivalent of $19,000 U.S. (in today’s money) by the government. You don’t have to worry. There’s nothing you can do that will take away this basic income.At that time, over in Toronto, there was a young economics student named Evelyn Forget, and one day, one of her professors told the class about this experiment. She was fascinated. But then, three years into the experiment, power in Canada was transferred to a Conservative government, and the program was abruptly shut down. The guaranteed income vanished. To everyone except the people who got the checks—and one other person—it was quickly forgotten. Thirty years later, that young economics student, Evelyn, had become a professor at the medical school of the University of Manitoba, and she kept bumping up against some disturbing evidence. It is a well-established fact that the poorer you are, the more likely you are to become depressed or anxious—and the more likely you are to become sick in almost every way. In the United States, if you have an income below $20,000, 2 you are more than twice as likely to become depressed as somebody who makes $70,000 or more. And if you receive a regular income from property you own, you are ten times less likely to develop an anxiety disorder than if you don’t get any income from property.“One of the things I find just astonishing,” she told me, “is the direct relationship between poverty and the number of moodaltering drugs that people take—the antidepressants they take just to get through the day.” If you want to really treat these problems, Evelyn believed, you need to deal with these questions. And so Evelyn found herself wondering about that old experiment that had taken place decades earlier. What were the results? Did the people who were given that guaranteed income get healthier? What else might have changed in their lives? She began to search for academic studies written back then. She found nothing. So she began to write letters and make calls. She knew that the experiment was being studied carefully at the time—that mountains of data were gathered. That was the whole point: it was a study. Where did it go? After a lot of detective work, stretching over five years, she finally got an answer. She was told that the data gathered during the experiment was hidden away in the National Archives, on the verge of being thrown in the trash. “I got there—and found most of it in paper. It was actually sitting in boxes,” she told me. “There were eighteen hundred cubic feet. That’s eighteen hundred bankers’ boxes, full of paper.”Nobody had ever added up the results. When the Conservatives came to power, they didn’t want anyone to look further— they believed the experiment was a waste of time and contrary to their moral values. So Evelyn and a team of researchers began the long task of figuring out what the basic income experiment had actually achieved, all those years before. At the same time, they started to track down the people who had lived through it, to discover the long-term effects. The first thing that struck Evelyn, as she spoke to the people who’d been through the program, was how vividly they remembered it. Everyone had a story about how it had affected their lives. They told her that, primarily, “the money acted as an insurance policy. It just sort of removed the stress of worrying about whether or not you can afford to keep your kids in school for another year, whether or not you could afford to pay for the things that you had to pay for.”This had been a conservative farming community, and one of the biggest changes was how women saw themselves. Evelyn met with one woman who had taken her check and used it to become the first female in her family to get a postsecondary education. She trained to be a librarian and rose to be one of the most respected people in the community. She showed Evelyn pictures of her two daughters graduating, and she talked about how proud she was she had been able to become a role model for them. Other people talked about how it lifted their heads above constant insecurity for the first time in their lives. One woman had a disabled husband and six kids, and she made a living by cutting people’s hair in her front room. She explained that the universal income meant for the first time the family had “some cream in the coffee”—small things that made life a little better.These were moving stories—but the hard facts lay in the number crunching. After years of compiling the data, here are some of the key effects Evelyn discovered. 3 Students stayed at school longer, and performed better there. The number of low-birth-weight babies declined, as more women delayed having children until they were ready. Parents with newborn babies stayed at home longer to care for them, and didn’t hurry back to work. Overall work hours fell modestly, as people spent more time with their kids, or learning.But there was one result that struck me as particularly important. Evelyn went through the medical records of the people taking part—and she found that, as she explained to me, there were “fewer people showing up at their doctor’s \\[office\\] complaining about mood disorders.” Depression and anxiety in the community fell significantly. When it came to severe depression and other mental health disorders that were so bad the patient had to be hospitalized, there was a drop of 9 percent in just three years. Why was that? “It just removed the stress—or reduced the stress—that people dealt with in their everyday lives,” Evelyn concludes. You knew you’d have a secure income next month, and next year, so you could create a picture of yourself in the future that was stable. It had another unanticipated effect, she told me. If you know you have enough money to live on securely, no matter what happens, you can turn down a job that treats you badly, or that you find humiliating. “It makes you less of a hostage to the job you have, and some of the jobs that people work just in order to survive are terrible, demeaning jobs,” she says. It gave you “that little bit of power to say—I don’t need to stay here.” That meant that employers had to make work more appealing. And over time, it was poised to reduce inequality in the town—which we would expect to reduce the depression caused by extreme status differences.For Evelyn, all this tells us something fundamental about the nature of depression. “If it were just a brain disorder,” she told me, “if it was just a physical ailment, you wouldn’t expect to see such a strong correlation with poverty,” and you wouldn’t see such a significant reduction from granting a guaranteed basic income. “Certainly,” she said, “it makes the lives of individuals who receive it more comfortable—which works as an antidepressant.” As Evelyn looks out over the world today, and how it has changed from the Dauphin of the mid-1970s, she thinks the need for a program like this— across all societies—has only grown.Back then, “people still expected to graduate from high school and to go get a job and work at the same company \\[or\\] at least in the same industry until they’d be sixty-five, and then they’d be retired with a nice gold watch and a nice pension.” But “people are struggling to find that kind of stability in labor today … I don’t think those days are ever coming back. We live in a globalized world. The world has changed, fundamentally.” We won’t regain security by going backward, especially as robots and technology render more and more jobs obsolete—but we can go forward, to a basic income for everyone.As Barack Obama suggested in an interview late in his presidency, a universal income may be the best tool we have for recreating security, not with bogus promises to rebuild a lost world, but by doing something distinctively new. Buried in those dusty boxes of data in the Canadian national archives, Evelyn might have found one of the most important antidepressants for the twenty-first century. I wanted to understand the implications of this more, and to explore my own concerns and questions about it, so I went to see a brilliant Dutch economic historian named Rutger Bregman. He is the leading European champion of the idea of a universal basic income. 4 We ate burgers and inhaled caffeinated drinks and ended up talking late into the night, discussing the implications of all this. “Time and again,” he said, “we blame a collective problem on the individual. So you’re depressed? You should get a pill. You don’t have a job? Go to a job coach—we’ll teach you how to write a résumé or \\[to join\\] LinkedIn. But obviously, that doesn’t go to the root of the problem … Not many people are thinking about what’s actually happened to our labor market, and our society, that these \\[forms of despair\\] are popping up everywhere.” Even middle-class people are living with a chronic “lack of certainty” about what their lives will be like in even a few months’ time, he says.The alternative approach—a guaranteed income—is partly about removing this humiliation and replacing it with security. It has now been tried in many places on a small scale, as he documents in his book Utopia for Realists. There’s always a pattern, he shows. When it’s first proposed, people say— what, just give out money? That will destroy the work ethic. People will just spend it on alcohol and drugs and watching TV. And then the results come in. For example, in the Great Smoky Mountains, there’s a Native American tribal group of eight thousand people who decided to open a casino. But they did it a little differently. They decided they were going to split the profits equally among everyone in the group—they’d all get a check for (as it turned out) $6,000 a year, rising to $9,000 later. It was, in effect, a universal basic income for everyone. Outsiders told them they were crazy. But when the program was studied in detail by social scientists, it turned out that this guaranteed income triggered one big change. Parents chose to spend a lot more time with their children, and because they were less stressed, they were more able to be present with their kids. The result? Behavioral problems like ADHD and childhood depression fell by 40 percent. 5 I couldn’t find any other instance of a reduction in psychiatric problems in children by that amount in a comparable period of time. They did it by freeing up the space for parents to connect with their kids. All over the world—from Brazil to India—these experiments keep finding the same result. Rutger told me: “When I ask people—‘What would you \\[personally\\] do with a basic income?’ about 99 percent of people say—‘I have dreams, I have ambitions, I’m going to do something ambitious and useful.’ ” But when he asks them what they think other people would do with a basic income, they say—oh, they’ll become lifeless zombies, they’ll bingewatch Netflix all day.This program does trigger a big change, he says—but not the one most people imagine. The biggest change, Rutger believes, will be in how people think about work. When Rutger asks people what they actually do at work, and whether they think it is worthwhile, he is amazed by how many people readily volunteer that the work they do is pointless and adds nothing to the world. The key to a guaranteed income, 7 Rutger says, is that it empowers people to say no. For the first time, they will be able to leave jobs that are degrading, or humiliating, or excruciating. Obviously, some boring things will still have to be done. That means those employers will have to offer either better wages, or better working conditions. In one swoop, the worst jobs, the ones that cause the most depression and anxiety, will have to radically improve, to attract workers. People will be free to create businesses based on things they believe in, to run Kotti-style projects to improve their community, to look after their kids and their elderly relatives. Those are all real work—but much of the time, the market doesn’t reward this kind of work. When people are free to say no, Rutger says, “I think the definition of work would \\[become\\] to add something of value—to make the world a little more interesting, or a bit more beautiful.”This is, we have to be candid, an expensive proposal—a real guaranteed income would take a big slice of the national wealth of any developed country. At the moment, it’s a distant goal. But every civilizing proposal started off as a utopian dream—from the welfare state, to women’s rights, to gay equality. President Obama said it could happen in the next twenty years. 8 If we start to argue and campaign for it now—as an antidepressant; as a way of dealing with the pervasive stress that is dragging so many of us down—it will, over time, also help us to see one of the factors that are causing all this despair in the first place. It’s a way, Rutger explained to me, of restoring a secure future to people who are losing the ability to see one for themselves; a way of restoring to all of us the breathing space to change our lives, and our culture. I was conscious, as I thought back over these seven provisional hints at solutions to our depression and anxiety, that they require huge changes—in our selves, and in our societies. When I felt that way, a niggling voice would come into my head. It said—nothing will ever change. The forms of social change you’re arguing for are just a fantasy. We’re stuck here. Have you watched the news? You think positive changes are a-coming? When these thoughts came to me, I always thought of one of my closest friends.In 1993, the journalist Andrew Sullivan was diagnosed as HIV-positive. It was the height of the AIDS crisis. Gay men were dying all over the world. There was no treatment in sight. Andrew’s first thought was: I deserve this. I brought it on myself. He had been raised in a Catholic family in a homophobic culture 9 in which, as a child, he thought he was the only gay person in the whole world, because he never saw anyone like him on TV, or on the streets, or in books. He lived in a world where if you were lucky, being gay was a punchline, and if you were unlucky, it got you a punch in the face. So now he thought—I had it coming. This fatal disease is the punishment I deserve. For Andrew, being told he was going to die of AIDS made him think of an image. He had once gone to see a movie and something went wrong with the projector, and the picture went all wrong—it displayed at a weird, unwatchable angle. It stayed like that for a few minutes. His life now, he realized, was like sitting in that cinema, except this picture would never be right again.Not long after, he left his job as editor of one of the leading magazines in the United States, the New Republic. His closest friend, Patrick, was dying of AIDS—the fate Andrew was now sure awaited him. So Andrew went to Provincetown, the gay enclave at the tip of Cape Cod in Massachussetts, to die. That summer, in a small house near the beach, he began to write a book. He knew it would be the last thing he ever did, so he decided to write something advocating a crazy, preposterous idea—one so outlandish that nobody had ever written a book about it before. He was going to propose that gay people should be allowed to get married, just like straight people. He thought this would be the only way to free gay people from the self-hatred and shame that had trapped Andrew himself. It’s too late for me, he thought, but maybe it will help the people who come after me. When the book—Virtually Normal—came out a year later, Patrick died when it had only been in the bookstores for a few days, and Andrew was widely ridiculed for suggesting something so absurd as gay marriage. Andrew was attacked not just by right-wingers, but by many gay leftwingers, who said he was a sellout, a wannabe heterosexual, a freak, for believing in marriage. A group called the Lesbian Avengers turned up to protest at his events with his face in the crosshairs of a gun. Andrew looked out at the crowd and despaired. This mad idea—his last gesture before dying —was clearly going to come to nothing.When I hear people saying that the changes we need to make in order to deal with depression and anxiety can’t happen, I imagine going back in time, to the summer of 1993, to that beach house in Provincetown, and telling Andrew something: Okay, Andrew, you’re not going to believe me, but this is what’s going to happen next. Twenty-five years from now, you’ll be alive. I know; it’s amazing; but wait—that’s not the best part. This book you’ve written—it’s going to spark a movement. And this book—it’s going to be quoted in a key Supreme Court ruling declaring marriage equality for gay people. And I’m going to be with you and your future husband the day after you receive a letter from the president of the United States telling you that this fight for gay marriage that you started has succeeded in part because of you. He’s going to light up the White House like the rainbow flag that day. He’s going to invite you to have dinner there, to thank you for what you’ve done. Oh, and by the way—that president? He’s going to be black.It would have seemed like science fiction. But it happened. It’s not a small thing to overturn two thousand years of gay people being jailed and scorned and beaten and burned. It happened for one reason only. Because enough brave people banded together and demanded it. Every single person reading this is the beneficiary of big civilizing social changes that seemed impossible when somebody first proposed them. Are you a woman? My grandmothers weren’t even allowed to have their own bank accounts until they were in their forties, by law. Are you a worker? The weekend was mocked as a utopian idea when labor unions first began to fight for it. Are you black, or Asian, or disabled? You don’t need me to fill in this list. So I told myself: if you hear a thought in your head telling you that we can’t deal with the social causes of depression and anxiety, you should stop and realize—that’s a symptom of the depression and anxiety itself.Yes, the changes we need now are huge. They’re about the size of the revolution in how gay people were treated. But that revolution happened. There’s a huge fight ahead of us to really deal with these problems. But that’s because it’s a huge crisis. We can deny that—but then we’ll stay trapped in the problem. Andrew taught me: The response to a huge crisis isn’t to go home and weep. It’s to go big. It’s to demand something that seems impossible—and not rest until you’ve achieved it. Every now and then, Rutger—the leading European campaigner for a universal basic income—will read a news story about somebody who has made a radical career choice. A fifty-year-old man realizes he’s unfulfilled as a manager so he quits, and becomes an opera singer. A forty-five-year-old woman quits Goldman Sachs and goes to work for a charity. “It is always framed as something heroic,” Rutger told me, as we drank our tenth Diet Coke between us. People ask them, in awe: “Are you really going to do what you want to do?” Are you really going to change your life, so you are doing something that fulfills you? It’s a sign, Rutger says, of how badly off track we’ve gone, that having fulfilling work is seen as a freakish exception, like winning the lottery, instead of how we should all be living. Giving everyone a guaranteed basic income, he says “is actually all about making \\[it so we tell everyone\\]—‘Of course you’re going to do what you want to do. You’re a human being. You only live once. What would you want to do \\[instead\\]—something you don’t want to do?’ ”\"TLDR: Economic insecurity/poverty is a leading cause of depression and anxiety and a main detractor towards having a fulfilling life. UBI could be an answer, but we need to make it happen. (Again, I'm not really into politics- I usually only occasionally prod at news about the hellfire state of the world with a ten foot pole to keep some semblance of sanity- so I'm sorry if I come off as a bit ignorant.)", "is_suicide": 0}, {"created": 1561123467.0, "author": "RavikiranCheema", "title": "My thoughts ( Feelings )?", "selftext": "Hey, Reddit community, I'm from India. I have strange thoughts and voices in my head, mostly what I feel is that they are my own words but spoken by people who were or are close to me.Here is a list :1. Songs - the high notes in particular2. Conversations that have never happened before with people and trying to analyse the 'intent' of the person rather than just listening to him.3. Random dreams - that I have missed a train.Can this be any sign of mental or health disorder.It's becoming a bother that I'm discussing only things about myself to my family and doing nothing else.", "is_suicide": 0}, {"created": 1560811075.0, "author": "abhinav_kohli", "title": "No clue where my life is going", "selftext": "So I have made this account just for posting this as some my friends/acquaintances use Reddit .Just wanted to share my thoughts cause today I felt like I have hit rock bottom.I am 20 year old guy living in India , I used to be pretty confident back in the day , I had motivation to do things ,was pretty good in academics and  used to play and watch sports regularly but from last 3 years I would say I have lost all my motivation to do things , have no hobbies at all and I don't know where I am going in life . I am pretty short guy (166cms) and  I started thinning/balding  at the age of 15 ( very bad genes ) so that didn't help at all .It just fucking broke me that how can it happen to me so early , I told my family about this and they started laughing , couldn't give a fuck . Now I am pretty much bald just very thin hair , I took some medication and went to a clinic as well but both sides of men in my family  started balding at a very early age( around 22-25) so it was pretty much all in vain . I don't even want to have children because of this , I don't want someone to go through want I went through ,being short as well as bald makes your life very uneasy both socially as well as romantically.Academically I am clueless what to do ,I am doing mech. engineering in a pretty reputed institute in India ( top 5) and I poured my blood sweet and tears to get there , now 1st year has passed and all I did was sleep because I found nothing interesting , currently i am doing summer internship in a very reputed company ( because of college) but I find it so uninteresting/ boring.i don't know what to do , it has been almost 2 yrs thinking this is just a phase it will get better , but it has gotten worse I think .All I do is sleep and watch YouTube all day , I have become so lethargic , so unispiring. I am opposite of what I was 2-3 years back.I also cut few people from my life as they very toxic and all I am left with are 2-3 decent  friends , but I don't have a deep connection with anyone with whom i can share my feelings.I just see myself from a year or 5 years from now and I don't have any goals ,no dreams , no plans. just every day now feels worse than the previous one Sorry for any mistakes , it my first post on Reddit .", "is_suicide": 0}, {"created": 1560397986.0, "author": "abcdef32", "title": "I made the mistake of attempting suicide and still living in India", "selftext": "Last Sunday. I had a bottle of xxxxxxx which I got from... Well, that's not needed. I drank 10ml.It has severe issues if you don't completely finish it off and die... So either don't do it or die.I unfortunately had a choice when it was only 10ml... The taste and the burning made me reflect.It was an impulse decision. Though suicide as a whole had been planned since... Months? And maybe all was not lost. Maybe I could still survive.And so... I chose to ask for help. Bam... There's a floor of tourists who call themselves my family.Forgive me but I am quite pissed off by them now because when I was clearly telling them that I was gonna have serious issues, they ignored and went home.And now they have the guts and balls to talk to me about how suicide is not the last way, have you tried yoga? Pray to the gods, dear, etc etc.More than a hundred people know. Out of this, I personally would have told... 20 max.And all this because I was kept under hospital care for less than 12hrs. Everyone under their breath is saying the same thing \"what an odd fellow, what a horrible thing he did! Didn't he think of his dear mother?\"GOD!! I want to tear my hair out...Yes, fucking uncle who hasn't set foot in this house since he and his brothers insulted my mother years ago...... I DID think of my mother.I did think of my step father. And I did think of everyone else.Suicide is not the last door. Most definitely not... Just next to suicide is the door of \"partial suicide - pity and pain welcome\".Suicide is just the door we choose when all the other doors seem impossible. When we've ran down the hallways and checked them all.In the span of less than a week... I've been called abusive, obsessive and possessive.All three seperately.Fine. I'm the fucking villain.Then let the villain be defeated!! No?? Why not?? Does your God say no??Will neighbours look down upon you because your son did something so bad that you cannot even name it!??Does the social opinion matter at THIS time?God... Fucking Indians. They only care about what their \"society\" thinks of them./Rant-----I'm certainly deflecting my problems... But yeah, I needed to let it out to any Indian out there: There are other doors if you look hard enough but if you choose this door of suicide... Please be careful. Have a talk with people who matter first... Gauge their reaction. Because no suicidal method is guaranteed to kill you. And if you live, you'll have to live in this shadow.I will, at least. Forever. My in-laws and their family know too... I mean the length that things spread.I didn't want to die. Not a single one says I'm glad you stopped. Everyone says why did you even speak the word \"suicide\"? Perhaps I'm missing something here.India is a nightmare.----Truth be told, I still want to live. I never really \"fully\" wanted to die. But the doors I see... They keep closing whether by my hand or automatically.It's difficult. I'll do everything possible to make sure I don't have to kill myself... But if I'm ever back here... Where months and months of suicidal thoughts all come out at once... If I am ever acting on impulse again, I will make sure to commit to it. No more half ass attempts where people either pity you... Or ridicule you.I just hope it doesn't come to that. I don't even want to plan again. I am on meds since a couple weeks... On therapy too. Hopefully I can just... See a door which I can actually touch.Doubt anyone is going to reply... I type too much, I know. To you who reads the last line only: Hope you're having a good day!", "is_suicide": 0}, {"created": 1560392493.0, "author": "LeastHunter", "title": "How I came out of My Depression as a Teenager.", "selftext": " I used to live in a small town in India and I was academically very good. Well for our town standards I was good. It all started when I joined University for Bachelors. First semester went by as I was struggling to figure out new life and the ***first semester*** results were out. I have failed in *4 courses out of 10.* It was a shock for me cause I have never failed in a course the least grade I got up to that point was B. I didn't knew how to handle it and I cannot share it with my parents cause I was such a bright student. I was slowly falling into **depression** but most of the teenagers don't know that they are **depressed** especially when they are experiencing it for the first time. In order to escape reality and keep my mind stable I used to ***Binge watch TV series until I was asleep*** and go to classes the next morning and I couldn't concentrate on classes as I was occupied by the fear of failure, letting my parents down etc. So I cleared 2 subjects from first semester but again failed in 4 subjects ***Second Semester.*** After clearing some every semester by the end of ***Sixth Semester*** I had 16 backlogs left and my future was uncertain and by that time I stopped going out with my friends and I used to feel like I was stuck in some box and looking real world through that box as everything moves so quickly around me. I used to get **nightmares** like not able to **graduate**. Then I realized something all these three years I was looking for some help. Someone to tutor or guide me to pass in those courses then I realized only person who can help me is myself. I sat down and tried to remember that happy go lucky kid 3 years ago and made a schedule for every thing and decided not to give up. I took a little time every day to go out and meet people, hangout with them so that I don't fall deep into it and I started to achieve my small goals and started feeling confident and after 2 months of my Eighth Semester, I ***successfully graduated*** with average GPA and I didn't stop there I have prepared for GRE for 2 months cleared it with 90% score and I applied for Masters degree in USA and I hold MS degree with 3.6 GPA now.", "is_suicide": 0}, {"created": 1560123274.0, "author": "CallMeMisa", "title": "I got 99 regrets and I am one of them. :)", "selftext": "No one ever told me how hard getting better is. Everyone told me \"Just chill. Relax. Take the day off. Spend time with yourself or your cats. Do something you love and you'll get better in no time.\"Okay then. I was bedridden for a month. I chilled. Relaxed. Took 30 days off. Spend time with myself and my cats because no one paid me a visit except my aunt. Painted. A lot. And OHMYGOD will you look at that?! I. Am. NOT. Better. In fact, I'm worse. I'm miserable. I don't wanna get out of my bed. I don't wanna talk to people.  I don't wanna do anything productive because I feel like I'll fail before I start it. I can't remember important things. Can I remember anything from my syllabus? Nope! Can I tell you about this one manga I read 5 years ago?  YES! And what's worse is how my mother, who is a psychologist, insists I'm faking my depression to get out of things because, hey, since I am a teeny tiny bit smart, apparently, I am so fucking gifted. It's irritating. And annoying. She calls me name. At times, even asks me to go and whore myself out because that's what I'm good at as I can't score the highest in class.My therapist told me that I should get away from my parents and how the fuck do I do that?! I'm from India. I'm a girl. My parents won't let me go. So, I thought, \"Hm. If I can't go, how about I adapt and try to tolerate everyone until I get my degree, get a job and gtfo?\"Well, HAHAHAHA! That failed. I can't do it.The more I work on myself, or try to, I realise how much I fucking hate myself. I can't physically bring myself to love me. And, two days ago, my boyfriend said, \"How do I know you love me? You can't even love yourself. How can you, possibly, care for my feelings when you don't care about yours?\"It hurt. Like, is the fact that I'm not killing myself, doing my best to not cut myself, I am not overdosing on pills and instead, facing him and being vulnerable around him not enough?I just regret being born. And, it's so weird, like, I don't know what the emotion is? But, my mother often says that she'd be happy if I were a boy. That she regrets giving birth to me. Well, gee mom. I didn't ask to be born. I am always trying not to give up... But.. I don't know how long I can do this.. I just don't.", "is_suicide": 0}, {"created": 1559518136.0, "author": "Harakiri09", "title": "I [36 M] am lost and i dont know how to find my way back", "selftext": "I am going through crisis. Now my problem may not be the most severe in nature, but i think they are impending my life in big ways. I am a 36 year old male, of east Indian origin, living in Michigan for over 9 years. I have a good job, in the mid-level managerial position. I earn good amount of money. My life is comfortable, where i can afford pretty much anything that i desire for. I have a very good family(back in India) and they are supportive of me. I think i have always been depressive/pessimistic in my life. But my major problems started when i got engaged to a girl from India in my late 20s. Immediately after my engagement, i was diagnosed with diabetes. This, along with the fact that i was living outside of India, the girl decided to end the engagement. Few years down the line i was introduced to another girl and after short deliberation we decided to get married. This was again an \"arranged marriage\". My second engagement and first marriage did not last long and after almost 2 years of marriage we decide to part ways. Now I am divorced and live alone.My current situation is miserable. I have no interest in doing anything. I have absolutely no one in the radius of approximately 500 miles of where i live, whom i can call a friend. I just get by my days one day at a time. I dont leave my apartment very often. The best time of life is when i am at work, surrounded by my colleagues. I have no social life. To top it all, i have become hypertensive and on medication. I am decent looking man with fat body. I try to go to gym, but then i feel so down by the end of the day that i just dont leave my apartment. I have given up on feeling and looking fit. Why bother!!!I crave for companionship, but dating has never worked for me. I dont know how to date, never dated in my life. I have joined multiple dating sites, but never ever received interest from anyone. I am not an introvert, but i dont know how to approach opposite sex. I am not open to building new relationships, even a friendlier relationship with same sex. I used to be active and fit. Now i dont want to do anyting. I have lost my mojo, as they call it. I need help, but i counseling has not worked in the past for me. It seems i will probably end up a lonely old man and die alone.", "is_suicide": 0}, {"created": 1559478160.0, "author": "dental_work", "title": "After extreme depression for the past year, today I found hope.", "selftext": "&gt;Because everyday, children walk in to this schoolhouse to glimpse their futures, to ask for hope. They may not know they need it yet, but they do. And I'm here to tell you that hope is real. In a life of trials, in the world of challenges, hope is real. In a country where families go without health care, where some go without food, some don't even have a home to speak of, hope is real. In a time of global chaos and instability where our faiths collide, as often as our weapons, hope is real. Hope is what gives us the courage to take on our greatest challenges, to move forward together. We live in cynical times, I know that. But hope is not up for debate. There is such a thing as false science, there is such a thing as false promises, I am sure I will have my share of false starts. But there is no such thing as false hope. There is only hope.-Matt Santos *The West Wing*I always really really liked that speech, because hope can never be false. For the past year I've been so depressed. This is country, my home, the one my father worked so hard to bring my family to from India, taking shit jobs to give us a better future than he had growing up in a poor 13 person family.  I was born in this country, fun fact my birthday is actually the fourth of July. I loved this country so much. And since Trump was elected I was extremely depressed. Things seemed to get worse and worse. Everyday we found out that he betrayed us more and more, he was a rat who sold our country out to the Russians and billionaires. Every day I would see 5 more headlines and get more upset. So defeated that I couldn't do anything about it. My wife and I went of birth control a few months ago. We want a family so bad. But every day I think about how much worse it's getting out here. Every day I see another video of a cop shooting a black kid for no reason. Of a white supremacist getting on stage and I stead of being laughed at *getting cheered on*. I have a good job but not a formal education (yet). I talked to my wife about leaving. Trying to emigrate to a country that had it's shit together so we could give a better life for our children likey father did to me. However with just a highschool diploma I doubt I'd get a visa anywhere. Nonetheless I didn't want to see my country crumble and fail. I wasnt just sitting on the couch griping. I was fading in and out of the real world lost in terrifying thoughts. I was crying and distressed constantly by myself. I did not want this to happen. I just felt so beat down, there are so many problems. What can I do. There's no way I can help, can fox anything, this country was destined to rot and implode. But today went on to some Democrats campaign sites and I saw hope. I saw them vocalizing the very issues I care about. Describing perfect what I believed this country should be. I saw hope. I know this isn't a typical post. I'm not sure if this is allowed. I'm not trying to change anyone's mind or stand on a soapbox or canvass for votes. I just wanted to share with someone, after months of feeling destitute and depression that today I had a glimmer of hope. And I'm going to do what I can to keep it alive Thank you for listening.", "is_suicide": 0}, {"created": 1559075199.0, "author": "Thorhammer35", "title": "Part Venting, part something that genuinely troubles me.", "selftext": "So, there is a bit of a story here so this might be long.&amp;#x200B;Firstly, I live with my parents and sister at the moment, parents are in 60s, I am 20, sis is late 30s. My parents are from an extremely conservative and old fashioned environment. Where I'm from the general attitude to things like depression and mental illnesses is that it's fake.&amp;#x200B;My dad is well, he's an alcoholic who smokes heavily, and abuses drugs. (IMP Note: Abuses in the sense that he doesn't take medication which he REALLY needs to take out of pure stubbornness rather than well. Take it.)&amp;#x200B;He has been hospitalized 11 times so far for it all. And his general attitude is one of someone who is such an arrogant, toxic asshole, that me, my mother and sis argue over who has to stay with him should something happen. His own friends, coworkers and brother have cut him out of their lives almost entirely now. We're pretty much all he has left but that doesn't stop him.   Also VERY IMP NOTE: The culture of where I'm living right now (India) is that the elder of the family can do whatever the fuck he wants, and that the younger family members have to deal with it. Combine that with  the fact that he's the father and he has a free pass to be a complete and other toxic waste of humanity.&amp;#x200B;My mother is one of those extremely melodramatic people who enjoys tragedy in her family so she can create drama and lament to her friends. and my sister has the delusions that despite all that, we can be one big happy family (we can't) so yeah no one ever bothers to keep him in check.&amp;#x200B;Mother has the above thing, as well as the fact that she's extremely old fashioned and pretty much a terrible human being so yeah, she is not fun either. More than enough times she will actually try and squash you down and make you feel like shit if she actually she's you being happy. A fact that both me and my sister have noticed and commented on.&amp;#x200B;Sister is a little better, but she was raised by a boarding school, as well as my dad's brother and his wife. So she has almost never had to deal with them until 2-3 years ago when we all moved in together for now. So when it comes to the say of who is right on who is a bad person, her kid brother or her own parents. She sides with the parents.&amp;#x200B;Last year I used to go to a public hospital to get antidepressants as you can imagine all of that has well...&amp;#x200B;I'm depressed, suicidal, anxious most of the time, got a lot of pent-up rage, and am an insomniac, you tell me.&amp;#x200B;So for a few days I used to go there, and get meds and everything was fine, until my mom one day found them. Her immediate reaction was akin to the \"Depression is fake.\" mentality she has and just said that I was 'Scared for exams because I never study' she told my sister later on about this. She was initially supportive and took me to a psychiatrist and got me medication.  This went for about 2 weeks, then they stopped everything, and took me off all the meds cold-turkey. and declared that I was lying about it all, and that I was doing a fake drama about mental illness because I was lazy and don't want to work hard.&amp;#x200B;&amp;#x200B;&amp;#x200B;So yeah.... that's the reason why the only thoughts that genuinely give me relief right now are of them suffering.   I might be a horrible person for that, but I stopped caring about that at this point because at least now I know for sure the kind of people \\*they\\* are.", "is_suicide": 0}, {"created": 1558777099.0, "author": "RoUrBoat123", "title": "Someone help", "selftext": "I just need someone to talk to. My parents hate me. I’m a failure socially and at school and I have no motivation. My family in India has disowned and hate me for coming out. My parents friends kids just got into colleges like UC Berkeley and I can’t fucking pass some classes. I just want the pain to stop. Please. This subreddit is my last resort and I want to talk to other people who are experiencing the same thing. I want it to end", "is_suicide": 0}, {"created": 1557374711.0, "author": "DukeSamuel", "title": "I have decided to end my life with Pottasium cyanide", "selftext": "I have decided to end my life with Pottasium cyanide. This is my first post here and probably last. I love this community I come here daily just to read and go through all the different experiences people share. Now back to my story, I will keep it short. I am 28 years old from Delhi, India. I didn't have bad childhood or any problems I can think of. After completing my school I joined merchant Navy in hope of completing my dream of having a lot of money so that I can have and give a good life to my parents. Ever since I was in merchant Navy I felt this incline towards negativity and that's the time I started smoking too, I don't do drugs although I have tried but they ended up making me more miserable in my head. The negativity continued for a while and I had bad experience with bully superiors on my 2nd ship they used to make me work 20 hours a day non stop manual labour with no chance to go anywhere ( since I am on ship only option was to jump in ocean). While this was going on I even tried to break my own wrist with an iron wrench so that I can get off the ship due to medical emergency but that didn't work out. After 3 months that  horrible period ended and I went home to study and do courses to give exam for becoming an officer. I passed all exams just one interview left and I still don't know the reason to this day I never was able to give that exam. I used to book it but then lost confidence in myself. After 3 years of attempts and living on mere cents of money I decided to try my luck in having a job near home till I can finally get back in navy. Worked for more than 3 years. 3 different jobs .did good at jobs but those jobs were just sucking the life out of me. Constant calling. 15 hours a day labour. 2 hours driving. Negativity rising inside. All my life I always wanted to have someone to love who loves me back too but I failed again and again. Falling for girls who already loves someone else. To cope with this I started mobile gaming , a game called Clash of Kings. I played this game just as fun in beginning but as you know these games require money to play as you level up and want to stay in competition. In my desperate attempt to get over my negativity my lost confidence my issues I played this game and I actually enjoyed and got too much involved in it .I met so many people from different countries made many freinds and also met the most wonderful woman of my life. I will call her Bonnie here . Bonnie met me in the game in September 2017. She is 7 years older than me with a kid. The most amazing person I have ever seen. Always helping people In game in real life. Smart, beautiful,and angel in small words. We connected almost immediately. She wanted me to get better in life. She supported me . I quit my job and decided to go for a career of my liking and she supported me emotionally and financially. I decided to go and learn tourism industry which is my passion and skill. We tried together for more than an year. We have never met but loved each other. Then the problems started I was too much passionate for game and this was coming between my sleep. On her advice I went to a psychiatrist for the first time in my life and found out that I have been in severe depression since last 8 years of my life. Oh btw I forgot to mention above that I tried to end my life 2 times before both by taking heavy dosage of paracetamol or Tylenol as in USA. Didn't work. So to make this long story short . I failed at everything in my life repeatedly. Relationships freindships work .. everything I failed..and now due to continuous sadness I lost my woman too.. there are a lot of things in between which I just can't write as it will be too much to write. Taking pills for depression or trying therapy I have tried all. I just don't see any purpose in life. I am actually not even sad anymore. I don't even cry or feel like crying. I just feel no purpose . nothing. I feel totally empty. So I have decided to buy Pottasium cyanide. Also I forgot to tell that I have a lot of money problems such that I cannot even afford to go to doctors anymore since insurance doesn't cover it and I have no income and no will to start working again. I am poor basically. So what I decided is take Pottasium cyanide and use my credit card to go somewhere nice in the hills or maybe Goa and then just 2 3 days of living my life partying and then drink the cyanide. I feel inside this will be complete life for me. A feeling of closure. I don't know why I am writing this here or what I wrote above. Just wanted somewhere someone to know or remember me or maybe remember me for a very short period of time. Love you all. See you on the other side ❤️❤️", "is_suicide": 0}, {"created": 1556826379.0, "author": "dankindian9789", "title": "My Result", "selftext": "Hello guys this is my very first post on this subreddit..today I got my results which is very bad ...my parents are upset..they don't know what to do now .I gave my 100% nd worked hard throughout the year..paid. A lot of money..gave almost everything I could...I had a really harsh year thinking about what will be my future..all my friends and relatives did well but I disappointed my parents.Now my parents are forced to lie to anyone asking my result...I am deeply hurt and broken. I gave up my social life and studied wholeheartedly but now it's now finished...I think I will never get a job or even a good college.My parents have given up nd are cursing me for my failure..I can't really express how depressed I am..I have noone to talk..all my dreams are shattered and now I don't know what f*** do I do..I am constantly having bad thoughts of finishing my life because I am a headache for my parents..I have wasted my parents hard earned money..I wish I have never been existed life is very cruel...my Mind is totally blank right now..my eyes are filled with regret...every f**\"\"\" friend of mine are sharing Thier wonderful results online and asking me to show mine....I don't know how to recover from this trauma.....student M(17) india", "is_suicide": 0}, {"created": 1556409635.0, "author": "paribadre", "title": "Where do I go?", "selftext": "So I'm from India and live in LA and I'm at university so I've got summer break. I don't wanna spend my summer in LA because its just too suffocating and I'll barely have any support system. I don't wanna go back to India even though I've my family there because it feels like that place is completed for me and I've accepted everything the place has to offer. I just feel like running away to a quiet place and not be in contact with anyone for a few months. I feel like I need time to gather my thoughts.", "is_suicide": 0}, {"created": 1556219478.0, "author": "DaughterofRiverSong", "title": "Reflections: A Poem", "selftext": "I suffered a bout of depression a few months back and felt that I was a useless addition to this world. I nearly pulled the plug on myself, but stopped short of it. I'm now recovering. And I want to help others. I wrote a poem about it.REFLECTIONS A reflection,Tear-stained and smiling,Hiding the screams,The night brought so oft,A map of scars faded and fresh,Like crimson sprigs of fern,Braiding the pale wrists,A network of untraversed roads,To an abandoned heart,Haunted,Uninhabited,Freezing the soul,Suspended in an alien reality,Brimming with laughter and joy,So near, yet so far,If only it was possible,To touch the warmth outside,And disrobe this funereal insulation. A reflection,Tear-stained and smiling,A dagger clenched in the hand,A newfound strength,To commit away,The mind promised,The final pain,The final scar,A little more pressure,And the steel incised the tender skin,First a slight drizzle,Then a steady darkened flow,Seeking refuge in the undusted carpet,A confluence of pain and peace,Ebbed along,The heart throbbed,Trying to save what remained,But the soul was already escaping,For it had waited for so long,For this elusive redemption,And here it was,At the very threshold,Of what it had only dreamt,So the heart finally gave up,Razed down like a falling house. A reflection,Tear-stained and smiling,Held a photograph,Damp with grief and regret,A memory so unreal,It didn’t belong here anymore,If only she had known,How much she is missed now,How many hearts were stabbed,By the dagger she used,Bleeding tears for so many,Breathing as if it were a sin,Living in a limbo,Wishing ghosts were real,To hear her forgotten laughter,To hug her and tell,The world was always there for her,If only she had welcomed it in.(If you are in need of help, you can always talk to me. There are people who are ready to fight with you and survive it with you. You can also try out these suicide hotlines:India: +91-22-27546667USA: 1-800-273-TALK (8255)UK: 116 123Canada: 1-800-668-6868)", "is_suicide": 0}, {"created": 1555849820.0, "author": "seanchrann", "title": "How do I ask for help from my loved ones?", "selftext": "I've been struggling with depression for a very very long time and have been seeing a therapist once a week for a couple months now. The past couple of weeks have been particularly bad, I've broken down crying multiple times and I feel like I have no motivation at all. I don't think my family or my SO really understands why, and so I find it hard to explain them or even ask them for help. A lot for the times it seems like I just get hit with a wave of sadness and can't stop crying for hours. My family/ SO ask me why I'm crying but I don't usually know myself. I get very nervous trying to ask for help and I'm not so sure what to ask for either. I feel like I might be burdening them.[Edit] Things have been getting better, I'm slowly getting through to my SO but my family will still take a long time. They're immigrants from India to the US. In India there wasn't much education or understanding about mental health untill recent years, so I've been trying to figure out ways to show my parents that depression is real and serious. Things get better one day at a time and I'm just working on staying positive.", "is_suicide": 0}, {"created": 1555105198.0, "author": "ivarknat", "title": "Please help me. This is extremely important.", "selftext": "I'm an Indian student living in Australia with extreme depression. I did my bachelor's in Medical from India cause my parents wanted me to do it. Now, I'm doing Master's in Health Management cause it sort of gives me a chance to get permanent residency here. I know it seems very shitty but let me explain everything from start, so please read the following and save me. I have few things to make you understand me better. I don't like people, can't stand them. I don't like going to city. I hate crowd. I can't make eye contact. I don't have any feelings left except for sadness and sorrow. I have approximately paid $22000AUD to come and study here. I knew the circumstances and people I would face and I thought I could do it but I can't. I didn't want to live in India among fucked up minds. I know it seems bullshit but you don't know what it was like to survive there. I don't think I would take so much space if I don't go back but I know every other Indian also think about it too. They want to stay here forever but believe me I'm not like them and yes I know I'm not special. I don't want to live in society and be a part of it, I just need nature and peace. I just want to follow my passion of writing and leave everything. I don't want to put anybody in bad light especially Indians for a residency thing. I'm a fucked up person and I couldn't care about anything else even if I wanted to. Sometimes, I think about disappearing and not coming out for several years. If I do this, my parents would have nobody as I'm their only child and that's the thing, that I don't have any feelings left for them and I know this is extremely fucked up thing. That's why I think about committing suicide but I don't even have courage to do it cause there are so many things I need to do before I die but this damn depression is fucking me everywhere. I don't want or need anything. Please free me from all these fucking liabilities, from all these obligations, just let me live. I don't want to talk to psychiatrists, I know what they'll say. I can't live like this, don't know what love is or if it's real or can it save someone. I think of it as an illusion and only this melancholy is real. Now, I know how the people go crazy and lose their sanity. I can't fathom all of my thoughts into this post and you can't understand what I'm trying to say as this medium of interaction is still somewhat limited. But, please, still try to understand what I'm saying. I won't be able to live this way for long. The conclusion is: I can't study this course, it's so uninteresting and the amount to do it, is so high. If I pay back $22000 to my parents, they would still think of me as a disappointment as I couldn't complete my study after I always wanted to go abroad to study. I'm in total depression, you don't how it feels to just die every second. I can't explain what this is. I just need someone to sit with me and understand me and give me the answer whether right or wrong and kill me. This Earth is a fucking cold dead place that only gives you reasons to die. There are still so many things that need to be said but if I  write them, it'd make no sense. I don't want to go back and I don't want to be a part of society here. I just need a fucking hippie life without a care in the world, smoke weed, write something, make something and die.", "is_suicide": 0}, {"created": 1554228653.0, "author": "hani_ss09", "title": "I feel like Im depressed but I somehow feel like I'm not", "selftext": "First , I'll start with how I'm right now. I havent interacted with my school friends since feb of this year and it was only to talk about exams and nothing else. I havent hanged with anyone since oct of last year. Im not eating at all. Seeing and smelling any food even if it was my fav makes me cringe. I can go entire days on one meal or less. Ive started to doubt myself a lot and I'm getting regular panic attacks where i get suicidal , my body starts to shake , i get headache and i cant do anything but cry and get hopeless. Ive never tried to self harm but i do get thoughts every now and then. nightmares are something im so used to at this point that theyre not even scary. I was getting sleep paralyzed as well to the point where i got used to it. I even have problem falling asleep and even when i do sleep i cant sleep for more than 5 hours. last year i was super clingy , i used to make sexual jokes to make others laugh and i used to seek attention from everyone. i was never bad at concentrating and studying. but this year i cant help but feel down. its now normal thing. isolating myself from everyone , leaving everyone on read , not picking up phone calls and making up excuses. i just changed and became complete opposite to what i was last year. last year i tried to fit in and this year i dont care about anyone anymore. i even get super bad mood swings. like im all laughing one moment and next moment im either suicidal or want to murder whoever tries to talk to me&amp;#x200B;so now ill start with a bit of my backstory and then a bit about my parents cuz for me theyre the reason. so im from india and mental health issues are something asians take seriously. i was a super loud and energetic kid. i was quite good at drawing and creating stories and i was always proud of my creations be it a story or a manga. i used to represent school in art competitions as well and my art teacher had a lot of confidence in me that ill be super successful if i pursue something in field of anime. since 4th grade i watched a lot of anime getting inspired by them and started to write my own mangas as well. i was above average in studies as well so my teachers used to let me skip their classes to draw if my grade werent suffering which they never did i was always around 85%.&amp;#x200B;for my dad my grandpa died when my dad was around 17 years old and had to take care of grandma who was abusive and his siblings who worked with him. thats all i know from his past but my dad is extremely narcissistic where he believes hes always right. he refuses to believe facts and gets angry whenever i put facts in front of him. i even told him that i had panic attacks and i was anxious for exams and that i had confidence issues and i wanted to get therapy but he told me \"just dont be scared\" and continued to yell at me for being scared and started to compare his past to mine. he always points out and mocks whatever i do. im not even exaggerating. he told me that coffee doesnt have caffeine and that its a lie and doesnt believe doctors as well cuz he \"knows\" from experience. he even mocks the way i study like if im lying down and reading a book he will mock me. if im reading articles on laptop he would mock me to read a book.&amp;#x200B;for my mom she had a super fancy and comfortable childhood. my grandparents are super lovely and they live in expensive place. so my mom is basically someone who wants best for her and doesnt care about anyone in family. she also doesnt care about facts.  she would always fight with dad for not getting enough salary when we are in no debt. she always compares dad to his brother and its always saddening hearing them fight everyday. it doesnt get violent though. its still humane enough but still it started to bother me. she always act like a small child who needs people around her and if she needs something done then it has to be done instantly or else she would turn it into drama and make herself look like victim. she makes fuzz out of every small thing. last year i had a lovely girlfriend who told me to write my feelings in diary and my mom found out about it and started to mock me for thinking about self harm.&amp;#x200B;so basically i never had any say in any of my life decisions and i know they want best for me but i still feel like i cant do what they want anymore. ive graduated from highschool and wanted to pursue manga art and wanted to move to japan but my parents lied that they would let me. now for 1 straight year theyre constantly making me change my future. first marine then fine arts then graphic designing then engineering. ive wasted an entire year cuz they are forcing me into doing something i dont wanna do and now theyre blaming me and saying \"i wasted my entire year cuz i wanted to do all this and that my friends are toxic and theyre making me fail at life\" first i havent talked to my friends in months second my friends know nothing about what i wanna do third i never said yes to anything except marine engineering and they forced me into all other things. it just hurts seeing how blinded theyre that they cant see what i want and are again forcing me into computer engineering. blaming me and my friends for everything they had done for entire year is just breaking me and i cant even trust anyone anymore. i dont even feel like talking. but still it feels like other people are going through worse and im just being weak. my current girlfriend is trying her hardest as well but i feel like im bothering her too much.", "is_suicide": 0}, {"created": 1554178886.0, "author": "swatisfsu", "title": "Seeking Feedback on Depression Apps in India", "selftext": "Hi all,I am a psychology research student from San Francisco State University, currently working on a research project focused on **depression apps available to Indian users.**I am looking for honest opinion on apps (CBT apps or apps providing psychiatric and psychotherapy services specifically) that you have found useful in dealing with depression. I would like to know which of your therapy needs they fulfill successfully and how they help you in managing depression. I am also interested to know the areas where they fall short or fail to cater to your needs.If any of you use such apps, I would love to know your thoughts. I am listing out some apps below that I came across. If you use any of them, let me know your thoughts. If you use a different app not listed here, then I would love to know about it too.Some depression apps available to Indian users, listed in no particular order:1. YourDost2. Wysa3. wayForward4. Betterhelp5. Joyable6. iCliniq7. FeelJoy8. Nsmiles&amp;#x200B;Thank you for your help&amp;#x200B;PS: This post is only for research purpose and I am not trying to promote any apps.", "is_suicide": 0}, {"created": 1553398434.0, "author": "nimmu87", "title": "One fine day in 2004, my brain just refused to engage in anything anymore...", "selftext": "Since then, I have pursued and completed bachelors and masters degrees in Mechanical engineering. For my bachelors, I graduated in the top 1% with accolades. Hated Masters but got through with 3.25 GPA. Worked for 6.5 years in the USA until my final employer essentially fired me for underperforming due to the major depression. That fine day in May 2004, I was in senior year of high school. I had Physics and Chemistry tests the very next day. I had just been to the hospital and was given massive doses of antibiotics for bronchitis for over 15 days. Was diagnosed as hypothyroid. Was in a prep school kind of scenario - so EXTRA pressure and stress. That day, my brain stopped being interested in anything anymore. Got into serious depression and anxiety. Obesity, insulin resistance, PCOS and CFS followed. Still suffering despite in numerous medicines, psychiatrists, therapists, ECT treatments, diet and lifestyle changes, supplement additions and everything in between. Tried a bunch of nootropics. Finally came across some back often recently- somehow helps in combination with my Effexor.I’m not sad anymore- get suicidal when I quit medicines for a day though. But the anhedonia and depersonalization/ de realization are VERY STRONGLY present.I was an excellent student- straight As from kindergarten: excelled at extra-curricular stuff, class monitor, prizes and accolades. Obese, so terribly low self-esteem. No friends. Thought if I just worked hard, made a good life, my success would help me get over the fact that I had no social life and no pleasures in life- not even access to a TV or computer. Okay, I decided after crying everyday for the past 15 years that I can’t get out of bed, I need to do something I can remotely stand, to be able to get close enough to a normal and productive life as possible. See that inability to study and perform in my senior year, got my scores down low enough that I couldn’t pursue medicine or bioengineering as I had always wanted. My whole life, I worked for that. I didn’t want to live anymore. But I did and still do- I’m too scared I will not be successful with suicide. I’ve enrolled in a Data Analytics degree- essentially some computer stuff and math. I need to do some pre requisites and also start on the course. But I CAN’T STUDY. I am not interested. I’ve been procrastinating for close to 13 months, deferred my admission to this Fall. I have no more time though. Failing in this will only set me back- cause all those emotions about not being good enough to come rushing back. I can’t handle anymore failure. Already have a soul-crushing “anything-I-do-will-turn out to be crap” vibe going for me- it scares my family why I’ve had such bad luck going for me for so long. As a result of losing my job, I was forced out of the country and had to come back home to India. I gave up my apartment, sold my car, my belongings and moved in with my parents, had another stint at the mental hospital, have very little money to my name.But all this can change. I have plans to complete this degree and get a stable job, where I’ll have more security and creative freedom. Build my life again. And then follow my passion and pursue a Bachelors, Masters and doctoral degrees in biology/ bioengineering from Europe ( no age limits, is cheaper and better). I can build all that back- do everything I’ve wanted to do and more.BUT I CAN’T STUDY. It used to be my identity. I was always identified as the good student. Getting good grades was all I had going for me.  All those years of hard work did go down the drain, yes.  But I still have time. If only I can bring myself to care....Can anyone relate to this? I’ve lived like this for 15 years. I only did well in my Bachelors because I paid attention in class and took notes- never used the textbooks. To this day, I cannot read a book. I understand the loss of passion with depression. But why am I rebelling against myself when it comes to doing something productive with my life- I’m never interested in anything to do with my professional life. But the other part of me that drove me to be a good student all my life is still intact- the two personalities are tearing me apart. I’m constantly guilty about not meeting my high expectations, but I can’t even do the bare minimum and at least give it a try. the indifference is astounding. Therapists have talked to me for hours- I’ve never changed. How do I tell my brain that I won’t be hard on it anymore- that I care for my body. That this studying or caring to do anything in life other than eat and watch videos from bed is actually good for me and may actually work?PLEASE SOMEONE, HELP ME STUDY!!! PLEASE, PLEASE. ", "is_suicide": 0}, {"created": 1552947493.0, "author": "ravvi_sandy", "title": "im ging to end it all...", "selftext": "i am immigrant from india... life doe s not treat me so good here in england.i have decided i cant go on anylonger. i am going to kill myslef. goodbye.", "is_suicide": 0}, {"created": 1552831189.0, "author": "devs97", "title": "I come from a place where mental health problems are a taboo.....", "selftext": "The first time when I had my stint of being depressed, I understood for the first time the reason nobody talks about depression, anxiety in INDIA. I feel sad for those people who are considered idiots to go and seek out for help here. I was very lucky to have a progressive who didn't give a damn about the society and took me to a psychiatrist but i feel sad for those helpless people who are never given advice for fighting depression. There are kids out there who do not even understand what depression is and how it affects us. I hope this changes.P. SBeen fighting depression for that last 4 years of my life. It gets easier but we still have our days with each other. ", "is_suicide": 0}, {"created": 1552650376.0, "author": "SadJoetheSchmoe", "title": "Feeling low, seems to gave been a trend for the past 20 years, but talking helps.", "selftext": "Money is low, 36 hours away from ny phone being disconnected. Moving at the end of the month to be back with my mom, who can barely help herself. Hopefully any money I make can go to help her and myself. My brother probably won't graduate, just like I almost did. I helped raise him, so I feel responsible. Car still acting up 4 wheel drive just having trouble now too. I keep feeling like, \"Hey, at least this is rock bottom, can only go up, right?\" Then it keeps going lower. I try to remind myself that \"Hey, at least you aren't in that whole mess with India and Pakistan right now, or deployed, or fighting ISIS, or a refugee, or still being abused like you were as a child, or in Venezuela, or being sold as a slave.\" Then I go to the good things in my life.  \"Your family loves you, so much buddy. All of them. You are a pillar of the family, they are so worried for you, and wish they could do more. Please keep going for them. Your buddy Billy loves you as a brother man, he stayed with you that bad night. Bought you pizza, remember? Watched a couple movies. Your platoon and squad sgts care, got you in touch with that free shrink. Shrink cares, she just about cried when you told her all the shit you went through as a kid. See, life isn't so bad if all those people care.\"Now, this used to keep me going. Their love, affection. Made my heart swell with undying love. I would die for every one of them. But as time keeps going, rock bottom keeps sinking, time getting shorter, life harder. That love just turns to shame. It turns to grief, and despair. My depression getting heavier, and heavier. The more lost I am in the Valley of Darkness, who's evil I fear, for what if the Shepherd doesn't exist, and the blind man isn't even being led, but stumbling in his hour of need, no one to take his hand. God, it's so dark. My soul yearns for peace, but I am so plagued by the demons of the past, and my present. I fear, that the peace I will ever know, will only be in death.", "is_suicide": 0}, {"created": 1551970694.0, "author": "johnsmith121jsjs", "title": "Some Common Things You Must Know About Depression", "selftext": " Unhappiness, discouragement and hopelessness about daily matters are familiar feelings to most people. Feelings of sadness are unpleasant when one is experiencing them, but they usually do not last long, dissolving on their own after a period of days or weeks.&amp;#x200B;Depression, however, is a medical condition characterized by changes in one’s mood and sense of well- being. This mood disorder can make people feel sad, hurt, irritable, hopeless and helpless about the future which can result in the person losing interest in activities which were earlier enjoyable. It is commonly associated with reduced sleep (insomnia), though, at times individuals can have increased sleep. Appetite may be affected and there may be problems with concentration and energy levels. At times individuals can feel guilty and responsible for events that may actually be beyond their control. A person with depression can also have thoughts of suicide. Relationship difficulties and occupational dysfunction are often outcomes of Depression.&amp;#x200B;Depressed mood and sadness can influence the way individuals perceive themselves, others around them and the wider world.&amp;#x200B;SYMPTOMS: Following are some of the symptoms indicating the presence of depression:* Significantly low mood* Loss of interest in almost all activities* Irritability* Decreased desire to eat or overeating* Excessive sleep or reduction in sleep* General aches and pains in the body* A tendency towards isolating oneself* Unmotivated and lack of confidence* Frequent crying spells* Impatience and feeling of no hope in the future* Low self- esteem, feelings of inferiority and worthlessness* Feelings of helplessness* A dearth of enthusiasm and low energy or fatigue* Difficulty in concentrating, difficulty making decisions and slowed thinking* Thoughts of death and suicidal ideas&amp;#x200B;TREATMENT:Treatment for depression is usually in the form of psychological therapy, or antidepressants, or a combination of the two. Mind Plus, offers one of the best depression treatments in North India with self-help and self-support programs to reduce the impact of the physical and psychological effects of this illness.&amp;#x200B;At Mind Plus [rehabilitation centre Ludhiana](https://www.mind.plus/), we follow international guidelines and protocols to evaluate and assess patients. A biopsychosocial framework of evaluation is used to identify predisposing, precipitating and maintaining factors. Moreover, low mood and mood swings are evaluated carefully to distinguish depression from other conditions that may present in a similar manner. Individuals are closely screened to plan effective treatment strategies.&amp;#x200B;Depression can be treated as both inpatient and outpatient programs and it is only after a comprehensive evaluation that individuals can be advised on the best course depending on the nature and severity of their illness.&amp;#x200B;Antidepressant medications are safe and non-habit forming. Psychological treatments that are effective (sometimes as much as medication) include cognitive behaviour therapy, interpersonal therapy along with family and marital therapy.&amp;#x200B;To know more about how we can help, please contact us for an individualized assessment.", "is_suicide": 0}]