[
    {
        "name": "t3_jx3zpp",
        "created": 1605826148.0,
        "ups": 4,
        "downs": 0,
        "title": "Living in India made me realize how insignificant I am and how I dont matter at all.",
        "selftext": "major suicidal thoughts trigger alert I went to go buy some cat food and all i saw were people and people everywhere. Chaos everywhere. people mknding their own business. My voice wont matter at all. Nobody gives a shit about anything. Literally i could just die on the street and i would just be an inconvenience to the people using the road. I hate living india. It literally makes me feel worse about myself every single minute. Fuck this life man. i just hate this. i hate evrything. I just feel soo small. I just want to live a happy life with a nice partner and some pets. why do i feel soo shit the very next minute i feel good. Everything is soo temporary. My happiness is temporary. Its exhausting. I feel like a time bomb every time i just cant take it i try to do something i like and i emd up hating it to the point i stop doing it. I hate how i cant even focus for a minute without feeling shitty. The only escape i have is music and my friend who doesnt even live in this country. I hate everything about my life. why cant i just be normal. I wanna move out and just live in some normal fucking country where theres no misery every inch. In one ride to the pet store i saw poverty, bad roads, the rich not giving a fuck, pollution, potholes every fucking where. i literally went no further than a kilometre. I feel worse everyday. Idk if i can do this anymore guys. I just cant. I feel soo overwhelmed on this city. I hate everything about me and this country. I try to better myself in qualities i can and i am getting better at stuff but holy shit i feel bad every second i love in this godforsaken body. My mind is nothing but a clusterfuck of emotions idk i could feel. My body is fucking disgusting i hate it. my attention span is worse than that of a fucking pre pubescent turtle. I hate how much hair there is on my body. I feel like an ape. I fucking hate diwali, the noise and the smoke triggers the fuck out of me. its fucking moronic to blast firecrackers and defending the use of it to be a part of hindu tradition like stfu. i hate everyone but i feel worse and inferior to them as well. i hate myself the most. I hate everything. I have episodes where i have the most disgusting and disturbing thoughts. Suicide seems soo close yet soo far. I know i am just gonna suffer forever. Nothing helps. Literally nothing. I hate lookong at my \"friends\" Instagrams just looking at them having fun and shit when i am suffering. I just want to sleep and not wake up. If i do, goodbye world, you have been a bitch to me and i fucking hate you. Thanks for giving me one ugly fucking body and one stupid fucking mind. thanks for takong away my father and thanks for fucking with my mind every second. What have i even done to deserve this shit. Maybe its soo bad i should just die. I just want to know what happens after death, will there be afterlofe or nothing. idk but i just want to die. Please god, what the fuck did i do to you. do you even exist? i fucken hope not. I feel like i can punch myself to death. Everday i just feel worthless. thats it. idk what to tag this under."
    },
    {
        "name": "t3_j78ex3",
        "created": 1602168867.0,
        "ups": 3,
        "downs": 0,
        "title": "Community or support group in India",
        "selftext": "Hey all. I'm just wondering if there's some sort of support group (even if it's virtual these days) in India. I'm asking because I cannot seem to find one anywhere. And was wondering if it might not be a good idea to start one?"
    },
    {
        "name": "t3_jpvq3x",
        "created": 1604803589.0,
        "ups": 18,
        "downs": 0,
        "title": "Bought around 50 books",
        "selftext": "I still remember my first manic episode, spent my whole savings on books. As being from an occupied state in India, thought I was starting a revolution. Planned everything in my head. Talked to clouds and even the sun. Felt like a king. Lasted for more than a month. There were about 4-5 friends taking care of me. Never took me to hospital because of lack of awareness. The thrill it gave me is something I have never ever felt before in my life. But looking back I don't know who am I anymore. I feel like I have crashed. The pre episode and post episode personality I have is something I can't understand. How I use to be. Am I a complete different person now. Have had suicidal thoughts. As a person perusing research in electronics. I have tried my best to be back to my old self. But I don't know how I use to be. The medications has help me being stable. But nothing seems to make me happy ever since I got the high I got from being manic."
    },
    {
        "name": "t3_hp8ruw",
        "created": 1594497256.0,
        "ups": 12,
        "downs": 0,
        "title": "My First Time Inpatient: How I Learned to Advocate For Myself",
        "selftext": "Hi everyone, I just got released from the hospital after the 72 hours. I signed all the papers to go in voluntarily so I could stabilize and get my meds changed in a safe environment. It's a long story about why I went in but I figured you guys could understand. So, I was previously on 40 mg of Prozac, 25 mg Lamictal and 10 mg Buspar. Prozac and Buspar were part of my old \"anxiety and depression\" cocktail. The first psychiatrist I saw added 25 mg of Lamictal to my regimen after my diagnosis and didn't change anything else After that appointment, when I got home I felt great. For all of....2 days. My body got used to the Lamictal and from there on it was like eating candy. I kept taking the medicines hoping it would get better.From there, things kept going downhill. I ended up in one of the most severe depressive episodes I've ever had while also experiencing mild psychosis. I had a lot of outlandish thoughts like I wanted to build a makeshift boat and go to India, I wanted to get to Paris with a total of 60 bucks in my pocket, really weird stuff. Then I talked about hanging myself.The next day, my family had me go to counseling. My psychiatrist was contacted and told how bad things were yet refused to change my medicine and didn't call for hours. I was still in full blown crazy land so the best option was hospitalization. I agreed to it because I was so tired of feeling like I was.The hospital was great and I loved the doctors I saw. I remember answering tons of questions. Every single doctor informed me that I should not have been on any more ssris after my diagnosis. Before being diagnosed, I had tried 7 ssris with little to no success or worsening of symptoms. Also I was told the mood stabilizer I was on was gonna be way too slow working. The head psych doctor there reevaluated my whole med regimen and took me off of Prozac and Lamictal and she added Lithium and left me on Buspar which I do well with. I felt like a new person when I started lithium. It's been totally amazing so far. I have a checkup in 4 days to see my blood levels.I'm going to do all of my follow-ups with the hospital's doctors which I feel very good about. I feel like I can trust them and they have a lot of knowledge about medications as well as what each mental illness needs to be treated with. I completely cancelled everything else I had with the prior doctor.Overall though, I learned that it's okay to reach out for help. I also learned that I have to fight for myself when my medication is out of balance. It's hard when you're seeing some doctor that's second guessing you and then they leave you hanging when you're in a crisis.  I feel much stronger about advocating for myself after all of this.I just wanted to share because this community has made me feel like I belong. Maybe some of you can relate as well. I feel like everyone here is a friend and I'd love to hear anything you guys also want to share."
    },
    {
        "name": "t3_fj4b1j",
        "created": 1584319896.0,
        "ups": 17,
        "downs": 0,
        "title": "Med shortage?",
        "selftext": "Anyone else being told by their pharmacy there’s a shortage of meds?? They gave me 3 days worth of lithium on Friday and told me to come back Monday - kinda terrified tomorrow they’ll say oops sorry, no more! And I’ll end up off cold turkey. Anyone else? Editing to say I’m not at all trying to stir up panic about meds not being available, this may have been a fluke that’s just coinciding with all the covid stuff."
    },
    {
        "name": "t3_hy99cb",
        "created": 1595807726.0,
        "ups": 1,
        "downs": 0,
        "title": "I’m not sure weather I have bipolar disorder or not but if I have it, I’m unable to consult a therapist",
        "selftext": "I live in India(south) and I’m 16 years old. I’ll bee good and happy until my parents provoke any type of argument. I act so differently and aggressively, after some time I get good. I can’t share this to my parents even they know I have this. They or me couldn’t visit a clinic... what should I do?"
    },
    {
        "name": "t3_gdqam5",
        "created": 1588678048.0,
        "ups": 6,
        "downs": 0,
        "title": "Adhd/bipolar type 2 comorbidity",
        "selftext": "Hi,I was diagnosed with adhd back in 2016. Recently, I have been diagnosed with bipolar disorder type 2. I am sure there are a lot of people like that around the world. I come from India where mental health awareness is.... disappointing. I am very confused about my conditions (this might be because I have been put on oxcarbazepine which, I have read here and some other places, causes confusion). If there are people here with adhd/bipolar disorder comorbidity, I would appreciate if they could share there experiences and how they handle both the conditions, as often the symptoms overlap as well as interfere with each other."
    },
    {
        "name": "t3_g10okc",
        "created": 1586876044.0,
        "ups": 3,
        "downs": 0,
        "title": "i don’t know what is going on with me. any advice is wanted/welcome",
        "selftext": "ok so to start this off i read the rules and am not asking for a diagnosis, i’m just wondering if there are any warning signs i should be looking out for, or if this seems serious enough that i should tell my therapist and my dad or see a doctor. i’m in my mid-teens and i think i might be on the bipolar spectrum but i’m not sure at all because i have a tendency to be a hypochondriac but i also have a lot of the symptoms and a family history of bipolar and other mental illnesses. i don’t really know how to explain it properly but in early february/late january i went through this 2ish week period where i literally felt like god, for lack of a better phrase. i felt like my entire body was full of energy and i was constantly jittery and happy but not happy in a good way, happy like i felt sooo sooo good but also like gross and terrible in a good way and during this period i obsessed over the idea of dying young and beautiful, romeo and juliet type shit, jimi hendrix, the 27 club, etc. i stopped caring about practically everything in my life, i was tardy to school almost every day and i would constantly fantasize about running away and living on the streets and doing hard drugs and getting famous and then dying young in some horrific fashion or starting a cult or being martyred.  it kind of felt like the inside of my brain was just screaming incoherent nonsense at me or like hype music was constantly playing but with no sound, just the adrenaline of it. it would always feel worse at night and i would listen to the song tarzan boy (summer version) by baltimora 24/7 because it felt like it was the only thing that fulfilled my existence. i would also like talk to myself a lot, frequently in the plural (we) form and talk to myself in the mirror in gibberish with lots of hand movements for some reason?? i do talk to myself a lot even when i feel stable but this just was different like i felt constantly frantic. this all culminated in me badly tattooing the word youth (because of the whole dying young thing) on my hip, which i really botched. towards the end of this period i realized that it was unhealthy and not normal or good to feel like this. after i did the terrible stick n poke it kind of shocked me out of this and i cried myself to sleep because i felt like my mom, who died when i was 11, would be disappointed in me and hate me. for the next couple of days i just felt like all of my friends secretly hated me, but i always kind of feel like that because i’m a naturally very paranoid person. i told my therapist about that period and she told me to tell her if it happened a gain and to keep and eye out for it. since then i’ve generally felt normal and stable, although i’ve had a few brief moments of that weird frantic euphoria. i also had a time over the last summer where i felt like i wasn’t real and nothing was real and i was living in the matrix and had extreme existential anxiety. also during this period it would feel like the ground/earth/floor was moving and breathing and that feeling has sporadically happened again over the last couple of months. it would also sometimes feel like i would fall into the sky, for lack of a better way to explain it. i’m not totally sure what was up with all of this. i also have a tendency to overreact with anger and like almost feel drunk off of my anger?? also today i was considering taking cold medicine (dayquil) to see if i could trigger another euphoric period just because i i india of missouri feeling like god even thought it was kind of terrible and gross?? i have no idea what this is or what is happening to me. my grandpa on my dad’s side had bipolar disorder and i think it was pretty severe but i don’t want to ask my dad (or his siblings) about it because he seems to have some childhood trauma stuff that he doesn’t want to deal with and i don’t want to accidentally bring up things he doesn’t want to talk about or has compartmentalized. my aunt and my cousin (her daughter) also have pretty bad ocd, and my dad says he has mild ocd. anyways hopefully this was understandable and not too incoherent and any advice is welcome/wanted. again, i’m not asking for a diagnosis, just asking if this is serious enough that i should tell someone or if i should see a doctor when life is back to normal. i hope all of you guys stay safe from coronavirus and have tolerable quarentines :)"
    },
    {
        "name": "t3_fh1fcr",
        "created": 1583978658.0,
        "ups": 26,
        "downs": 0,
        "title": "PSA: Don't wait for the last pill to refill",
        "selftext": "I'm starting to see increasing news of pharmaceutical supply chains being screwed up because of covid19 infections. Most of the active pharmaceutical ingredients (api) in our drugs come from China or India. The APIs in seroquel and lamictal both come primarily from India. So long as the API supply chain isn't fucked, we can still get our stuff without worry. However, since we don't know exactly where all this is headed, and NONE of us can afford a missed dose, just a friendly reminder to not wait for the last pill to refill, just in case you get to the pharmacy and they tell you it'll be a few days before they get the next shipment. If you can fill three months at a time, do so. I am. Also, none of us should freak out. We're all going to be fine if we just take precautions. Part of those precautions are being certain we have enough drugs on hand to weather the storm. Be safe everyone. Much love."
    },
    {
        "name": "t3_d7croa",
        "created": 1569112525.0,
        "ups": 17,
        "downs": 0,
        "title": "Let’s get a thread here: what impulse tattoos have you gotten while hypo/manic? I got this cat ass tat yesterday.",
        "selftext": ""
    },
    {
        "name": "t3_9tukpk",
        "created": 1541284640.0,
        "ups": 4,
        "downs": 0,
        "title": "Brother missing I am a wreck : India",
        "selftext": "Hello everyone,My brother is still missing he left home on 23rd sept 2018. It has been 40 days that our family is at a still. We went to places where we thought he will be at and still couldn’t find a trace. The police is not able to do anything since he is not carrying any phone or credit/debit cards with him. There is no news of him at all. He is schizophrenic and was taking his meds. But recently was drinking an entire bottle of cough syrup everyday. We did not know about it because we have learned to give him space when he goes out of the house to buy something and we learned to trust him with his life as always. And he has never been happy in the family or with the family rather because we are very dysfunctional. My mother is also schizophrenic, who never wanted meds and chose to step away from the family 11 yrs ago which made my brother hate me and my father because he thought he are the ones to blame because my mother blamed us. Even she hates me to the core. She recently stayed with my brother during his job switch and that messed up both of them. She pressured him to be back on the family. But she never spoke to my dad about it. She doesn’t understand that it is between her and dad that she comes back home or not. She has always involved us kids in the conversations. Now she is home and still isn’t okay mentally. But still won’t take meds. So I am not pressuring her because now she’s 52 and she feels I am cruel etc and she gets very violent at that. And I get scared that I don’t want to piss her off because if my brother comes back anytime I want him to find a peaceful home and I feel it is karma Even I was diagnosed with bipolar 2 which I managed out of because I got medicated very early on 15. I am shitting bricks that my brother is not home and it is all my fault that I couldn’t understand him and help him better. But I did what I could for him. He used to be in my thoughts all the time.i got a little overprotective but when he told me that I was dominating I stopped giving him any advice as an elder sister. Then he blamed me for not helping him out and that I was a horrible elder sister. I don’t know what to do. There were only 2 anchors in my life. My granny whom I lost in jan this year and my brother. Now I don’t know what to do. I following up with the police. Posting on Facebook groups. What more can I do?Can you guys share your homeless experiences with me ? And are there chances of his return considering our family situation?Also anyone from India who can let me know what more can I do to find him out ?Thanks a lot and sorry for babbling "
    },
    {
        "name": "t3_6mwhfh",
        "created": 1499918174.0,
        "ups": 66,
        "downs": 0,
        "title": "Me, teaching engineering to industrial trainees, gandhinagar, India :) Thanks for the support guys",
        "selftext": ""
    },
    {
        "name": "t3_gdz3p3",
        "created": 1588718982.0,
        "ups": 1,
        "downs": 0,
        "title": "Does anyone else get Automatic Negative Thoughts/Visualisations exactly when they study?",
        "selftext": "Basically I'll be doing maths and all of sudden my mind puts a memory/visualisation/exaggerated memory in my head and all of sudden I'm sad about the fact that my psych and therapist have been zero help with the fact that I have ANTS/ANVS. I have a entrance test in a few months that could mean the difference between being able to study maths which is my passion settling for just majoring in cse(not that bad but still), and my ANTS AND ANVS have been really hindering me every single time I manage to overcome my unproductive habits and get my ass on seat, hands on pen  BAM comes a ANT/ANV and I'm in this sort of trance state where I'm simultaneously solving maths (quite slowly) and thinking about the fact that I have had a very bad experience with mental health care in India and India is a shit country Yadda Yadda yadda... Then I get all depressed and shit and the cogs and gears in my brain refuse to turn and I'm miserable.The only healthy ways of coping with this that I can think of is :- Ignore it and suppress and soldier knowing that I won't wish a similar fate on anyone and else and every second I spend studying is a second closer to helping other mentally ill people(aiming for bioinformatics after my undergraduate)- Use the techniques in David Burn's Feeling Good where you analyse and defuse your ANTS/ANVS Only thing is I don't have enough strength to soldier on and suppress and the techniques in the book take way too long"
    },
    {
        "name": "t3_erym8p",
        "created": 1579659441.0,
        "ups": 3,
        "downs": 0,
        "title": "Seeking Advice on Sister in Psychosis",
        "selftext": "Advice on delusional sister refusing treatmentHi Friends. My sister has had a psychotic break about 3 weeks ago. She thinks she is the reason trump is being impeached, that she’s behind the uprising in India, and that Russian Spies are out to get her. I suspect Bipolar 1 w/ delusions triggered by stress (she had just started a new job, which she was promptly fired from). Problem is, she thinks she’s totally fine. Gets extremely hurt when people don’t believe her and threatens to cut us all out, which she did for a terrifying 4 day period during which she drove 3 states away and appeared at my door step on the other side of the country with no car anymore (abandoned the car and flew.) she refuses treatment, and the mere mention of it right now is enough to almost loose her to ya entirely. She does not seem to be an immediate or clear danger to others- and not her self (not suicidal or anything, and has periods of total lucidity.) But she has said she chased spies o the highway for a while flipping them the bird. Not sure if this actually happened or not, or how dangerous it was, but doesn’t sound good either way. Curiously, when she said this she said “I know this sounds crazy but...”Any advice on how to keep her safe, get her treatment? She also has periods where she thinks she’s a billionaire and is spending money like it too (tipped a server $100 yesterday.) she’s crashing with me for the time being, but can’t stay here forever (i have housemates). Thank you all for whatever insight you can offer."
    },
    {
        "name": "t3_96oxpv",
        "created": 1534107026.0,
        "ups": 1,
        "downs": 0,
        "title": "Lurasidone in India",
        "selftext": "Does anybody here taking Lurasidone and live in India? May I ask which Lurasidone generic brand is reliable? I am currently taking LATUDA 40mg.  I would be appreciate if anyone can recommend good Indian online pharmacy."
    },
    {
        "name": "t3_8sqkom",
        "created": 1529603314.0,
        "ups": 1,
        "downs": 0,
        "title": "32(m) new delhi, India..is there anyone around?",
        "selftext": "It's hard enough as it is. It'll be great to interact with somone with bipolar disorder. A friend is all I need. Guy or girl it doesn't matter. Hit me up. "
    },
    {
        "name": "t3_da47dn",
        "created": 1569636552.0,
        "ups": 4,
        "downs": 0,
        "title": "Should i tell my employer about my illness?",
        "selftext": "Recently diagnosed with bipolar (been in depression for past 1 year), should i talk to my employers and talk about my illness? I work in a pretty big software company as a developer.I don't sympathy from them but at the same time, I don't them to expect a lot from me as it is really hard for me to go to work also.I'm confused on this both ways it looks bad. If i don't tell them, I will not perform and I am sure they will kick me out in few months and if I tell them, not sure what will happen.Btw, I am from India, if it helps. Anyone advice?"
    },
    {
        "name": "t3_cyuh28",
        "created": 1567484618.0,
        "ups": 4,
        "downs": 0,
        "title": "commonalities in psychotic episodes",
        "selftext": "i read an article recently that described how schizophrenic voices were influenced by culture. western voices were harsh and vituperative, and those found in india (their sample) were more benevolent.  im curious for those of you who have had a psychotic episode, what was yours like?  mine was largely persecutory, with a lot of paranoia surrounding my workplace. im actually interested in gathering some experiences to show that not all psychosis is of the \"Jack Torrance\" or \"Patrick Bateman\" variety. send me a dm and we can talk! this really interests me."
    },
    {
        "name": "t3_d1podp",
        "created": 1568057625.0,
        "ups": 8,
        "downs": 0,
        "title": "I am genuinely concerned.",
        "selftext": "So my psychiatrist changed my diagnosis from Acute bipolar to bipolar 2 (I also have Hyperactivity and restlessness). He altered half my meds, He added meds that are used to treat muscle stiffness/ rheumatoid Arthritis/ Parkinson'sI was being given a Parkinson's med earlier. I'm very confused with the treatment. Also he is not explaining everything to my family since they are very very protective of me and would get depressed themselves. I'm 22 M from India. Not sure if that information helps. Also important fact would be that I've always had terrible balance and catching abilities. Right now I am having a  hard time climbing down the stairs of the library with my laptop and a book in hand. There is also a lot of ringing in my ears. Please help!"
    },
    {
        "name": "t3_wdr4o",
        "created": 1342038575.0,
        "ups": 25,
        "downs": 0,
        "title": "'10 Facts Everyone Should Know About Bipolar'--You might be surprised to find one or two you didn't know (India's rate of BD, anyone?)",
        "selftext": ""
    },
    {
        "name": "t3_cwfot7",
        "created": 1566994236.0,
        "ups": 2,
        "downs": 0,
        "title": "Problems with Lamictal (lamotrigine) generics",
        "selftext": "Has anyone else had problems with their Lamictal generic being wonky? I had a real bad problem with this from Wellbutrin (bupropion) in the past, and it seems to have spread to other drugs.I've been having some issues with my Lamictal generics. The first manufacturer I took seemed really effective. The pharmacy that filled it closed, and I switched to Kroger pharmacy. Kroger had a manufacturer called Zydus, and it didn't seem to work very well. I also read bad reviews about Zydus online. I was experiencing quite a bit more anxiety and some mild depression, almost like I wasn't taking it at all.I then switched to Walmart, who had Zydus and Unichem, so I got the Unichem, and things seem to be going slightly better. The anxiety has improved a lot. I still seem to be depressed, but the Unichem may just need a few more days to take the full effect.I've read some really scary stuff about prescription drug manufacturing online. It seems like an unregulated shitshow in China and India, where most of the world's drugs (even brand name drugs) come from. I wish the US government would do more to regulate this industry, but they're literally paid not to through lobbying."
    },
    {
        "name": "t3_auveqn",
        "created": 1551186580.0,
        "ups": 3,
        "downs": 0,
        "title": "Coming out as Bipolar through facebook (yes/no) Please, please help me out",
        "selftext": "Just got diagnosed bipolar with psychotic features. Had my first psychotic episode last year, which involved me shit posting on Facebook - random stuff and some hate stuff. Destroyed professional and personal relationships. Before this I had a fairly normal and good life, except for bouts of depression which I had managed to keep under wraps.I'm tired of having to explain to people what happened, if they are even willing to listen to the whole thing. Or its just this awkward situation, where they don't ask but there are looks thrown around. There is no other way I can explain those three months. Can't even say my account was hacked or something, of course I had to post videos of myself.Now, I think my options are between changing my name and moving to another country or laying low and explain to people as I meet them or coming out on Facebook, explaining it from my pov and apologising. And understand that not everyone is going to accept it and treat me like before.I'm 23, female and from India if that's relevant"
    },
    {
        "name": "t3_1mqelr",
        "created": 1379651298.0,
        "ups": 1,
        "downs": 0,
        "title": "Does anyone here have experience getting their meds from foreign sources like India?",
        "selftext": "Hi there. Long story short I have a prescription that would cost me almost $800 a month in the US that I could, apparently, get from India as a generic for about...$30 a month. I just have some general questions. Are they generally safe? Are they generally of reasonable quality? Are there any things I should know about doing this? Does anyone know of Intas Pharmaceuticals and/or Genpharma? Are they regarded as quality companies? The drug in question, by the way, is Abiify, or Aripiprazole .Thank you in advance."
    },
    {
        "name": "t3_c51xt8",
        "created": 1561463298.0,
        "ups": 2,
        "downs": 0,
        "title": "Question about hospitalisation in the UK",
        "selftext": "Hi, I'm a 17 year old Indian with bipolar disorder. Hospitalising people for mental illnesses isn't really a thing in India. The psychiatric facilities aren't great and there are barely any inpatient psychiatric hospitals. The first time I read the DSM 5 at about 14 or 15 I didn't get the criteria for diagnosis of bipolar disorder (\"...manic episode disrupting enough to warrant hospitalisation\" or whatever it is verbatim), because I'd never heard of anyone here being hospitalised. I'm going to the UK to study in about a year, and I'm pretty worried that one day I'm going to walk into an NHS psychia trist's office for meds or a psychologist's office for therapy and I'm going to end up being hospitalised. What's the hospitalisation scene in the UK? Is it anything like how the US is supposed to be? With even 12 and 13 year olds being hospitalised? Or is it rarer. Thanks."
    },
    {
        "name": "t3_14m1t8",
        "created": 1355188952.0,
        "ups": 8,
        "downs": 0,
        "title": "India prescription adventure!",
        "selftext": "I left for India a few weeks ago and made the mistake of not getting emergency pills before I left. So two days ago, on my last pill of celexa (still had 20d lamictal), I had to make some moves.First day, I had a guy drive me to the next town with the \"medical stores,\" but it was Sunday so they were all closed. The second day, the \"medical stores\" of course had never even heard of these pills.That's when I started to get scared. I mean, I've had SSRI withdrawal before, and it's no picnic. I'm convinced that the last time I let this happen was the coup de gras on my last relationship. Plus, I'm in India and I'm supposed to be having fun, not killing myself with stress and anguish. :( Combining my worry with missing a dose, I've been on edge most of the day. I didn't even eat breakfast or lunch. &gt;_&lt;Anyways, today went better. I had a taxi driver take me to a \"doctor,\" and then to a pharmacy in the nearest city (note that this wasn't a medical store; apparently there is a difference). The doctor was funny, because he was more of a nurse practitioner. He had to pull out his book to look up the pills, and I had to make sure he didn't screw it up.The pharmacy was kind of insane. In the US, they keep everything very regimented and organized, but in India it's like a cross between a NAPA and a bar, except they have prescription medications. I had to crowd my way up to a desk where a technician searched for my pills (as an aside, all pills here come in those plastic sheets with the pop tabs), then another counter to pay, and a final counter to collect. Note I said \"crowd.\" They didn't have the 40mg citalopram, but they did give me doubles of the 20mg's.All in all, an insane experience, but I'm very glad and relieved that I'm meds'd up."
    },
    {
        "name": "t3_bal42r",
        "created": 1554699869.0,
        "ups": 3,
        "downs": 0,
        "title": "Mania really be crazy",
        "selftext": "Let me just detail my behaviour in the past few hours:Found some texts between regarding my dad's legitimate sexuality and my mom wanting to file for divorce, tried to deny it for a few hours and had a fight with a friend but ultimately called up another friend and broke down crying. In the meantime, I'd already threatened another close friend with murder multiple times and snapped at her innumerable times. At around 1:40 am, I left home to go to the nearest 24/7 supermarket, bought 2 cokes, waffles, peanuts, chips and 2 cans of this amazing energy drink called sting. In my affection for trying new things, I've already tried (and failed) to learn 2 new programming libraries today. Oh, I also ran out of cash and had to take a 15 minute walk home from the store at 2 am in New Delhi, India; one of the least safe cities in the world. I'm also super aware of the stupid decisions I'm making, I'm choosing to make them anyway though. I'll probably drink the sting (which has copious amounts of caffeine in it) before school today (it's currently 2:30 am, I leave for school at 7) and be super fucked for the start if the day. Stupid decision I know, but I'll probably do it anyway. That's it I suppose. Mania can be intense. Happy hunting"
    },
    {
        "name": "t3_aisjdo",
        "created": 1548225387.0,
        "ups": 3,
        "downs": 0,
        "title": "I just want to vent. I know the people on this sub get it. My mental illnesses are ruining my life and slowly killing me.",
        "selftext": "I don't know why I'm making this post. A gut feeling tells me it will make me feel better. In this post, I'll attempt to summarize the problems I've dealt with at different points in my life.Background: 18M. I was born and raised at a small, shitty town in India. Moved to a suburb of a major city in the US in August 2018 for college.**Ages 0 to 6:**I always had an EXTREMELY high degree of 'other'-ness right from when I was very little. I was an extremely impulsive child. I was unable to sit still, would disrupt any games with other kids, couldn't participate in any group activity without disrupting, would say embarrassing things, was fickle, was really smart but didn't really do well in class because I was too fickle to write anything on paper - was a constant embarrassment for my parents and myself. We had a substitute teacher who would beat me to bruises for trivial shit like I couldn't be bothered to do the dumb busy work he'd assign us. MY PARENTS DID NOTHING ABOUT IT. :)**Age 7 to 12:**Same problems - some of them got better, some of them got worse. Got incessantly bullied, LOST MY STUFF ALL THE DAMN TIME - my parents tell me that during my 18 yrs with them, I've lost stuff worth more than $50k in total. Got in trouble with 'authority figures' all the time - constant arguments with teachers - teachers would get triggered because I said something that they didn't want to hear. FUCK SUCH TEACHERS. Fuck all school teachers. They have such an easy job and they can't even do that honestly without leaving scars on a child's mind. I feel like I was bullied the most by teachers. Academic performance was extremely inconsistent. I'd either do extremely well - or do just above average (which is really bad given that I have an IQ of 148). Also, about the teachers, they were the worst they could possibly be. They straight up called me retarded on my face and behind my back, asked other students to avoid me - all of this for my slight quirks and eccentricities. Trust me, at this stage, my behavior was tame enough to not even slightly affect others. BUT THOSE MOTHERFUCKERS DECIDED TO GO AFTER ME. I'm in my dorm alone and I can't help thinking of these events and screaming out loud. LIKE I LITERALLY WANNA SCREAM MY LUNGS OUT. I WANNA SCREAM SO BAD. Near the end of 7th grade, I started to get really into programming and computer science.**Age 13 to 15**I'd spend hours learning stuff related to programming online and doing personal projects but I was extremely distracted so didn't make a lot of progress. Was pretty obsessed with competitive programming. This is the only interest I've been able to sustain over the years and I'm extremely grateful because it's the only reason I could make it to a first world country and it also makes me pretty good money.I got harassed over petty shit for the entirety of eighth grade by a teacher and it made my life miserable. Certain teachers would use me as a prop to laugh at in class. Was severely hit multiple times by bullies. Had multiple traumatic episodes including one where I had to hide from my bullies for 3 hours and it had the entire administration searching (mother was a teacher in the same school). School and parents would always side with the ppl who hated me and hurt me. ONCE AGAIN, A BUNCH OF TEACHERS KEPT HARASSING ME OVER TRIVIAL ISSUES LIKE HANDWRITING. Like yes, I had a horrible case of unmedicated ADHD and my handwriting is hard to read. I TRY. But I struggle. What you don't do is chastise me about how I should try harder.**Age 16 to 17**Enter internet addiction, relationship drama and depression.I didn't have proper access to the internet before I was 14. Weird, I know but whatever. But I got addicted to 20 different sites of the internet real fast and honestly browsing the internet is all I remember doing in high school. I could do decently in tests because I was smart and got rly good at last-minuting and half-assing almost everything.This is also the I began eating impulsive during depressive phases. By the end of hs, I was 50lbs overweight and I'm still working to fix that.I had little to no romantic or sexual inclinations till 16. Kind of a late bloomer. Even now, my interest levels are extremely fickle. The longest relationship I've had in HS lasted like 2.5 months. I lose attraction to people really fast. Also, I spent a lot/most of high school seeking the 8/10s when I could have gotten the 6/10s. I also had some sort of a relationship with another person who also had bipolar toward the end of hs. It got toxic af but welp. I tend to get really obsessed with ppl but also lose interest very fast. Ppl have accused me of leading them on in the past.But here's the thing. I JUST COULD NOT GET MYSELF TO STUDY IN HS NO MATTER HOW MUCH I TRIED. I turned off the internet. I just got distracted by other stuff. I'd spend 10s of hours thinking about random crap. My mind was/is like a restless 5-year old, begging for every sort of instant gratification. But I did well bc I was smart.**Age 18+**Doing pretty well in college - at least on paper - good grades, doing fine with the ladies, making good money, got internship offers from big N companies in the valley. But I AM NOT WELL. There are so many days I can't get out of bed. So many days I'm reminded of a past incident and can't stop crying. I constantly bang the walls of my room and scream when I'm alone. There are also periods I just can't go to sleep. I constantly interrupt people. I fidget. I'm still kind of a meme among my friends. I struggle to get things in on time. (Though I get it done last minute) I struggle with paperwork. I sometimes go days without showering. Days when I barely eat. Or eat a LOT.I just want to feel good. I'm willing to try anything. I have no moral framework. If you can convince me that killing a puppy will make me feel better, I'll fucking do it. If I need to do illegal drugs to feel better, I'll do it.I feel like the entire world's falling apart. I feel like my insides are crashing. I'm living in my own filth - haven't cleaned my room in several months. The only reason my clothes don't stink is because I own a lot of them so I can get away with doing my laundry like once a month. There's trash all over my floor.I have more money than I can imagine needing, but I'm behind on my bills.I have been procrastinating some vital paperwork that keeps me in this country legally for 2 months. Every time I try, something comes up.I have a constant urge to hurt myself. And idk what I'm gonna do.ALSO, GETTING PRESCRIBED ADHD MEDS TAKES SO MANY STEPS I DONT THINK ILL BE ABLE TO EVER COMPLETE THEM.Also, I got diagnosed with bipolar, adhd and aspergers only after I came to college - but now that I think of it - EVERYTHING IN MY PAST MAKES SENSE. I just wish ppl were kinder. I know there's a LOT worse ppl have been thru. I know that I'm lucky in many ways. But I just needed to put my thoughts out there.Also, all my life, I LIE. ALL THE DAMN TIME. IDK HOW TO STOP. At this point, it's hard for me to not lie about anything. It's almost the default."
    },
    {
        "name": "t3_3ihd97",
        "created": 1440634463.0,
        "ups": 25,
        "downs": 0,
        "title": "I just want to share some happiness with you guys.",
        "selftext": "**Giveaway closed! Winners are:**Amazon gift card\\*- Robmackman- claireplane\\*We made it two winners because nobody claimed the HB gift and 2 reddit gold.PC game of your choice- MoklovReddit gold- ByePolarCoordinatesiTunes gift card- LizardQueen96[Photo of raffle draw for gifts with multiple entrants](http://i.imgur.com/V2IE9Ie.png)! We forgot the name of the site that does this for you so went the old-fashioned way and closed eyes, mixed, and picked! Gifts sent!! Thanks for joining and for the lovely comments. ♡ ----------I'm starting over and taking back the life I lost to this illness. It took a while to recover from the aftermath of a decade of uncontrolled bipolar. I really lost everything, including myself.I am currently in step 2 which is going to university for the first time this September (I'm 28). It doesn't seem much but it's huge for me! My boyfriend wants to celebrate but we're in different continents atm so can't be together. He offered to buy me anything I want but I'm pretty contented with what I have. Meds killed my shopaholicism, haha. I suggested we do a mini giveaway in this sub instead. Others' smiles make me the happiest anyway and I know how horrible it can be living with manic depression. I picked 5 small digital gifts that do not violate the [sub's rules](https://www.reddit.com/r/bipolar/comments/1v1w0g/reddiquette_and_personal_information/). They're not much but maybe they can bring you a little smile or help you cope. Sorry, we aren't rich. :-(If you are interested, pleasereply to the comment that has the gift you want. **Do not post or PM your email/mailing address/steam profile. I do not need it.** Keys will be sent via reddit PM.We will pick random winners tomorrow evening. Stay strong, everyone. ♡- Yumi"
    },
    {
        "name": "t3_a1aiz2",
        "created": 1543469038.0,
        "ups": 7,
        "downs": 0,
        "title": "How culture shapes your mind — and your mental illness",
        "selftext": " https://www.bostonglobe.com/ideas/2018/11/28/how-culture-shapes-your-mind-and-your-mental-illness/sMlhWP5LGSOvQAFd83I3qN/story.html“In a significant study published in 2015, Stanford anthropologist Tanya Luhrmann and her colleagues compared how people who met the criteria for schizophrenia in the United States, Ghana, and India considered their auditory hallucinations. The Americans largely perceived their voices as intrusions, violations of their individual mental sanctity, while Ghanaians and Indians had predominantly positive relationships with their voices — Ghanaians tended to hear the voice of God, while Indians described their voices as playful and friendly.Researchers suggested the difference may be in how “American cultural emphasis on individual autonomy” shapes the response to auditory hallucinations as both a violation and a symptom of a disease, rather than as possibly more benign people or spirits; Ghanaians and Indians, on the other hand, were “more comfortable interpreting their voices as relationships.”  “"
    },
    {
        "name": "t3_b3svto",
        "created": 1553215864.0,
        "ups": 3,
        "downs": 0,
        "title": "Long distance relationship with bipolar",
        "selftext": "Hey so it's my first post so don't shout if I've done anything wrong! Basically my girlfriend and I have been together for over a year now and when we first got together she was working away for 5 months in Spain in a hotel. It was tough but she had already planned it so, also it was 2 hours on a plane away so I visited twice, happy days! But start of march she went to India for 4 months to work as a dancer. It's her dream job and I'm so happy for her but I'm struggling back home with my bipolar. I don't want to tell her how I really feel cause it's not fair to burden her and I get angry at her for going away and leaving me but that's very selfish. We don't speak much cause of the time difference and work hours, I know we'll stay together because we do truly love eachother but I just wanted any advice on managing the bipolar lifestyle when your partner is 4000 miles away always happy and smiling and you're home doing a job to save for a house and other adult boring things. Please send any advice! Thanks so much "
    },
    {
        "name": "t3_74enx0",
        "created": 1507221404.0,
        "ups": 11,
        "downs": 0,
        "title": "Anyone who has ruined relationships because of their hypersexuality?",
        "selftext": "I've been trying to reach out to a lot of people I've led on in the name of polyamory but only fucked them when drunk. All of us later on developed feelings but I was in complete denial and didn't want to commit. These men have absolutely complete hate for me and while I'm in a monogamous, committed relationship now, I fear I'm going to cheat or something. Someone on here said something on the lines of not being able to see a friend as a friend and immediately fulfilling a compulsive urge to fuck them. I was manipulative and really inconsiderate. I am currently on medication, therapy and work on self-care a lot. I have a good professional life. I eat well and sleep well and am very self aware. And I'm determined to stay with my SO for th rest of my life and work hard. But since then, one of the men has gone back to London from India and is currently undergoing therapy after constantly lashing out at me as punishment. I feel sheer guilt that I caused him so much pain that he had to go through therapy to heal. Sometimes I even want to kill myself. My friends say there were many other factors for him to go to therapy and I shouldn't feel guilty. But my hypersexuality has caused so much damage that sometimes I wish I was never born. I have ruined lives, I think. Have any of you regretted how you acted out sexually during mania?"
    },
    {
        "name": "t3_86f5qg",
        "created": 1521782154.0,
        "ups": 7,
        "downs": 0,
        "title": "got a tattoo in my manic episode",
        "selftext": "Its kinda funny. idk why but i was like, yea imma get a tattoo. long story short, i bought some india ink, got a needle and tatted a smiley on my chest. i don’t really regret it, i mean, its ugly af, but it makes me smile every time i look into the mirror :)its been there for like a month or two, it’s fine, no allergic reaction at all. lmao[:)](https://imgur.com/9ORzLPl) "
    },
    {
        "name": "t3_bekhfe",
        "created": 1555616192.0,
        "ups": 1,
        "downs": 0,
        "title": "Prefer mania over depression",
        "selftext": "I'd rather be depressed than manic, simply because of the intense shame I feel after my last manic episode. Let me preface this by repeating how others have described my usual self. TimidThoughtfulEmpatheticRisk-AverseThen came the personality changes... The worst episode of my life thus far.  3-4 months of absolute self destruction.  I was in college when out of the blue, I  felt the urge to flirt and fuck every attractive female I came across. Textbook hypersexuality. I'm usually the quiet, if-I-like-you-l'll-ignore-you type of guy so you can imagine how well this turned out. I came on way too strong to both acquaintances and strangers alike.  When I thought I was being confident and charming, I was really just an arrogant asshole. I also dropped out of school to start a business. I spent $5000 in 3 months on useless shit. I convinced my friends and family I had this million dollar invention in the works feeling like a fucking god with a vision only I could understand.  I felt morally correct in stealing jewelry from my family to prolong my idiotic spending habits. I even convinced my girlfriend I was moving to India. She broke up with me on the phone immediately.  When I finally came down I felt more shame than I've ever experienced. Do you know what it's like to try to run a new business with no prior training while depressed as hell? I was so anxious, so suicidal, so shattered... I literally ghosted everyone involved in my business because I just couldn't face them. I sent one email and apologized for my erratic behavior and let them know it was a bipolar episode. But I couldn't bring myself to read any of their responses, so I cut them all off without warning.  Its been a year and I still feel like shit every day for what I did. I'll start randomly cringing... my whole body will tighten when I think about specific things I did. I'm too much of a coward to talk to anyone about this face to face, not even a psychologist or close friend. That's the level of shame and embarrassment I feel. Now I live with my mom and hide from life like a coward.  I'm too scared to go back to school, too scared to apologize to the individuals I've wronged, and too scared to move forward in life. All directions are laced with doubt and fear.  The meds help, but they don't change the past.Anyone else has had a similar experience? I'd like to make a few moderate goals, find a purpose, and maybe a few friends. That's all I want."
    },
    {
        "name": "t3_3g62vt",
        "created": 1439007151.0,
        "ups": 23,
        "downs": 0,
        "title": "Well I've been a lurker for a while.",
        "selftext": "But now I've decided to join this community due to the crazy amount of love, support and all-around awesomeness on here.Because as of yesterday, after a damn rollercoaster of a childhood and high school years, I have been officially diagnosed bipolar- nos (the rapid cycling kind of thingy - still kinda confused about the terminology and stuff). Hooray! I mean, shit! Hooray! I mean, shit!"
    },
    {
        "name": "t3_961zm0",
        "created": 1533888889.0,
        "ups": 2,
        "downs": 0,
        "title": "Bipolar type 2 and relationships",
        "selftext": "Hi guys,I'll just launch right into it: I've had a few long term relationships now (my last was 2.5 years) and each time I find it very difficult to detach after a break up.The girl I was with last was always very supportive, and I was with her as she had struggled with anxiety and depression until recently. About a year ago after a long trip to India together she said she didn't feel a romantic connection anymore. However for months after (until May this year) we were still doing virtually the same stuff - sleeping over at her place, sex, cuddling, activities. In May she got a promotion and moved to another town a long way from me. She was living with me for a while before she left.It was extremely traumatic for me when she left and I still get very sad when I think about it. I cried for weeks over the loss as if she had actually died. Everything here is attached to a memory of her.She has very quickly gotten over it and barely talks to me anymore. Certainly she displays no affection whatsoever anymore. However even with all that I just can't detach, as much as I try. I miss her constantly and use escapism most of the time just to deal with it. I'm not interested or even look at any other girls, but I know she is probably with considering other guys where she lives now.I'm wondering if anyone else with BP2 has the same experience and there is a correlation? "
    },
    {
        "name": "t3_6o478q",
        "created": 1500444947.0,
        "ups": 3,
        "downs": 0,
        "title": "International travel and med schedule",
        "selftext": "I'm going on vacation to a place that has a 12 hour time difference. I'm wondering if I need to skip a dose or how I can work this.My morning pills are stimulating like strattera and Wellbutrin and my night pills are sedating like Valium and geodon. Otherwise I would just switch my days and nights. "
    },
    {
        "name": "t3_6l8csa",
        "created": 1499217363.0,
        "ups": 2,
        "downs": 0,
        "title": "Bipolar prevalence in different countries",
        "selftext": "It's low in India and japan but why? Is it because of the stigma towards bipolar/mental health? (Can I get opinion from anyone of origin?) Or is it because of their diet? Japan eats a lot of fish. http://edition.cnn.com/2011/HEALTH/03/07/US.highest.bipolar.rates/index.html"
    },
    {
        "name": "t3_3gpx23",
        "created": 1439414529.0,
        "ups": 6,
        "downs": 0,
        "title": "Help me with a choice?",
        "selftext": "Alright guys so I've been hanging around these forums writing up posts all the time and different crazy ideas I have but this time I could probably do with some advice. I went to visit what I thought would be a psych today, turns out it was just a person who refers me to see a psych so I got put on another waiting list to see a psych after 4 weeks. This as you can imagine is quite frustrating, I left Australia as I thought it was going to be good for me to have the support of my family and get medical specialist attention quicker but turns out it was quite the opposite.So Now I have choices, I've already booked a flight to Australia for next week on a whim because the flights were cheap. I fly to Perth from the UK for £380 and the plan would be to make my way to Melbourne to work at a ladies house helping her out with certain chores, practicing yoga (she works for a yoga studio) and meditation and hopefully gain my second year visa in Australia which would require 88 days of regional work. I've emailed her today to make sure this is all ok as I don't think she quite believes I'm going to fly all the way from the UK so I'm going to wait and hear what she has to say. Down falls of this choice is I'd be quite secluded, in an area where I'm not going to know many people but I guess I can get to know people.My other two choices are this. My flight to Australia flys via Bali, a place known for being spiritual. I'm really trying to explore my spirtuality if you can't tell as I feel like i really need to discover myself and try and figure out how to be content with life. I received an email back from a place today that said I can stay there for 10 days and do a pretty intense silent mediation routine aimed at dealing with the stressers of life. It's pretty intense, like no talking at all for the majority of the time while there. Have to dress modestly, no use of technology, no books etc. So it's pretty hardcore. It would be an extreme change and maybe what I need but also could it be too much? This is the site if you want to check it out? http://www.java.dhamma.org/indexeng.htmThey even have a disclaimer on the email saying \"By completing the accompanying application to participate in a ten-dayVipassana meditation course, the applicant acknowledges the foregoing warning and in consideration of being permitted to participate in the course knowingly grants to the organisers of this course, Vipassana Meditation, and its associated organisations including Vipassana Centres and teachers, a complete, total and unequivocal release of any and all liability for any adversemental or physical consequences which may result directly or indirectly from such participation.\"So yeah a bit worrying haha.Anyway 3rd choice, I can fly to Portugal tomorrow and meet up with a bunch of friends I met travelling last year and travel with them for a while. They love to party which is something I will have to try and avoid for the time being s obviously drink and drugs are not good for people with mental issues but they all love me and are super supportive. I then have the opportunity to either travel with one group to Turkey or with my one friend to Croatia to work for a while then maybe India (I'd probably have to forget about Australia if I took this trip or at east postpone it for a while). This would be good for me to be surrounded by friends but also the temptation of slipping back into the party lifestyle would be there, however i do think I've grown enough to avoid this and just enjoy being with people and traveling.My final  I guess option is to just stay home I guess but as of now things aren't really improving. Doctors take so long to see, I keep getting put on and taken off medication and my whole faith in the system has just gone so I kind of don't really see staying here as an option anymore. I'm kind of writing this all down for myself but also to get a few opinions from you guys too. So yeah, any help appreciated. A bit of a quick background, I've been dealing with anxiety, depression, suicidal thoughts, mood swings, self harm, thoughts of going crazy and all sorts of stupid stuff (there is a possibility i could be bipolar). At the minute I feel quite normal, I think getting out of here's a good choice but just making the right decision is difficult. I'm kind of swaying towards Portugal at the moment because then i have friends around me but if I'm going tomorrow that's going to be quite the rush job. Anyway guys, any help appreciated."
    },
    {
        "name": "t3_1g139l",
        "created": 1370872731.0,
        "ups": 11,
        "downs": 0,
        "title": "Rant - The most negative person I know",
        "selftext": "So I was talking to a friend, a really good friend, someone who likes me, and telling them that I just can't deal with my sister-in-law anymore for many, many reasons but the most important reason is that she she sent me a nasty email and ended it with \"You're the most negative person I know and I have to save my energy for the good people in my life.\" And in her defense he said \"well, you are the most negative person I know, in a sarcastic and funny way but still.\" He wasn't trying to be mean or anything like that. I know he likes me and that he's giving me a hard time but there was a note of truth in it. I am sarcastic and negative, in particular toward people who spout inane platitudes such as \"The way to get out of depression is to not be depressed!\" It's true that when someone says that to me I tell them (in a nice way at first) that they don't know what they're talking about. Which hurt on many levels but the truth is that sometimes I am negative. I'm fucking bipolar for fuck's sake. No one in the history of the world is more negative than someone who's depressed. But more than that, when I'm not depressed I still realize that my life isn't as awesome as some other people's. Not only didn't I get the career I had dreamed of I have no ability to provide for myself at all, I live below the poverty line and it's merely through the grace of friends that I'm not homeless. I am on Medicaid which means most of the doctors in the country won't even see me and there is a waiting list of months for the ones who do. I live on food stamps so I have to plan carefully to eat good food. I've lost sooo many friends after I told them that I'm bipolar or after they saw evidence of my madness, intimate relationships too. I decided not to pass this shit on to a child so I never got the family I so longed for, I can't just take off and travel without mapping out time zones, a months worth of medication, and my psychiatrist on speed dial, the list goes on. This disease effects things that most people never even think about. I have to guard my sleep, I can't go out and get drunk with the gang. I'm so fucking sick of being the designated driver! Every fucking day is a struggle with poverty, madness and disappointment. But I think the thing that hurt the most is that he has no idea how many times I bit my tongue. How often very negative things go unsaid. How frequently I watch him with his job and his family and his ability to take a red-eye flight to India without a manic episode or the times he casually has another beer or decides to see a midnight movie or the millions of other tiny decisions he makes without thinking \"Is this going to fuck up my mood?\" and how frequently I wish I could do those things. I felt like he was saying \"well, sure, your life is shit at least half the time but the least you could do was be *cheerful* about it. I mean, no one wants to be around a Negative Nellie all the time.\" If anyone who's not bipolar had any idea how much we pretend not to be depressed when we are, not to be disappointed that we can't do the things normal people take for granted, if they knew that we only seem negative to others when *we can't hide it anymore,* maybe they'd cut us some slack when we're not cheerful every moment of every day. "
    },
    {
        "name": "t3_5vrppm",
        "created": 1487899601.0,
        "ups": 6,
        "downs": 0,
        "title": "Feels funny you know",
        "selftext": "Here I am, India time 10:44pm, swallowing fucking meds Meanwhile my cousin is in Goa, running along the coast keeping true to his fitness regime. I'm still not able to figure out the fucking how's. And then there's a friend who's getting engaged tomorrow. And here I am, swallowing fucking pills.I mean I don't know. Who the fuck asked for this? None of us did.And yet we have to go through the same old motions again. We have to drown ourselves in pills. What am I gonna tell my future girlfriend or wife? Oh yeah babe, I'm mentally clinically insane. So I'm on meds. And which woman is gonna be accepting of that? I don't find any fucking takers. I mean... What the fuck If anything, being bipolar makes me want to do better than the normal people out there. I want them to know. Hey, screw you, I have bigger problems than you and I'm still beating your ass. I'm still doing better.But that day seems far away, you know? Everyday I manage to wake up with the familiar blues and I put my ass to work. But it's not enough. It never is.I'm still behind. And that infuriates me. It makes me wanna bang my head against the wall, it makes me wanna cry. I don't need this. I have so much on my plate and I wanna be doing better. So why can't I? What's pulling me down? I wanna fucking know. I wanna address it. I wanna know what I can do to make myself normal. In this shitty world where every one is judging one another (at least in india, believe me, they are) I wanna be the best out there....and I don't wanna complain. I wanna act I wanna be the best....I don't want this fucking illness pulling me down, please I don't, god "
    },
    {
        "name": "t3_5b4pod",
        "created": 1478307349.0,
        "ups": 2,
        "downs": 0,
        "title": "Aced job interview on a high, now i can't brush my teeth on a low not even 24 hrs later.",
        "selftext": "I just went in to a job interview yesterday, fully expecting to get into the photo department at a local pharmacy.  They loved my answers to their questions so much that they thought I would do better as a shift lead (an entry level manager position).  I haven't worked in two years.  The answers weren't even lies I really enjoy making sure that things run smoothly and have the personality for great customer service.  Right now I'm in between diagnosis and med changes.  Just about 6 months ago I was diagnosed as BP2, previously major depression.  I'm pretty happy that I now have the diagnosis that I always knew I had.  I guess that I had so much built up resentment from my previous doc for keeping me on a med combo for about a year that was wildly ineffective.  I bounce in between hating psychiatry and seeing it as a necessary, not evil tool (paranoia, maybe?).  Three months ago I completely went off of wellbutrin 150 mgs, and I thought that I was handling it well until now.  NOW is when all of the medicine has truly left my system.  Or maybe this is time for my lows.  I'm having a hard time recognizing my mood shifts because this is all new to me.  Anyways I'm just at a complete loss at how to proceed.  I've been taking 10 mg of Latuda at night for the past few days, and I thought that it helped at the beginning, but I definitely need more stuff.  My appointment with a nurse practicioner I like is on December 21st.  She actually wrote me in that script about two weeks ago.  My therapist said she usually doesn't do that.  I have a therapy appointment today.  I'm going to see if I can get back on Wellbutrin at least, maybe add risperdal because the small amount of latuda does make a positive difference.  It's just too expensive for my tastes.  If that falls through, is my only option the hospital? The one near me is good on the outside, it's recently updated, but last time I was there a patient groped me and another walked into the shower stall when I was taking a shower.  And the head doctor keeps pushing acne treatment on me because he has a dermatology practice on the outside and wants $$$.  I've gone into med appts with him before, and 75% of the time he's tryint to convince me that using the cream will improve my self esteem so much that I'll get a husband and my figure is nice, you can't let your face ruin your figure.  He from India, and I know that the treatment of women there is not good so I can understand where he gets these wacky ideas.  But I'm there for medication not to argue with him over his beliefs.  As a patient, what rights do I have in this case?I think that I may need to visit the hospital because my symptoms are getting so bad, but I'm so scared shitless and these experiences bring up my PTSD.  Can I tell the intake people that I want a specific dr and protection from patients that I feel uneasy around?  Or are they just going to say \"sorry, we can't help you, you are a liability\"?.  The social worker last time did acknowledge the...intrusion and I brushed it off at the time.  Any help is appreciated.  "
    },
    {
        "name": "t3_22vieg",
        "created": 1397361958.0,
        "ups": 3,
        "downs": 0,
        "title": "I realized something today (Rant?)",
        "selftext": "So, anyone who is familiar with my posts knows I don't get along with my psychiatrist very well.For those of you who don't know, my pdoc is free through my university. She is the 4th or 5th doctor I've been passed around to (depending on where you start counting) and she is by far the worst.I recieved a Bipolar II diagnosis after a LONG journey of doctors, diagnoses, and medications from my doctor before this one (whom I loved, might I add). That doctor left, so I began seeing my current pdoc. She changed the diagnosis to Bipolar I. I saw her for a couple of more months after that before I lost my health insurance and couldn't afford ANY medication, even with a discount card. She became extremely judgmental and pushy when I told her I needed to taper off this medication, which I understand to an extent because of how common noncompliance is in many bipolar patients. But it was just so overly negative that I just stopped showing up to my appointments and tapered off myself (I've been off and on SO many medications, I'm a tapering champ.)Eventually, I got my insurance back. So I called to start seeing a pdoc again, I wanted to see a different doctor, but she is 1 of 3 available doctors because so many have left. So I saw her last month.Now, she's saying that she doesn't think I have bipolar, but depression and anxiety instead. I went through every class of anti-depressants with NO relief years ago, but because she didn't witness it, she almost seems like she doesn't believe me.At first I thought the issue was a slight language barrier (she's from India), so I was really trying to figure out a way to better articulate my issues for her, since I really have trouble expressing myself.I realized today that the problem isn't with me and my problem articulating, its the fact that she only sees things as black and white in terms of the DSM and mental illness.What I mean by that is, my symptoms DO fit into the DSM's criteria, but they aren't as severe in some of the more stereotypical symptoms.I haven't ever become so manic that I try to fly off a building or needed to be hospitalized, nor have I ever been so depressed that I've attempted suicide. But isn't it better to prevent those extremes from every happening, rather than wait for them to occur before you agree with my past diagnosis?My symptoms are what I would describe as floating on the higher ends of the two poles. I have gotten so depressed that I stopped going to classes completely and almost got kicked out of college because my bed was just so much nicer to me than the rest of the world. I have also spent so much money chasing an unrealistic idea that it would make even the wealthy hurt.I suppose my point is that she had me questioning myself so much, I was questioning whether or not I was just making my symptoms up in my head. But who knows my experiences better? Me or her?Anyway, I have to find a new pdoc towards the beginning of June. It'll be interesting. I found one guy who has a bit of experience, but isn't a dinosaur either. I might go with him. I just have a hard time determining who is a good doctor and who is just going through the motions.Thank you for reading, if you have :)"
    },
    {
        "name": "t3_3paeu1",
        "created": 1445241141.0,
        "ups": 6,
        "downs": 0,
        "title": "Are you living on social security disability? How long have you lived on it? How much do you get and how do you survive on it?",
        "selftext": "I've been living on SSID for almost a year now. Thankfully because of a previous high paying job I get paid at the larger end--$2000/month. But living in California on that amount is still difficult and thankfully I've been staying almost rent free with my brother so I can save some of what I get to pay off bills from my previous episode. Although that's all coming to an end as he's moving and I need to find my own place to live. Now comes the challenge of finding something I can afford. I've considered moving out of the state to somewhere cheaper but then I forfeit my support network. I've also considered traveling to a cheap country like Thailand or India to save up money but fear getting trapped in a foreign jail if an episode is triggered. "
    },
    {
        "name": "t3_13xbqi",
        "created": 1354119944.0,
        "ups": 3,
        "downs": 0,
        "title": "I'm traveling to a vastly different time zone soon, how do I change when I take my pills?",
        "selftext": "I'm traveling to India from the west coast in about a week. I take my pills (lamictal and celexa) at night before bed because I sometimes get sick and throw up in the mornings. If I keep my doses 24hrs apart I'll be taking them in the morning, but I want to shift my dosing to evenings there.Any advice or strategies? I'm worried about having a lull between my doses if I skip that first morning and wait until night, but I think doubling up is an even worse idea. &gt;_&lt;"
    },
    {
        "name": "t3_29ebkk",
        "created": 1404084504.0,
        "ups": 4,
        "downs": 0,
        "title": "How do I know? Hallucinations.",
        "selftext": "Okay so I am an international student studying at a reputable southern engineering college. I have been depressed for the last two years and now my doctor back home (India) tells me that I am Bipolar type two and I am on meds for that. My question is about hallucinations.So as I don't know about this and hard to describe but I will try. When I used to make conversation in the background people mostly white southern americans used to say things like \"Love you bro\" or hug each other when I turn and look. I used to get a feeling they know me/something about me and are trying to help. We used to live in a student apartment complex so its normal for people to have familiar faces. I HOPE I WASN'T HALLUCINATING! WAS I?Or it was just some cultural thing to encourage me to see someone or get over my weed addiction or so I feel nice and not depressed. Please help. :)"
    },
    {
        "name": "t3_1m3flv",
        "created": 1378832894.0,
        "ups": 1,
        "downs": 0,
        "title": "Just found out I had a mild bipolar disorder among other things",
        "selftext": "I have been suffering for the last nine years and have gone through multiple diagnosis and doctors. Started with being told I have a mood disorder in 2004 and got fed medicines (upto 12 to 14 in a day), did not seem to have much effect. I then shifted doctors and got diagnosed with borderline personality disorder through new tests and new medicines ensued. Constantly cutting myself and overdosing to stop the pain in my head, I just continued to keep taking medicines and not going anywhere. This was all when I was in India.Fast forward feb 2013 and I am in Atlanta, GA on a work assignment and I meet with a therapist and psychiatrist and get help again. On my first visit to the psychiatrist, he tell me I don't have borderline personality disorder and I have dsythymia, social phobia and major depressive disorder- recurrent.After a few sessions with my therapist, he now tells me I am showing signs of hypomania and I have bipolar tendencies as well.What the fuck is wrong with me and why is no one able to clearly understand what is wrong? I am lost and looking for help and guidance. I am extremely sorry if I bothered you about this, but I don't know what to do."
    }
]