[
    {
        "name": "t3_jzyust",
        "created": 1606223896.0,
        "ups": 0,
        "downs": 0,
        "title": "Anybody from india wants to talk?",
        "selftext": "I am extremely depressed and suicidal and want to talk to somebody."
    },
    {
        "name": "t3_jjgx7k",
        "created": 1603886387.0,
        "ups": 2,
        "downs": 0,
        "title": "Depression with Psychosis. how to overcome",
        "selftext": "Hola everyone who read this. I am a 21 year old female who has suffered from depression for straight 3 years now. I am fro  india. So. when my country imposed a lockdown, my mental health suffered the most. I was taking Bupron XL 150 mg and an anti psychotic for my suicidal ideation from 2018. I got severe side effects so I stupidly quit everything cold turkey.  Fast forward 20 days later,  i started hearing voices and thought they beat me( i had hearing and tactile hallucinations) when it was me who was self harming myself. And i started seeing a guy who has a black coat and who kept on calling my name and asking me to come and see him. I was so scared at one point i pissed myself. I confessed my feelings to my brother who immediately took me to a doctor and got me meds. Also i had nightmares every single day ansd panic attacks that followed after the nightmare. So my doctor had to presrcibe a lot of meds. Now i am past that psychotic episode but have severly impaired social skills and i get panic attacks for small and small things. I cant even send emails. I am worried it will show up in my career so I am not even searching for any jobs.(i am fresh graduate). I start hearing voices whenever i am stressed out. I am tired of all this bullshit. I am also feeling low because i am unable to do anything except sit out and wait for it to go away. I tried to paint, drive cars , ride a horse everythign distracted me for a while but the low mood always came back. I now exercise daily but it doesnt help out much. I do eat my tablets daily. I used to love eating different stuff.  Now i dont have any energy to even eat normal meals, nor get out my home. I dont have any coping stragies that will  help my depression(psychotic episode is now controlled by meds). Can you help me out?"
    },
    {
        "name": "t3_jyymsm",
        "created": 1606092025.0,
        "ups": 3,
        "downs": 0,
        "title": "Life of me",
        "selftext": "I'm calm and collected, and not emotional whatsoever at the time of writing this. English isn't my native language so, my thoughts may be incoherently expressed here.For the past couple of years, I've felt shitty, it may have started from my high school. Depression was something I never quite understood back then as it can often be conflated with having a bad day, but now, I know what's like having one because I had memorized the telltale signs of it every day and night. It's ruthless and cold-hearted, it doesn't want you to die, it makes you devoid of any semblance of hope that this shitty life can throw at you. It lingers just to feed on your soul every day keeping you barely alive in the process.During my depression when I was in college, I had stopped eating properly, I never saw daylight since I had always cowered in the dark(my bed). My life felt overwhelming, even the tiniest bits like going out to fetch water seemed like a daunting task. Things started piling up and my grades were already a joke at that time, my teachers are nincompoops to add to the list of reasons why my life took a shit turn to shit town(btw I'm told I'm in one of the best universities in India, yet they never really understood the simple composition of shit, maybe it makes the mirror too foggy to look at). Never really had a good friend with whom I could shoulder my pain, still don't have someone pour my emotions. Never dated once in my life, I don't even have the remotest possibility of making a friend who's a girl(cultural issues). My future seemed bleak with no hope left. This was my current state of life at that time.Do you feel for me? I feel for every person who has to go through this kind of trauma in their life, it isn't a part of a normal life.What happened then you may ask? Well, my college fined me for 1000$ for not attending classes.... and for more context, my family earns 4000$ annually(again it's India), and we have to pay 2000$ as fees every year just for college, we've no savings, and no secret apple stocks in my parent's stock portfolio(I'm their agent), it broke my parent's heart and soul to pay this and to see their son like this(I had told them the last day before the fine was due, Imagine that).If you're still here after reading this rant, I've to say I'm thankful to you stranger, you know me better than most people I have in my life. I can now see a glimmer of hope these days at least when I wake up.The pandemic happened(duh), I left college and I'm in my home now, I've started taking pills for my anxiety I'm diagnosed with social phobia and depression which I can work on my own with a little nudge now and then, and do meditate(mindful and metta) at least a couple of days in a week(it's helpful and I can't really emphasize how much it helps just by words). My mind still feels dizzy most of the time, I don't have the clarity of thought I used to have. But overall it improved and I hope it would continue.I know most of you reading this went/going through a different kind of shit. But it's shit nonetheless. I hope you could also see 'hope' at the darkest moments in your life."
    },
    {
        "name": "t3_j6rp6s",
        "created": 1602109241.0,
        "ups": 11,
        "downs": 0,
        "title": "Depression leads to vicious cycle",
        "selftext": "I get depressed, which hampers my productivity- I can't remember things, I have no urge or motivation to do anything, even listen to music. This leads to me failing at things- exams, and life in general. This leads to more depression.I don't know what to do. I am from India, where getting help is really tough. The number of psychologists is really low. I always feel so irritated with myself. Please help me.&amp;#x200B;Thank you for taking your time to help. I really appreciate it."
    },
    {
        "name": "t3_jhu1m8",
        "created": 1603664294.0,
        "ups": 4,
        "downs": 0,
        "title": "Depressed with loneliness. Please help me.",
        "selftext": "Hey Guys,I am an 25M, engineer (from India) doing my masters at a very reputed institute. I have been a geek/nerd from my childhood and have been considered as a prodigy in technology ( computers and electronics in stuff). Due to this, so many people approach me asking for help and I help every single person who approached me. In the beginning, everything seems looked cool and all, but as time progressed, I started feeling lonely. I never had any real friends in school for some reason. I was always treated like a guest or something but it didn't bother me at all, even thought I know they never thought me as one of them.Later, I joined College all started to settle nicely. I started dominating the academics naturally and as usual, I started helping all seniors and faculties with their project and research works. Slowly things started taking turn and I started feeling like how it was in school. I got a GF ( we never proposed or anything and it just happened) and for some time, I felt I got someone for lifetime. But then things never took turn as usual and she never gave time for me. She always spent most of her time with her friends and I got very little timing and at one point, she realized she's not able to spend any time for me at all and we broke up. I realized people just stay around me only to get their works done and the moment its over, I was left alone.  Later at some point of time, I realized (through their literal words) those whom I considered as friends never thought of me as same. I felt betrayed totally and this time I realized I need people in my life. I am dark skinned and It always was a problem for so many people. Throughout my life, if people can't win over an argument, they resort to making fun of me with my color tone. This happened so many times that I started feeling like shit ( or Am I am really a shit and dark people like me don't anything ? ). I lost my confidence in social and personal life totally and I feel too nervous to even talk to any girl.  I realized I won't ever get a GF because I am dark and this feeling of self rejection started growing day by day. I did manage to get real friends, who actually cared for me. But they are just friends and nothing more and I feel they might leave me anytime. I wanted to get into my Core Domain based Tech Company and I did manage to achieve it and acquired an Internship at a very reputed company which almost all of  you knows know very well. I achieved almost everything I wished for in professional life. But along with this, my feeling of loneliness started to grew exponentially without any bound whereas my self esteem went deep down and it grew into a depression. My crush rejected me without saying a word. Or that person might already be committed with someone else. No matter what I do, hang out with friends, chat whole day, watch movie, listen to songs, I feel depressed. Since lockdown started, I am stuck at home with WFH and didn't meet anyone for almost 6 months. And almost the entire day I feel depressed. I am unable to concentrate on anything. All my friends are starting to get married and I feel like I will be alone forever. :-( Its hurting me way too much day and night continuously.In India, there's a total fucked up shitty concept known as arranged marriage where parents arrange marriage for their children. My parents had an arranged marriage and from seeing them day to day, I realized it literally near impossible for me to marry a stranger like their generation did. And I am not able to find anyone myself. My parents hardly know anything and if I try to explain anything, it will just end up backfiring me. All my close friends are committed and have someone at the end of day whereas I am literally alone all day and night with this PC and Laptop. Their words of encouragement are not even entering my ears. With zero self esteem, zero social life, zero personal life, I feel like I am a total failure who just has professional success. I am not able to think of anything else all day and night. It hurts  way to much and every single minute passes like a day. Do I don't deserve anything ? People who cheat, lie and act fake are getting everything. I never did anything like that I am alone all day and night. Please help me :( .. I am going crazy to the extent of hurting myself physically."
    },
    {
        "name": "t3_j84zsw",
        "created": 1602298701.0,
        "ups": 4,
        "downs": 0,
        "title": "Someone else had experienced this?",
        "selftext": "Hey I'm a physician from India and been suffering from moderate to severe clinical depression since last 4-5 years, on and off on meds (currently off) and currently also recovering from Covid-19. I have been in isolation for about a month now and it has been hell as most ppl would understand here. But still I coped up and have managed so far and expect to get out of isolation in next 3-4 days. Recently for last 4-5 days I have been pampering myself with good food and stuff like that so as to make it because before that I was extremely affected and suicidal thoughts weren't leaving my mind. Though we all know how much self motivation stuff works but still trying everyday is what we all do right? But still I was feeling like it's more of toxic positivity than helping one, having all these thoughts I spent last few days and I kind of just made peace with my thoughts yesterday that whatever it is I just have to bear for 5-6 days only now....so let's just hang on. No pun intended.Anyway, coming to the main reason I'm posting this, I realised something this evening which I was facing whole day today. For no reason at all I wasn't able to focus on anything. Like we all know how that is a part and parcel of depression (and being a physician also I know how it works n all) BUT it was different this time!The whole day I didn't realise that i was losing focus from things......like repeatedly doing same task again to realize that u have been doing it again n again.......i know that happens a lot normally too but this time it was like even after noticing, my brain actually didn't react to it......like everything that went on through-out the day kind of went subconsciously. It's like I was kind of disoriented the whole time. Not that I wasn't able to understand things, but kept losing my focus every few seconds, throughout the day without noticing. And you can guess that I'm in isolation so there's already not much I'm doing but still everything felt wierd when I noticed how I wasn't paying attention to anything throughout the day! I talked to friends on phone and while some of them noticed that I'm not paying attention to the conversations, I still wasn't noticing. Even while writing this I'm losing focus and writing and rewriting as best as I can to explain this but I don't think I'm able to. It's like my thoughts are fleeing (which I know how often they do) but this time mind is not really going anywhere, it's just blank or maybe I can't think what it's thinking. IdkWill try to communicate with my psychiatrist asap, but hope someone here would atleast help me out if they ever experienced the same or similar situation.ThanksP.s. To everyone here, you are doing a wonderful job, just keep breathing! :)"
    },
    {
        "name": "t3_j9exsh",
        "created": 1602484085.0,
        "ups": 5,
        "downs": 0,
        "title": "Am 21, was diagnosed with major depressive disorder and anxiety at 19. Thankfully after 8-9 months of treatment was cured. The cause, I think, of depression is still there and today it slightly broke me.",
        "selftext": "Am writing this post after having a crying episode in the middle of the night at 3am. Been staying at home and just doing coding (am CS undergrad in India), the lack of exercise and hours of sitting caught up to me today, I have developed bad knee pain and cracking sounds and today they were very bad, can't sleep because of that and bad sleep schedule cause of my recent exams.So yeah was in bad pain due to knees, then there's the mental stress. My parents constantly fight and that contributed a lot to my depression, it got worse during my vacation when I was 19 and had to stay at home for 2 months with them away from college. It got so worse that I had to go see a psychologist all by myself; morons still don't believe in mental health problems it seems like that listening to them.Now also they have been bickering a lot, it was a weekend so the bickering gets amplified, had knee pain and then there were some competitions and work that have me stress. So yeah I had a crying episode, feeling slightly relaxed now.Am going to take care of the knee pain and get away from my parent even if it's covid and all, they've done nothing but give me mental health issues and I just can't handle developing depression again.I've also developed body image issues it seems thanks to them. Have lost most of my hair and gained extra 15KGs or so. I'm 21 but look like in 30s according to my friends.I have some not so close friends, can discuss college and trending things with them but that's it. Was always a loner, not by Choice. Anyone has any advice for me, I just want to live a normal life man, for once when I don't have any health issues and don't live in an environment where someone's shouting everytime."
    },
    {
        "name": "t3_j0g78n",
        "created": 1601191404.0,
        "ups": 3,
        "downs": 0,
        "title": "I just want to end it",
        "selftext": "I am a [28M]. I work for a gaming company in india. That about all there is to know . Now lets start with my shitty life. I am facing depression since i was 15 because i was fat and kind a ugly and my parents told me i wasn't part of the family. After 10th grade i join a collage as everyone does. It was not that far from my home but i still live in hostel as i wanted freedom and paid my fees with scholars. I was introvert and a nerd ,yeah i know a deadly combo,but i had met a very good friend in college who was like ass biting serpent but i did not know,but he did 1thing that to get me into shape . And i got into shape in about 2 years of my college . After i saw those muscle of mine, i felt something positive inside me and because of that i trusted my friend like no other . So i got my diploma in computer sciMy friend came with me to that same college, as by bad luck he had also gotten the same college.so first year went without anything bad happening.then came the second year where i was happy like no other person because i dated my first gf [now ex].But the third year i got a tight slap for trusting a friend as he was sleeping with my gf from the beginning of my relationship. I felt so bad that i did not even talked to them. I just felt betrayed and because of that i got again in my shell of depression.After that i got the degree and also got a internship a  company. In that company i became friend with guy . Because of him i met my future wife. She was the sweetest person i ever knew and a trustworthy too. She broke me out of my shell and help me see the life a little bit positive.After 1 year i got a good paying job but stressful one at a gaming company. And after 3 yrs i married my wifeThe life went without a hitch until covid hit my country. Covid also took that was very dear to me ,my wife .After that i have been a waste of a human being, i am writing this post with 2 empty box of  cigarettes and a empty bottle of beer It will be great to hear some advice before i kill myself as there are some people that care about me but were just to late to help me"
    },
    {
        "name": "t3_gpjbmp",
        "created": 1590322996.0,
        "ups": 2,
        "downs": 0,
        "title": "Sadhguru Life Changing Speech - DON'T MISS IT! Most Inspiring Speech For 2019 | Mystics of India",
        "selftext": ""
    },
    {
        "name": "t3_if3qd8",
        "created": 1598220289.0,
        "ups": 26,
        "downs": 0,
        "title": "I wished I never existed",
        "selftext": "I am a nobody living with parents in their house. Since the pandemic started I feel very disconnected I knew that I am introvert but still I feel low all the time. I don't feel like doing anything like not even drinking sufficient water or having food. I have no friends, I am getting irritated by everything anyone does to me, for this, I am barring them to talk to me. I feel like I am just a burden to my family. I am a college student so I do stress about getting a decent job. Moreover, I live in India, no one absolutely no one will understand that there exist mental illness like anxiety or depression.  I can't seek professional help because of the pandemic. I did an online psychometry test to check if anything was wrong with me but it shows that I am extremely depressed. I don't know what to do next. I am not suicidal but I won't be unhappy if I die. I am sorry of the marking on the picture"
    },
    {
        "name": "t3_ium2kl",
        "created": 1600386433.0,
        "ups": 1,
        "downs": 0,
        "title": "How do I get over this?",
        "selftext": "I've been recently diagnosed with depression and turns out I've been depressed for almost 4+ years. I didn't get into the college of my dreams. I live in India. I took an year off after high school to get into a better college and I didn't. I have no motivation to study. My dad keeps telling me I can take a break and apply for master's degree once I feel better but I feel like I'm pathetic and using my parents.All my friends are getting great jobs and travelling to new places. I feel like I'm stuck. I recently started therapy and I'm on medication. I was a smart student. My teachers in school had such high hopes for me. Will I ever not be a loser?"
    },
    {
        "name": "t3_hzg8te",
        "created": 1595977460.0,
        "ups": 6,
        "downs": 0,
        "title": "Depression and parents",
        "selftext": "Okay so i live a country and society where parents are supposed to be treated like gods (India), even if they're doing the exact opposite thing. I was literally bullied entirety of my school life and bc both my mum and dad used to go to work they never had time to listen to me or my brother. I've been depressed since I don't even know and i recently a doc told me i also have ADHD. When i was a kid the only thing my parents ever spent on was our education and nothing else. I didn't had toys or anything, i wasn't allowed to go outta house, even packed chips and stuff weren't allowed. I remember how my father treated my elder brother.. he used to beat him for low marks in school and many other stuff which is harder to explain. We were never taught any manners or any kinda stuff, bc my parents were busy with their work they never thought of asking their child if they're okay or not or even teaching something good. They always expected from us that we suppose to know everything. Even when my brother was suffering from stage 3 brain cancer and was in stroke paralysis my dad treated him like shit. I used to think that my dad has work pressure that's why he's abusive and all but when my brother had cancer my father was retired so i still don't know why he treated my elder brother like shit (my bro died aug 2018). Last year around may i had a severe panic attack where i was literally choking and unable to breath bc i also have hypertension, it happened in front of my parents and when i was stable after like half hour later i told my parents \"i think we should go see our doc\" and they said \"you're on meds, it's your fault if something happening to you\". I suffer from anxiety disorder and panic attack prob alongside multiple other mental illnesses and this is where \"parents should be treated like gods\" and emotions and stuff comes... I always want to believe that you know, my parents do their absolute best According to whatever knowledge they have about parenting but still the way my father used to abuse us is still unjustified. My father wants to me live a life he have thought about. My mom's a lil good though, she cooks me delicious food and stuff but she also expects me to do everything on my own which is too much for my mental health. It's just miserable here. I still care there are still emotions bc maybe I'm raised like that but still my mind says what's wrong is wrong. I have some good friends that keeps me alive i guess. This whole \"parents are god\" this is a mess in India and it's just too much on a childs fkin' mental health. I wish i could be more practical bc I can't focus on myself. My parents are 60+ so I'm automatically supposed to help them even if they didn't help me when i was a child. Any advice is helpful, thanks. Life's just too much depressing!"
    },
    {
        "name": "t3_ieni5m",
        "created": 1598149147.0,
        "ups": 1,
        "downs": 0,
        "title": "My friend",
        "selftext": "My best friend has been staying depressed for a month now. He cannot talk to anyone at home about it but talks to me. He is 18 and Indian. In india people with mental health problems are judged harshly by the society. He liked a girl in his class but she did not show any interest when he asked for a date. He got depressed and we all took it as he will be okay after some time but it has been 8 months and he just keeps feeling lonely and depressed. Is he suffering from depression and if so then suggest some ways in which I can help him out of it without him having to visit a doctor bcoz he is open abt these things only to me and visiting a doctor will lead to his family knowing and they would react in a very negative way."
    },
    {
        "name": "t3_h7je4r",
        "created": 1591991982.0,
        "ups": 67,
        "downs": 0,
        "title": "I want to be happy again.",
        "selftext": "  Goal: Currently I am all timer sad and want to be happy. I am neither a good person nor a bad person. I am somewhere in the middle or maybe totally out of circle. I don't know. I feel like I am living three lives. One which I show to my Family, one to friends and ex-colleagues. I am jobless. And one my true self which I show to myself only. Of course any differences in personality from my true self I manage by pretending someone else in my other two lives. But as soon as I enter my room and after carefully slowly locking my door I throw away the mask I was wearing and then I can clearly see the differences in my voice, thoughts, body language and goals, if any. My body feels so relieved. Then I start getting back in my true zone where I forget the tasks and goals I had planned in my mind. And I start feeding myself the worthless shit on Internet. At that time, I am only looking for that temporary dopamine hits because nothing simpler was giving me any joy. I started losing myself in weed. I sometimes was stealing weed from my friends or roommates. After smoking for at least 3 years, a small joint was not that powerful anymore to bring down the curtains covering my real life problems. So, I jumped to eating. Now again, simpler food was not any joy. Junk is pretty much gonna hit the D-spot. Small meals mean less dopamine. Give me more and more. Don't worry, I'll puke the previous and eat again until I am so wasted by the effort of eating - throwing - eating- throwing and of course the taste of food. There are consequences too. Bloating, Gas, Always upset. But nothing can stop me from doing it again and again atleast from last 2 years nothing has stopped me. Then in search for more dopamine I look for porn. Again, simple means no joy. Fell into Hetero-BBC - Trans - Sissy. Now I don't imagine me having sex with girl instead I am that girl and big funk is fucking me. I started dreaming about dicks. Bought a vibrating dildo. But deep inside I still have that longing for intimate relationships with girl. I never had any. I am king of overthinking. I think of every consequence of my actions. Like where I keep dishes in kitchen. Opening and closing door. Even when I am walking down the road. Striking a lighter to light my joint. everything small you can imagine. This makes me mad and too conscious. I keep thinking of my childhood scenes where I lived with my parents and always wondering how time has passed. I was a kid back then and now I am an adult. I am so obsessed with age of people. How old is he or she? That actor? That sports person? and then I compare what I was doing when I was 16, 18, 23 etc. I am 26 right now.    I don't check my actions usually but when I check them, they are bad. I am using same pair of clothes for months. Using same toothbrush for years. I have rarely gave any gifts to any one. I am not so close with my parents. I am single child. I lived in rented place for 11 years before leaving for another city for college. My parents finally have their own house now. We live with parents in India till death.    I used to steal erasers, scales etc. from school. Even from my parents too. I have been caught sometimes. I now realized that maybe I was less satisfied with myself. I always felt less because all my relatives and friends had there own houses and car. My parents had one two-wheeler and my parents used to fight with each other which used to make me very sad. When I used to watch other parents living happily, I used to think why I don't have that, why my parents are always fighting? This less feeling I still have with me. I still feel less.    I am lazy for sure. Now I am sitting idle from last 1 year. No job, no friends, no personal connection with any human being. I never tell my secrets to anyone. Living in a rented room. Financially fucked, Relationships fucked.    I feel like a failure. I failed to become a good son, friend, brother, grandson or colleague.    I have become more secretive from last 2 years. I eat secretly, want to live secretly (deleting my pictures from social media).    I sometimes think If my parents die then I would have no one to answer and then I can live this miserable life for long. I don't think about my future at all. I have not reached the suicide point yet but I think this is how you reach there eventually. I can't imagine myself having a simple life with family and kids and work. I get very anxious imagining that will I be able to do that for these many years. I blame myself for all this. I did not take action when it was needed.   In the end, I just want to be happy. "
    },
    {
        "name": "t3_gdx3wu",
        "created": 1588711674.0,
        "ups": 2,
        "downs": 0,
        "title": "i gotyu",
        "selftext": "hi, i'm not an expert or something but i can be a pretty good friend i guess, i've seen stuf so i know what you are feeling right now, just  react or comment and we can talk :)"
    },
    {
        "name": "t3_i1rj7q",
        "created": 1596314214.0,
        "ups": 0,
        "downs": 0,
        "title": "Call for desperate help",
        "selftext": " I am a final year law student in a student loan of 800 dollars. This is my last call for help. I'll be probably be dead within 24 hours.I study law here in India. I am a good student with first class grades. The last 5 months have fucked me up financially and I am thinking about my suicide tonight. I have tried everything to pay back my loans but the lockdown has made it increasingly difficult for me to keep up.I have an ageing mother but I'll let her live alone .If anyone wants to help me I have a paypal me account by the name karan1396. The link for the following is here [https://paypal.me/karan1396?locale.x=en\\_GB](https://paypal.me/karan1396?locale.x=en_GB)If you can help me I promise to pay you back.Please. This is a desperate, desperate call for help.This was my final call for help."
    },
    {
        "name": "t3_e5konu",
        "created": 1575423999.0,
        "ups": 105,
        "downs": 0,
        "title": "How do I (14 M) talk to my (Typical Indian) dad about seeing a therapist?",
        "selftext": "Tl;dr at bottomHey guys. So, for context: I am a 14 y/o dude from India. I have a typical Indian dad, so that means conservative and not so open-minded, and we aren't close either. We haven't really talked about anything else other than studies and me being a failure in the past... 3 years or so. I have been depressed and suicidal for about 2 years now and have been cutting for about a year. I think I might have anxiety, but not really sure about that. So, with that in mind, here's what's I need help with:About a month ago, I tried talking to my dad about my cuts. I went to him and showed him my recent scars and he asked what they were. I told him they were cuts with a razor blade and he didn't ask me why but instead started screaming at me about me not studying and that I cut myself because of Youtube (As it had \"rotten my brain\"). He told me that he would have listened to me and helped if I had gotten good grades (Like, above 95%) but since I haven't gotten good grades (I have like a 75-80% overall), he doesn't give a fuck. I couldn't even tell him about what was bothering me. The first thing I said was insecurities, and he said I don't know the first thing about being insecure. Then I said anxiety and he went on and on about how I have no anxiety and it's all just due to Youtube. This went on and on and I just stopped speaking. Like half an hour in, he told me that I should just take a knife and slice my wrists so I can die once and for all and how it would be great and he wouldn't give a shit (This was pretty descriptive. He told me exactly where to cut and how much time it would take me to die. Also, to slice them in the bathroom sink so the bedroom doesn't get dirty)After like 1.5-2 weeks after this convo, he came into my room and told me that he got irritated because he couldn't understand what caused me to do it and he had cried later that night. Now I don't know if I should believe him or not. Anyways, this was just the backstory and here is what's going on now:I want to see a therapist to talk about my problems but there is no therapist where I live. The closest one is like 3 hours away. One of my closest friends lives in Chandigarh (It's a big city) and I asked him if he could find out about any therapists there. His mom used to be a dentist so she knew some people and one of her close friends is a reputable psychologist in Fortis hospital. He told me about her and I was like \"Well, so can I call her and talk to her about wtf is going on with me\" but turns out she needs to talk to my dad first because since I'm a minor I can't be diagnosed without parental consent. So this means that I will have to tell my dad that I need to see a therapist. He will ask me why and I will have to tell him about my depression, suicidal thoughts, etc.Keeping in mind how our last convo about my mental health went and our not-so-good relationship, can you guys give me some advice about how to talk to him?(PS: He gets irritated very easily and he rarely listens to me, and even if he does he will say I'm wrong since I am younger and that I never listen to him.)TL;DR: I am a 14 y/o Indian dude with a typical Indian dad. Our last convo about my mental health went not so wonderful and he told me to kill myself and how to do it, and that he doesn't give a fuck about it. I want to see a therapist for depression, suicidal thoughts, self-harming, etc. but the closest one is 3 hours away. I need parental consent for even basic diagnoses, and I have no idea how to approach my dad about this. We have a poor relationship and haven't talked about anything else than studies in the past 3 years or so. (Skim through the upper paragraphs because I might have left something out, I tend to do that)&amp;#x200B;Update: So while talking normally, I asked my dad what he would say if I asked him I wanted to see a therapist. He reminded me that I had already asked him and he said that since there are no child therapists in India, it wouldn't do me much good. Also, he said that my issue is a lack of focus and confusion (And it is this confusion that led me to cut myself) and that since I do not have a psychological problem like depression, I can just meditate and go for walks and I'll be okay. The funny thing is, I was amused when he said that I don't have depression lol (Hopefully it didn't show up on my face)Also, I talked to him about why he had talked the way he did when I told him about my cuts. He said that he had a long and tiring day and when I told him he couldn't process what happened and got irritated (Which is his kind of go-to emotion. Mine is laughing). I know this doesn't excuse what he said, but it's at least a reason I can get behind. He also told me to talk to him about whatever is bothering me instead of a therapist, which I won't be doing&amp;#x200B;UPDATE #2: Here is the link to the letter I will be giving him. If you would like, you can go through it and let me know if I should change anything (Names and stuff changed): [https://docs.google.com/document/d/1mPqoXtyLRbuWboCQuACZyAZntW835uzHB3QQUFjYHZ8/edit?usp=sharing](https://docs.google.com/document/d/1mPqoXtyLRbuWboCQuACZyAZntW835uzHB3QQUFjYHZ8/edit?usp=sharing)&amp;#x200B;UPDATE #3: So my dad got me an appointment with the therapist I mentioned for tomorrow at 11 AM. I'll be talking to her tomorrow and I guess I will give the final update when I come back home&amp;#x200B;FINAL UPDATE: So I went to see the therapist today. We talked for about an hour and in the end, she diagnosed me with mild depression, anxiety and BPD (Borderline Personality Disorder). I have been given meds for mood stabilization and am on some sort of anxiety program. I'll be going to her once every week for at least 3-4 sessions and then once every 15 days. I'm pretty sure this will be the final update, but feel free to PM me. A big thank you to everyone as all of you helped me a lot!"
    },
    {
        "name": "t3_b8mv3a",
        "created": 1554257914.0,
        "ups": 13,
        "downs": 0,
        "title": "Seeking Feedback on Depression Apps in India",
        "selftext": "&amp;#x200B;Hi all,I am a psychology research student from San Francisco State University, currently working on a research project focused on **depression apps available to Indian users.**I am looking for honest opinion on apps (CBT apps or apps providing psychiatric and psychotherapy services specifically) that you have found useful in dealing with depression. I would like to know which of your therapy needs they fulfill successfully and how they help you in managing depression. I am also interested to know the areas where they fall short or fail to cater to your needs.If any of you use such apps, I would love to know your thoughts. I am listing out some apps below that I came across. If you use any of them, let me know your thoughts. If you use a different app not listed here, then I would love to know about it too.Some depression apps available to Indian users, listed in no particular order:1. YourDost2. Wysa3. wayForward4. Betterhelp5. Joyable6. iCliniq7. FeelJoy8. NsmilesThank you for your helpPS: This post is only for research purpose and I am not trying to promote any apps.  "
    },
    {
        "name": "t3_gronxr",
        "created": 1590630932.0,
        "ups": 2,
        "downs": 0,
        "title": "I need HELP !",
        "selftext": "Hey there ! I think I need help. Little brief info about me -22 years old male from India who has always been one of the top in classes, went to the best of the educational institution's for higher studies and is now close to fulfill my dream career. I have always had close friends at every point in my life who will come for help a message away and I have best of parents who always care for me. I am also good in sports.But no, I am not happy Ask why ? Because I have thoughts which I cannot control. I cannot come over this feeling of not worthy or no self confidence. I fear.opening up to people. I cannot think of anyone to whom I would have shared everything I feel, clarified my thoughts. I have now lost interests in things and have started gaining too much weight. I can't help it and something with in me just keeps on dying day by day. What is the solution?I am looking for an anonymous person who has faced this before or has helped someone cater it. We will remain completely anonymous, talk at fixed times for fixed limits and share what we feel and guide. If anyone is interested or has any better idea, please comment and let me know"
    },
    {
        "name": "t3_fyyf82",
        "created": 1586616587.0,
        "ups": 3,
        "downs": 0,
        "title": "I don’t know what to do in life right now...",
        "selftext": "I (23M) came to United States roughly two years ago in July 2018. I was in a relationship with the love of my life, who i knew since 3rd grade. I had to change schools in 7th but couldn’t stop loving her. I tried to talk to girls as I grew older but something just wouldn’t let me get close to them. I found out that my crush since 3rd grade had a crush on me too, this is in my third year in college back in India. And everything fell into place. Life just started growing at a different pace as I started talking to her again and we feel in love after she got out of her 3 year relationship.She told me that she had left the guy who was trying to show efforts for a year or more or something I never understood. By the time, we actually get in relationship is actually around October 2017 after me asking her everyday what should i be doing because I was going to leave for US by August next year, and she would still keep talking to her ex while hanging out with me.6 months in, I had to leave for US for my studies and asked her when is she going to join me there! She said in 6 months time she will be done with exams and everything and we be together.I start my life here in US thinking my girls going to here soon, let me get a job and start saving for us so that she don’t need to worry much financially. 1 month later, she gets rusticated from her University in India and I’m here like nice you can prepare for IELTS and whatever exams you can while you are free. 🤡 she started preparing but kept giving me excuses, at the time i had a feeling she is lying to me about her preparations but I would dumbfounded by love. 2 months in, she no longer wants to be in US because it ain’t worthwhile for her. 🤡 She wants to be in Australia. I was like alright I will finish my studies and join you there. Couple weeks later, she texts me saying she is going to busy whole weekend again because she got invited to a house party where her ex was going. 🤡 After that week, i told her it is getting hard for me here and that I need her to decide and let me know when we can be together. I got a reply week or so later saying She is going to where her ex is headed to in Canada. 🤡. I got mad and she told me it was a joke but that had hurt me bad. I keep asking for a precise date, month or year when i can get to see her again! She says she dont know.I was like alright then can you give me sometime for myself so that i dont do stupid things while life is happening so hard. She thought i stopped loving her for some reason and kept asking what happened to me and out of annoyance i tell her i dont want to cheat! So give me time. Turns out she starting dating someone within a month of this conversation and said I gave up on us and she was traumatised. I have hurt myself bad, tried killing myself(but couldn’t cause im a pussy). Cried every night since and do not know what to do in life. I gave up everything in this new world thinking she was gonna be here and that i needed no one. I havent talked to anyone or tried to make friends here in these 2 years. Only friends are my 2 co-workers who think work is my life. I don’t know how to live again and it seems to overwhelming to try anything. Got major sleep, identity, trust all kinds of issues. I just want to be around people like i used to be. PS: sorry for this kilometre long post! But i need help. I really don’t understand myself anymore."
    },
    {
        "name": "t3_f07xxl",
        "created": 1581094798.0,
        "ups": 6,
        "downs": 0,
        "title": "I can't do anything about my situation",
        "selftext": "I'm 24 years old Dropped out of college and I really don't want to go backThe jobs available at the moment suck (India) I wanna dieI wake up miserable and go to sleep hoping I don't wake upAll I have is a highschool diploma If I can get a job with pay that's worth it. I think I'd be fineBut that will never happen here in india"
    },
    {
        "name": "t3_e6oeno",
        "created": 1575611906.0,
        "ups": 2,
        "downs": 0,
        "title": "Father daughter in same field- strains in personal and work relations",
        "selftext": "I want to rant and vent. My father owns a retail eyewear store in India. I am an optometrist from India living in states, although not a doctor of the field. He is an optician only. He is narrow minded to think minus/plus and presbyopia corrections only. Old school. Now I have some accommodative issues, and I need some bifocals in my glasses to help with eyestrain. He does not want to make it. thinks i am too young to be wearing readers. What do I say? They cost too much here in states.  That one thought gave me high anxiety. I know he likes to mess around with the numbers in my rx."
    },
    {
        "name": "t3_f6hedi",
        "created": 1582175217.0,
        "ups": 1,
        "downs": 0,
        "title": "I Can't Do This Anymore",
        "selftext": "Although I was an immigrant in the US, I spent my most life there, including all of my education. I wasn't the brightest of the bunch, but I still had a 3.5 GPA from 9th to 11th. I was proud of it, I had planned my life ahead, since I only had a few more months until college apps started. Then January end of 2019, it all just collapsed. As an immigrant, I was on an H4 visa, so when my dad lost his job and couldn't find one in the given time, we had to move back to India. In the middle of April, a few weeks shy of the beginning of my exams. So not only did my planning for my 12th and my colleges go down the drain, so did my entire 11th grade because I didn't give any exams.When we moved, I thought everything would be okay, it would go back to relative normalcy, but the education is so vastly different. Upon the suggestion of a few people, my dad got me admission to the significantly more expensive Cambridge International Education board. A lot of my syllabus lined up, and that got the better of me, and I slacked off, thinking I would be okay when I had to give my 11th exams. I guess it shouldn't have come as a surprise that I ended up failing.When I told my parents, they were naturally disappointed, and it caused a greater distance between them and me, that I don't have the guts nor the will to patch up. One day, after I came back from my classes, my mom told me straight that unless I could pass this coming time, she'll start looking for marriage proposals. I get her point, that she doesn't want me to just slouch off, but that *stung* so bad. I avoided her for a few days after that because I just couldn't stop feeling unwanted. I wanted to runaway that day itself, but I was too afraid to even step outside my room.The more days passed, the more I started to feel unwanted, like I am an intruder in my own house and it hurts so bad. Everyone thinks I'm just fucking around, that I don't care about my future but that couldn't be more from the truth. It's so unfair how all of a sudden life just turns on its head and if I don't cope up, then that's on me. I've been trying so hard, in the amidst of everything, my parents' drunken arguments, being the support system for my sister, my parents, my grandmother, everyone. For friends, for family, for everyone I've been trying to support them because I know it hasnt been easy on them either. I know my dad's reaching the same point as me, but I can't let him see how much everything is suffocating me because I know he'll blame himself for it. Every time I try to reach out to a friend to get something off my chest, I end up bursting in tears because I have never felt so alone, and I don't have anyone to guide me through this, and I get it. I genuinely get it that in life no one's ever going to take my hand and show me how to do things, but I've run out of patience, I've run out of the will to keep going. If it were up to me, I would have thrown in the bucket a few weeks ago. Every night I find myself trying to pull myself back up from the same thing--how everything was going so smoothly, and how I can't let go and move on from it. It seems like such a small thing when I type it out like this, but to me, watching the effects it has in my own family, how my parents seem to have lost all hope for me, want me out and gone from their lives, watching them actively act like I'm not there. I can't do it. I can't constantly keep trying when I know no matter what they'll be disappointed, when I know no matter what I do, i'll never been enough. i feel like my kindness is all i have, and even nowadays i dont have."
    },
    {
        "name": "t3_dxji7k",
        "created": 1574003364.0,
        "ups": 3,
        "downs": 0,
        "title": "I want to die.",
        "selftext": "I wanted to live, I want to have a happy family but I'm not so sure anymore. I don't see a future of me being happy or with anyone. I wanna tell the story of my life. I'm a male of age 22. I was born in Texas, US but am currently in India (we'll get to why in a while.) I don't have any relatives at all nor do I have any siblings. All I had for a family were my parents. My parents were very religious. Religious to the point of being toxic. They forced me to go to church everyday which I couldn't resist to because I was under the age of ten. One day when I was 10,I was so sick that I didn't wanna go to church. My mom still forced me to the church and as expected, I felt worse in church. After that incident, I was beaten by my dad on every small mistake I did. If I drop a pea on the table, I get beaten. If I say a word incorrectly, I get beaten. And not just slaps or shit, I got beaten by a wooden stick that my dad used to keep and his belt. They kinda neglected me except for providing me a home, food, clothes and school and Nothing else. I came out as an atheist at age 14. Since then, my parents completely ignored me. Only a home was provided for me. I had to do everything else myself. I had to cook for myself, had to wash my own clothes and I couldn't attend school for a year because my parents refused to let me attend school with them paying the fees. I ran away at age 15 sleeping at random places on the street. One day, I met a lady who ran a diner. I met her because I was sleeping on the sidewalk next to her home. She allowed me to stay at her diner if I worked a little. I agreed to become a janitor. She was a very kind lady who helped me get into a school by paying the fees of a complete stranger. I learned cooking at her diner. Thanks to that, I'm good at cooking food and that is my current job. A year later, after I had left for school, she dies in a gas explosion. The diner was destroyed and I had lost her. This had a great impact on my emotional state. She was more of a mother to me than my biological mother. I was back on the streets. I rented a home with the money I earned from working at her diner and my new part time job as a cook. I pursued my interest of media editing. I did edit a few pornos and three short films (2 of which were Indian.) A few years of uneventful normal life, I made my worst decision ever. At age 21, I decided to move in with my parents as they were moving to india. I don't remember why I decided it was a good idea. I thought that they had changed over time and would love me again. I was wrong.On 19th of March, 2019, I jumped out my window on the right floor. Unfortunately, I survived. I woke up from a month long coma. My parents didn't even show up in the 6 months I was in hospital. They didn't even call the ambulance, the security guard called the ambulance. I had no help in paying my medical bills. I had to sell my gaming PC and the car I had bought just a month ago to pay for my bills. I was alone for 6 months only being visited by the hospital staff. I did not want to be on suicide watch so I lied that It was an accident. I got out with just $100 in my hand. Before I was discharged from the hospital, my parents sold the house I was living in with them because it was under my dad's name. So I had no place to stay and only had $100. I rented a cheap house that I still stay in for $50 rent. I should add that I've never had female contact. I've been single all my life. I've got nothing to live for anymore. I just want to end this suffering. I am tired of this life. I've experienced more than I ever could."
    },
    {
        "name": "t3_c0vza0",
        "created": 1560623866.0,
        "ups": 3,
        "downs": 0,
        "title": "Anyone else feel like their problems are too meaningless to talk about?",
        "selftext": "Like I’m a 20 (21 in 3 days let’s see if anyone really remembers that though) year old college student from an upper middle class family, yet I’ve had depression since i was like 13 years old. Like I’m sitting here crying at 3AM because i feel like a fucking failure since i probably failed my biochem final and because my family (mainly my mom &amp; older bro)’s favorite pastime is to tell me how much of a fat, ugly piece of shit I am, yet there are starving kids in India that have REAL problems, but are yet way happier than me. Like i honestly feel shitty already, but knowing i feel shitty despite being so “privileged” makes me feel even fucking shittier. Like wtf is wrong with me? But yeah ty for reading if you’re still reading and sorry for wasting your time with my meaningless rant about my meaningless problems :/"
    },
    {
        "name": "t3_busdru",
        "created": 1559247066.0,
        "ups": 4,
        "downs": 0,
        "title": "Pl help.I am very emotionally fragile. I hate who I am right now.",
        "selftext": "umm..this  is my first post on reddit and I haven't been a stable emotional state  for quite sometime now. so...coming to the details,I\\[18/F\\]  am having a lot of insecurities, self esteem and confidence issues and I  guess all this started during high school, when I was at the bottom of  the class and i began to feel inferior to my peers and no matter how  hard I tried I still couldn't catch up(I was a straight A student before  high school). and then came college. well, college isn't that bad. I  have always been a very emotional person and I experience a lot of mood  swings. So lately i have been quite down and stressed as I am very  anxious about my career(still clueless). and as a result I haven't been  able to control my emotions. It feels like I'm walking on thin ice and  anyone,literally anyone, can make a small remark and *\\*shatter\\**  and I'm back to drowning in a cold sea of emotions.I spend a lot of  time crying. I just have no control over it. I want to stop crying, i  tell my self to stop crying and i can't and its so goddamn frustrating.  It makes me feel weak(I am already physically weak and underweight). I  know expressing emotions and letting it out is healthy, but what if you  are feeling so emotionally saturated with all the self hate and worries  that you'd cry to anything. I at least wish i had enough control so i  wouldn't cry in front of someone who is not close. but nope. I have zero  control.let me quote this one incident.  a few days ago, I snapped at my elder brother when he was pressuring me  to do learn things for my career. He kept forcing his point and it made  me feel small and incompetent and like he doesn't trust my decisions on  what I wanted to learn so I began to get all defensive and I very  rudely told him off and avoided him ever since. I spent a lot of time  crying and affected by it. And just when I had slowly recovered from it,  a family member on hearing what exactly happened made a remark that \"I  think he's better than you, for the family\" which means that I am too  impulsive and rude and emotional and is bound to create problems in a  family.I still haven't recovered from that. I didn't want to cry,  because my uncle and I don't exactly see eye to eye and I wanted to  disregard this remark and get going with my day. BUT i began to tear up  the next second. I cried for hours.I  hated myself. Do i wish to be rude? no. Am I this emotional by choice?  no. Do feel crying is the solution to all my problems? no. And my family  thinks otherwise for all the above questionsI  want to seek professional help. Having been wanting to for three years  now. But here's the thing. I am from India. I am still in college. I  live with my family and they provide for me. They will never accept  depression as real and a therapist is a big **NO**. I can never open up to them about this and I can't secretly visit one, nor can I afford it myself.I  am writing here because I want to change this. I don't want to be  controlled by my emotions all the time, I don't want to use rudeness as  defence. I am so insecure and I am desperately looking for ways to  improve.**tl;dr**  I am a depressed, insecure, self hating person who cries way too much  and is controlled by her emotions and is desperately looking for ways to  improve"
    },
    {
        "name": "t3_8g0n2j",
        "created": 1525133727.0,
        "ups": 13,
        "downs": 0,
        "title": "I feel nothing, do nothing, not at all hungry , i prefer being isolated. Is this depression?",
        "selftext": ""
    },
    {
        "name": "t3_arj29l",
        "created": 1550424453.0,
        "ups": 17,
        "downs": 0,
        "title": "Hardly any friends or girlfriend at 20 years of age, is this okay?",
        "selftext": "Okay, long story but bare with me.I’m a 20 year old male living in New Zealand. I’ve always been a massive introvert and have some social problemsI was brought up in a pretty stable family with my parents and 2 older sisters, never in elementary school struggled to make friends, at 1 point, I had 9 friends come to my 10th birthday party. I was heavily liked going into middle school and continued with a big friend group.Going into high school however, my first real type of sadness occurred.... I had only a couple of friends following me there, they actually consulted the principal to try and get into my form class which did work. However, as the 1st day of high school rolled around, they didn’t even attempt to talk to me, they made new friends and acted like I didn’t exist. I was alone and felt like a loner for the 1st two weeks. As the 3rd week started however, someone who was my friend in middle school found me as he just came back from India so we straight away became best friends however we were in none of the same classes, let’s call him Jake. My form teacher approached me and asked me if I had any friends, which I replied “yeah just not in my class\" then, this one guy, let’s just call him Fred asked me to hang at his table which I of course said yes though I was quite shy so I wouldn’t talk much to him or his friends much for a while. I’d still spend most lunches with Jake and his new friends, though jakes friends would bully me so much. Some physical that Jake had enough and decided to find a quiet space for us to just hang out undisturbed. A year rolls on and Fred’s friend started hanging with us as his best friend got expelled which was followed by Fred and his other friends started hanging with us so we created quite a big friend groupI could finally say I was happy again however I could still not talk to girls when everyone else started getting relationships apart from me, Jake and Fred. Roll on the 3rd year of highschool  and again my best friend Jake moved to a different school which was hard to take. I managed to finish the rest of my school with pretty much same friends minus Jake.  At the beginning of my last year of high school, I met new people online on Skype where we would play games and talk about life, most of us were sad and introverts so it was a breath of fresh air. I’m still talking to them to this very day. They are my main friends right now. Now is when depression starts, I managed to get in to university, first plan was to start making new friends that weren’t online as I gradually lost contact for the meanwhile of all my high school friends. I for a bout a week had some sort of a friend till he stopped talking to me for ever in uni. I could not handle life at this point, I’d just go to uni Monday to Friday then on the weekends lay in bed as I still lived at my parents house, one time I said I needed to get out so I walked up to get sushi, listening to slow depressing music(wasn’t the best idea) and literally just cried the whole time I was walking.I was poor, no friends, no gf, just passing classes with c though was failing 1 class and haven’t gotten my first job yet. Finally I needed to get a move on with my life so I got my first job as a tutor in a tutoring company, which I thought I was doing quite well for a semester till the 2nd semester when I had no time during the weeks to commit so I had to quit.Then Fred couldn’t stay in his house anymore(can’t say reasons) he needed a place to stay, so he started living with me and my parents which I was so happy bout, I have a friend. He would be living here for one year and a half till end of January this year. He was going out, trying to take me out as well, he would show me videos in the morning of him with girls, flirting with them, taking them to her apartment where they would get down to “business” I always wanted to be involved with that and he would try get me out, but I’m too shy and I get too nervous around girls. Just a couple of months ago he took me clubbing for the first time with  his mates to try get me a girl but the whole night I was just very awkward and shy, I acted like I’d go again but I hated it, it was so uncomfortable for me. I appreciate Fred trying to help me out but every time he plans to take me out somewhere with his friends, I get nervous about it a week better and all I can excited about is when it’s over but I never want that day to come. It’s fine if it’s just me and him as I know him and am comfortable around him but awkward around his friends, most of the time I just don’t talk at all.Idk what to do anymore, I’m worried about my futureI try to talk to my online friends about this but they just ignore me because apparently I’m privileged because I’m white with good shelter.After Fred left my home to live somewhere else, I’ve been more sad than ever even though we still keep in touch. I feel I’d be much happier if I just lived with my online friends though they live in America so it’s very expensive for me travel half way around the worldNo one really hates me, it’s just I’m too awkward to get anywhere in life, I’m nervous where ever I go now around big crowdsThank you guys for reading this as it was very long"
    },
    {
        "name": "t3_b24cpl",
        "created": 1552851660.0,
        "ups": 2,
        "downs": 0,
        "title": "I'm scared of what is called \"life\"",
        "selftext": "Hello friends!!I'm a guy from New Delhi, India and have been living a little far from home since last 5 years doing MBBS which is about to complete in next 15 days and I'll be finally back home. But I'm not so happy about it and my future either.I'll try to explain everything in this hell of a longg post here and would hope that someone would read it, understand me and maybe help out!  So I've always been a very short tempered person. In my childhood I used to break my glasses whenever I got angry. It's not that my childhood was very dramatic or sad or something like that but I did have some bad experiences. I was a fat kid with huge glasses who was repeatedly bullied by other kids. For almost ten years of my school life I just had one friend who was more like a boss to me but he's the only one I had, and we did share pretty great experiences. Then I was weak at everything except studies (including sports and social interactions).I hv a conservative family. I've seen a lot of drama over very petty issues in my house, mostly religious drama. I've seen my parents fighting too much. My mother always used to suffer....... sometimes even physically! Not that I had horrible parents or anything, they are great parents who just did some humanly mistakes in the past. Apart from all of this my childhood remained pretty good!  I grew up with some new and better friends (well atleast some of them)......my parents also became much more understanding (slowly, like really slowly but they did) and I had kind of a good life until the decision of career was thrust upon me. I never knew what I wanted to be. I always wanted to create a good world for everyone but then I had to choose something realistic and I chose what my father wanted for me.......medical science! I did pretty great with that too during high school and my coaching time but I started sensing something wrong with me, low moods and inability to fully concentrate on anything, my academic performance went a little bit down but somehow I overcame all of it and passed my entrance test with flying colours.Then it was time for medical college. I was sent away from home.....my comfort zone!  It was a whole new world for me. New people different environment! I was not okay with it and all I used to do was miss my home for most of the time. Then above all of it was the burden of ragging in my college, physical ragging. Not that I had to suffer much but there was always so much mental pressure. One day, completely devastated, I asked my parents that I wanted to come back but my father asked me to try it for a few more weeks and so did I!!I got adjusted over the weeks and made some friends. But what I lost during the process was my only strength, studies. I wasn't good at them anymore. I didn't want to study for so many made up reasons. My company wasn't the best so I ended up doing silly things like bunking classes for the start and then becoming a complete alcoholic! My whole life was upside down. I started getting more and more breakdowns than I used to before and now I didn't stop at breaking glasses, I started randomly shouting, crying and breaking my cell phone most of the times. My parents didn't know about any of this.  Over the time I made different friends, almost stopped having alcohol and tried to get back to studies at which I wasn't very successful. I wasn't the same person anymore.Now I had a crush in my class with whom I used to have these hopeless romantic conversations which she never liked but she never pushed me away either, so one day i told her that I really liked her (she was the first crush of my life to whom I admitted it) and she obviously rejected and then she didn't talk to me for days.But that gave me another good friend. We both had a mutual friend to whom I wasn't very close to before (even though she and I belonged to the same city) but during that \"fight\" she used to be the mediator if needed.  Days passed, everything became alright, no one was mad at anyone for anything and I had made a really cool new friend. But still during all this time I used to feel very sad and lonely. My breakdowns increased even more and it was the first time I realised that now I need no reason at all to feel bad. I just did feel bad!! But something changed again. This girl that was my new cool friend started showing interest in me. At first I thought I was imagining things because no one ever had been interested in me before but then she admitted it herself!! We became close, very close. But only for 65 days. She felt that it wasn't gonna work......we had arguments for months but it all just had to end!  I never had felt so broken in my life. Sadness, lonliness, emptiness, hopelessness, self-hatred, suicidal thoughts and all those breakdowns increased so much that I finally seeked medical attention. But then I was at a government medical college where there's such a heavy load of patients that one patient is never carefully looked upon and They diagnosed me with impulse control disorder by listening to 30 seconds of my history!I wasn't convinced so I didn't start meds. My condition just worsened over time so I tried once more. This time they listened to me for atleast 2-3 minutes and started me on a symptomatic therapy. I started taking meds for some time but slowly I started believing that it's all just in my head and I stopped again!  Months later, I was in my final year which was coming to an end. I was writing my orthopaedics exam, a preparatory one, which was going well enough but then all of my friends started leaving the exam hall having completed their exam and I still don't know what came to me that I threw away my answer sheet and started shouting and crying unnecessarily in front of 100 students and some teachers. That was the day I actually started my therapy. My friend took me to a psychiatrist, I was started on a symptomatic treatment and was assigned to a proper psychologist also. I had weeks of evaluation. I got through all of my evaluations and suffered so much of side effects of my medical treatment during my exams which I somehow cleared nicely.My internship started at my hospital and used to regularly visit both my psychiatrist and psychologist from time to time. Everything was going well and I was getting better. But after sometime I learned that my psychiatrist and my psychologist had a difference of opinion over my diagnosis. My psychiatrist believed I had bipolar disorder and my psychologist believed that I had severe depression. Even though a psychiatrist is way more educated in this matter but during all of my course I had spoken to him for like 45 minutes or so all of my sessions combined and each session with my psychologist used to be over half an hour atleast meaning the psychologist knew my history much better!So I discussed this with my psychiatrist but he insisted me on continuing the same treatment. Since I was also feeling better and he was much more educated and experienced than me so I listened to him.  With time my psychology sessions started coming to an end and my performance wasn't very good. Though I was improving but I rarely followed the tasks they gave me. I still didn't feel like doing anything and my post-grad preparations were really bad. Everything in my life was kind of stagnant. My psychologist declared that I won't get anymore better if I didn't do other exercises given to me and I knew that was right. But instead of listening, one day I just decided that I'm okay enough to stop my treatment, the main reason being that soon I was going to head back to my home and didn't want my parents to know about any of this. So I just stopped.Everything was okay for a while but then my condition started going down again. I decided that this time I will try to control it myself without medications and all but I failed.I had another breakdown, first one after that exam.  I'm completely devastated now. I don't know who I am, what should I do, how should I do it and whether if it's worth trying anymore. I am going back home in next 15 days and I am not so happy about it. My friends are here to help me but I can't even talk to them properly. I need to talk so many times but I'm unable to ask for it. I feel sad and angry all the time. I know my friends can't help me 24X7 but i get pissed off whenever they go out without me or keep themselves indulged in their own work rather than sitting with me and talking to me. I know that's crazy. Now I'm thinking of finally confronting my parents about my situation but I'm scared. Scared not only because it's so difficult to express and make them understand (hell I can't do it with my friends half of the time) but also because I don't know how would it make them feel.I feel like quitting. Everyday and every second of the day. But I'm all my parents have.  I'm scared of what is called \"life\"."
    },
    {
        "name": "t3_bt4r4h",
        "created": 1558880674.0,
        "ups": 2,
        "downs": 0,
        "title": "Older sister depressed",
        "selftext": "My sister(26) lives in Niagara and I(23) live in India with my family. She don't talk to parents anymore. I'm the only person who she's in contact with. She's having stone in her bladder. She's alone there and most of the times depressed. She is going through stone treatment and there's no one to take care of her, no friend , no family.I'll be dead soon , that's what she said when she called me few days back. She's suicidal as well. I don't what to do now. I can't visit canada. She broke contact with every family member."
    },
    {
        "name": "t3_bp2ahq",
        "created": 1557977228.0,
        "ups": 1,
        "downs": 0,
        "title": "Feel like I'm falling back into my depression",
        "selftext": "So I spent a good portion of the past 3 years in therapy and trying to better myself.  I felt like I hit my rock bottom after a close friend and mentor took his own life the same day I found out my gf was cheating on me.  About 6 months ago my therapist told me she thinks I'm done with therapy that I've grown so much and made such huge strides in my life(spent a month in india with my sister in laws family and am now in school for 3d modelling and animation). However just 3 weeks ago my new gf cheated on me, and now I feel like rock bottom has caved in underneath me and inspite of a lot of support of my friends the loneliness this has caused feels so much more extreme than before.  I'd cut myself off from woman ever since my friend died, and finally opened up to her only to be betrayed again almost immediately.  Honestly I dont know what advice I want, or really anything anymore, my will to succeed feels drained."
    },
    {
        "name": "t3_c27c3x",
        "created": 1560918192.0,
        "ups": 3,
        "downs": 0,
        "title": "I am depressed and lost. Anyway to come back?",
        "selftext": "I am from India. I graduated in engineering in year 2014 and used to be a good student. I have bright academic records sufficient to get a decent job. Yet I am here in 2019 and have not been able to get any job because no one will take me despite trying my a** off everywhere. I even cleared some reputed competition exams for a govt job but at the end not in the final merit list.My 5.5 years are wasted and here I lie jobless and depressed, whereas even ppl who were worthless got themselves somewhere. I feel lost and worthless and have a low self-esteem. I wonder 'Will I rise back?' Advise what to do now?"
    },
    {
        "name": "t3_b6t94x",
        "created": 1553864905.0,
        "ups": 6,
        "downs": 0,
        "title": "survey for antidepressants",
        "selftext": "Hi, I am studying in National Institute of Design, India and I am currently undertaking the course of Design project, where the goal is to use graphic design interventions to provide information and create awareness about antidepressants.[https://goo.gl/forms/5PbQscwqHD3embzT2](https://goo.gl/forms/5PbQscwqHD3embzT2)The survey linked below is to collect data from patients taking these drugs, to understand people's notions regarding the drugs and analyse the extent of misconception spread in the public, with the goal to provide crucial information and create awareness among them so that they understand its workings, misconceptions and side effects, use it responsibly and do not discontinue the treatment.[https://goo.gl/forms/5PbQscwqHD3embzT2](https://goo.gl/forms/5PbQscwqHD3embzT2)Please take some time out to fill the form and do leave suggestions on how to improve it. It is mostly for people who have taken or are taking these drugs. It would be really helpful if this survey reaches to a wider audience so I would be really grateful if it is referred to other people who might be able to fill this survey. It is an anonymous survey and I sincerely ensure that these data will only be used for research purpose.Thank you in advance !"
    },
    {
        "name": "t3_bvnl5j",
        "created": 1559440744.0,
        "ups": 2,
        "downs": 0,
        "title": "SAD but for the summer?",
        "selftext": "Is there anyone here for whom SAD kicks in the summer as opposed to winter? I live in India and it gets unbearable hot in the summers, and everything about summer exacerbates my existing major depressive disorder. In the winter I’m considerably better. Our idea of SAD tends to be Eurocentric, where the winters are far more gloomy, so I’m wondering if there’s anyone here for whom the opposite is true. If this is not the right subreddit, please direct me to the correct one. Thank you!"
    },
    {
        "name": "t3_8ui1e6",
        "created": 1530210522.0,
        "ups": 2,
        "downs": 0,
        "title": "Please Help!! I really need help.",
        "selftext": "Guys please help!!!! I'm 15, a Sophomore High in India. The thing is that I'm smart in a pretty awkward way. I study the curriculum of senior year as well as college but don't really spend a lot of time studying the courses of my own grade which kinda makes me look dumb cause I don't really get good grades. Lately I started studying Feynman's Physics and recommended it to others. Some of the jerks( one of them is actually the smartest kid at school though he isn't able to solve the senior problems I'm able to so technically he thinks I'm a stupid guy) make fun of me and tease me a lot. This really hurts me and moves me. I seriously don't know how to stop it. It feels as if I'm drowning, I really need help, some advice or atleast some words to make me feel better because I just want to kill myself and put an end to all this nonsense."
    },
    {
        "name": "t3_amcwuk",
        "created": 1549131853.0,
        "ups": 1,
        "downs": 0,
        "title": "I get teary at random times all day!",
        "selftext": "Hey, I feel pathetic for just searching up this subreddit and for typing it here. I just want to get some things off my chest for 3 years. Yes! I kept every bit of emotion in myself, locked and seldom visiting for 3 years. I won't say much, just that I am always depressed (24x7), can't sleep or eat properly. I fake smiles and don't even bathe regularly. I keep recalling of my failures and how I have let people down around me. I try to suppress things with loud music and seldom(once/twice a month) intoxications (drinking and marijuana). I am 27 years old and I feel the need to earn more money because of all the expectations of my parents, my girlfriend and my own. But, I don't get the motivation. My girlfriend knows about my state but doesn't understand how severe it is (I don't tell her much though because she doesn't like me talking depressing things). And I feel I need to work on it myself and not bring her into this. I get teary all the time for no reason. Even when I am not thinking of anything sad. I am from India and here 'depression' is a non-existential term. I have so much to say but I don't want it to be a TL;TR. Anyways, feel a little better now I guess."
    },
    {
        "name": "t3_aix46i",
        "created": 1548255872.0,
        "ups": 1,
        "downs": 0,
        "title": "My depression is connected with my mom",
        "selftext": "I am a 21 year girl who is studying french. When i finished my schooling, my mom wanted me(not me) to study medicine so i tried for it (she nevers lets me study for a long time at home)  and i couldn't get into med school. She scolded me and shamed me for this whenever she can. A year later my cousin sister got into medicine (understand that their family is rich and she got the best education from childhood, as in my family,my bro got good education but for me, she joined me in a stupid school, where\"english teacher don't know english well\" kind of school, my mom never let me study and always does something to spoil my mood when i study) since she got into medical school my mom used to compare me with her(i don't talk back since my mom cries when i talk back) it was humiliating whenever she compares me, i am used to crying alone every night. I started to develop mental health issues like anxiety and fear for future. Then i somehow got myself feel better about myself. Recently i went to a marraige, there everyone respects her because she studies medicine and a guy even used me to get close to her. In this situation, what bothered and disturbed me is not their behaviour but my mother's words from past, they are ingrained in my mind like words on stone. They are haunting me now and i feel like a waste of space, the only reason that i am alive is for my dad but i can't tell him these things cause he will get sad. When in problem, people run to their mother but when i get any problems i want to hide it from my mom in all ways cause i am scared that she will mock me or shame me instead of showing me ways to overcome my problems How can i feel better?  Help me please.... ( I am living in south india) [I can't leave my home until i finish my studies(still 1 and half year remaining)]"
    },
    {
        "name": "t3_7lsiua",
        "created": 1514108963.0,
        "ups": 1,
        "downs": 0,
        "title": "I’m in a loop",
        "selftext": "It seems irrational to post this in depression as I’m so much more than that. But I think it’s more socially acceptable than saying “I’m warped”. I’m a 28y old married, female doctor of Indian heritage in an English community. I don’t think I should be alive. I was born in an English mill town to two Indian parents. They arrived in England in the seventies. My father is a Muslim doctor who grew up with an overbearing hell of a mother and 5 overachieving sibling. His dad died when he was 12 and his elder brother when he was 18. He was the man of the family and the sole provider for his brothers children and fathers family. He wanted to be a poet. He grew up in a state that was well known for its literature and cinema and he longed to be a part of it but he took to medicine to put food on the table. My mother grew up in the same state. She was the daughter of a Muslim railway engineer and one of seven. Her dad was loving and kind but her mother was jealous, paranoid and violent. When he worked away, she was mean and unloving. Her two elder sisters were close to each other and cold to her. She thought herself neither bright nor special. Her mother’s violent rhetoric was such that when my dad turned up, aged 30, desperate to find anyone to marry and return to work in England, she (at the age of 18) jumped at the chance and got away from her family. My mum had read books about England- wuthering heights and the like. She dreamt of a romantic moors and ended up in the arse end of the industrial revolution. My mother and father didn’t get on. He was more jealous and violent than her mother. She was uneducated and beautiful and he couldn’t relate to her at all. They quickly had my eldest sister, my brother and another elder sister in a terrace in the Indian Muslim ghetto they settled in. Life wasn’t nice for my elder siblings. My dad worked hard to start two medical practices and my mother was depressed with her lot. They made money however and my father grew in reputation and esteem in the community. He was known to be a religious man. Eight years later I was born and they moved to the affluent, white part of town. Then my two little sisters and a brother came. We had a different upbringing. I remember my mum being entirely detached. She screamed at us to go to mosque and school and ignored all else. Her and my father hated each other bitterly. There was no hugs, no confessions of love and no tenderness. We competed against each other for our parents attention and none were victors. I didn’t experience love from siblings either. Our clothes were dirty and we had to have tantrums for attention. I feel for my mother now but as a child I hated her bitterly. I didn’t know why I was so unlucky to be born to them. When my eldest sister becamd a teenager, she was sent to the posh private school because it was all girls and they didn’t want her to meet boys. She was shy there. My parents imposed a strict dress and behaviour code on her. Then, at 16, she didn’t get very good GCSEs so they packed her a suitcase and sent her to India. My brother went to a posh all boys school. Was bullied for being thin and meek. Didn’t get the grade and was packed off to India. My other elder sister loved being at private school. Then my parents heard of a Muslim all girls boarding school in Bradford and tore her away from her home and sent her to boarding school. All three of them are broken now. Then it’s me. I don’t know if I’ve blocked out good memories. All I have is a lingering feeling of abandonment. Is it possible to be abandoned if they weren’t really there in the first place? One elder sister regularly beat me when she was home from boarding school. My parents hated me. I had one solace. School. The problem with school was that I didn’t fit in in an English society. My parents knew manners and etiquette but didn’t teach us that. I had no self worth at all. Instead I copied everyone else and quickly made lots of friends. I learnt the best way to get attention was to get good grades so worked hard to be the best. It wasn’t a nice experience. No one wants to play kiss chase when they might have to kiss a brown girl, I was one told. During primary school, my older siblings were sent away due to their failures and a younger sister developed a severe social anxiety that caused her to become a truant. I, on the other hand, gained an incredible amount of weight. I became more aware of what repulsive people my parents were, how they couldn’t protect me and how alone I was in this world, in the midst of an enormous family and two discreet communities. I began then with suicide attempts. It first started with taking all my sisters period pain medication. I vomited for 3 days straight. My parents never noticed. My sister did, when her pills were gone, and I received  a beating. From then my teenage years were plagued with “kill yourself fatty”. Well Asma, I tried. At 12 I hadn’t realised the difference between veins and arteries and I still have the keloids to prove it. My parents were furious. What would people think. My weight increased but so did my resilience. I knew my only way out of this family was to get good grades and that university and education was the only means to reach freedom. I knew the only way to gain happiness was to reject the Indian pseudo Muslim bullsjit I grew up with and embrace the only happy culture I knew. The English culture. One where children were bought gifts and had parties, had hugs. I chased that English culture through my teenage years, from getting fingered in bushes to alcohol and drugs. I wanted acceptance. I wanted normal. More than anything I wanted love. I had boyfriends. Either I realised they were terrible or my parents chased them away. The violence and control culture at home grew exponentially. Then I got into medical school. It was what I’d always wanted. To escape from their misery. And I did. There was no way my father was going to deny me an English medical school. So I went. I scraped through. I had issues with my weight and drinking too much. I cried most nights due to the memories of what I’d left behind. I never felt lucky to leave because the curse of my family home still haunted me. I met my husband at university. A doctor. Handsome, fair, clever, funny, tall and understanding. And 7 years on we have created a life for ourselves. And yet, I’m still 13, shaking in my room with sadness and fear and hopelessness. Wanting to die. You can’t help. I’m a doctor. I know how to treat depression. Years or medication, therapy, yoga, mindfulness, exercise and everything else merely pushes the truth to the side. The truth is, I was ruined a long time ago and I’ll be ruined til my heart beats it’s last. "
    },
    {
        "name": "t3_8ujnjn",
        "created": 1530223070.0,
        "ups": 1,
        "downs": 0,
        "title": "I'M SO IN NEED OF HELP RIGHT NOW!",
        "selftext": "Just a while back I got my result of a test and my rank is 47th of 49. The reason is: I filled the OMR wrong. I explained it to my Math and Chemistry teacher whose subject's SECTION in the OMR I messed up. My MATH teacher told me not to worry whereas I haven't got any reply from the Chemistry teacher yet. What I'm worried about is \"getting teased and bullied\" by other mean kids who will mock me for getting such a humiliating rank. I am really worried about this. Plus the pressure of completing my summer assignments is increasing every second as my school is reopening on 4th JULY.(I'm in India by the way). This shit is really getting me depressed. );"
    },
    {
        "name": "t3_5thi8y",
        "created": 1486875781.0,
        "ups": 3,
        "downs": 0,
        "title": "I'm 18, Completely lost in life right now, I don't know what to do.",
        "selftext": "I\"m a 18 year old boy. Completely lost in life. I don't know what to do. I think all this is because of my parents moving with me so much. I lived in one place everything was going well. My parents all of a sudden decided they wanted to move to a new city for no reason really, I was 13 at the time, had to leave all my friends. I hated the new school I went to, hated the people, had no real friends for almost 2 years. I also became extremely introverted. Then by surprise my parents decided to move again when I was around 15, this time to the country i'm originally from, India. I didn't want to, but they forced me to. The plan was to live there permanently. I hated India, I never adjusted, I could barely speak Hindi, the language which everyone spoke there, huge cultural shock. Again, Lived there till I was 17, no friends, sat alone in my room most of the time for 2 years. My parents said I was stupid because I didn't have any friends, my younger brother who is 6 years younger then me started making fun of me. I was super depressed. Then my parents decided to move back to the US because thinks weren't working out in India. Back to the place where i first moved from when i was 13. Now Here I am going to a community college because my grades in India sucked. I have no friends, no life, no goals. The people I use to know from here probably don't remember me any more. I haven't spoke to them in 6 years. There all living a great life, having fun with friends, dating, living life, from what I can see on facebook. And here I am completely lost. I'm afraid of what people will think of me. I haven't had a single real friend for almost 4 years. I just don't know what to do. I'm starting to become suicidal. I have lost all hope. I don't even know whats the point of going to college and getting a degree anymore. I'll probably be alone, a virgin, awkward my entire life. If someone could help me out that would be great. :)"
    },
    {
        "name": "t3_6onzs5",
        "created": 1500673565.0,
        "ups": 2,
        "downs": 0,
        "title": "My piece on depression Part 1",
        "selftext": "Pardon my English grammar.Part 1 of my small take on depression.Robin Williams committed suicide in December 2015, On 20th July 2017 Chester Benington from Linkin Park committed suicide by hanging himself at his home. Several famous people committed suicide while no one seemed to guess their mental status. Highlighting the need for mental health awareness and educating people about depression.Chester’s suicide hit me hard. Linkin Park’s song were one of my escapes during my dark days. Having been through chronic and crippling depression myself, I can relate to these people very deeply.In India, People take depression very lightly. Many people (Especially older/ Middle aged parents) think that it’s just a phase that will get over or worse. They think that it is a façade or excuse to be lazy and not do anything. Trust me, it is anything but that.Depression can manifest itself in many ways and due to many reasons. Sometimes the reason is so obscure and may seem trivial but it can cause deep effect on the depressed person. Sometimes depression can be effect of combination of factors. People often brush off some things to be too silly to be depressed about but combination of those reasons can result in serious complications. Sometimes even depressed person cannot pinpoint the cause of their misery. But please remember that small or big depression is a serious matter. Small depression can over time turn into a very dark scenario. It’s a vicious cycle. People with depression tend to turn away from social encounters, can lose productivity, resulting in loneliness or work piling up, getting fired leading to more depression which in turn leads to more isolation and lethargy/loss of motivation and morale.Here are few tips for identifying Depression1. Isolation: Person tends to evade social situations. Person will make excuses to get out of such scenarios. 2. Loss of appetite, Person seemingly loses interest in even the food of their liking.3. In Some cases Overeating can also be attributed to depression. (Especially in early stages)4. Lethargy: Depressed people tend to stay in bed a lot. They lack the motivation to do anything. Do not brush it off as laziness. 5. Irregular sleep cycle and/or Insomnia.6. Mood swings. Especially anger issues.7. Loss of energy. Physical weakness.8. Difficulty remembering things.9. Faking smile: Learn how to identify a fake smile. Many times person fighting depression will wear a façade of fake smile. They sometimes seem happy while being miserable.10. Social Media: Keep eye on persons posts on social media like facebook or statuses on whatsapp . Those may give strong clues.11. General Negativity in behaviour.Don’ts of handling depressed person. : What not to do.1. Do not make them feel bad about themselves. Do not tell them to look at some poor person who has it worse than them. That will only make them feel bad about themselves. Pushing them farther down the abyss.2. Do not brush their depression off as laziness. It is not. They lack the motivation and energy. DO NOT TREAT IT AS AN EXCUSE.3. Do Not tell them to Just be happy. Its moronic. Don’t tell them how to think or how to feel. Its not their choice.4. DO Not tell them to shake it off. Its not something they can do.5. Do Not tell them that they have everything you did not have when you were their age. Times change, Needs change. Emotional needs change.6. Do not tell them that their concerns are irrational or trivial.7. NEVER MAKE FUN OF THEIR DEPRESSION.8. Don’t pressure them to come out and socialize. Dos of handeling a person with depression. : What to do.1. Accept that the person is depressed and needs help.2. Do reach out to the person even if they has isolated themselves. And do not want help.3. Try to cheer them on. Be positive with them.4. Encourage them to try new things. 5. Take a Psychiatrists advice.6. Try to talk about the depression and find the underlying cause.7. Listen to them. Offer them your company.8. Take them out on on a drive or a trip. Non social event.9. Assure them that you will be there for them.10. Offer them to get professional help."
    },
    {
        "name": "t3_6b759y",
        "created": 1494835403.0,
        "ups": 1,
        "downs": 0,
        "title": "I don't know where I'm going in my life",
        "selftext": "19 Pakistani College student. I come from a  elite Pakistani family much like any other asian family, most asian families push their kids to their limits making them study to the point of suicide from stress. India has the highest college suicide rates. I barely made it through high school, I was once a bright kid who was definitely going to be a someone but with all the financial troubles and moving it all seemed to change. in 5th grade i moved to illinois and back, lived there for 6 monthsin 6th grade moved to cali for 9 months and moved backin 11th grade, the year that I could call the brightest moment of my life, the moment where I was on track to become the someone from my childhood we moved to MA. i ended up giving up on school and life and lost what is considered happiness, my face grew a solid smile and my mouth only said, \"sure/yes/okay.\" I never had much freedom as a kid and didn't have any until recently in college. As part of a elite family I have to take either STEM or Medical, I choose STEM because I had a small interest in it, I took my first class of calc and failed, I'm not sure if I studied enough or where I went wrong, the reason I'm afraid and posting to this is because I'm from a  poor family who has sick mother and a father who works so much just to make ends meet, we are a family of 5. I offer to work more so he won't have to but no instead he wants me to study. Me and my parent are paying for college and its expensive, My GPA will go down, my grades will plummet, and my parent will despise me. Im scared that I won't be the person who becomes a someone, a someone who others can look up to, a someone who makes his parents happy, a someone who can look his kid self in the eyes and say, \"You made it, your life wasn't a waste, you accomplished a lot\" But thats not me, I'm scared because the days are getting harder and more stressful and it keeps getting worse, the day is never the same, Its worse than hell. Please help "
    },
    {
        "name": "t3_56fre7",
        "created": 1475935224.0,
        "ups": 1,
        "downs": 0,
        "title": "Anywhere I can get away with selling my kidney? Need help and advice",
        "selftext": "Hey my names Brian and Im 21 and healthy and want to sell my kidney for a high price. (500,000$) I received an email a month ago from apollo hospital and said I can sell it for a maximum of 500 grand and told em Ill contact em when im ready to do it. Soo I researched it and read that its illegal to sell my kidney everywhere besides Iran and saw alot of people getting busted in India for doing it and it sounded too good to be true. So yeah Im broke and struggling and everytime I try to make moves I get dubbed or shut down and it seems nobody wants me to succeed and the worlds against me and this shit sucks. I applied for lots of jobs over the years and been to like 4 interviews and got no calls back and I tried college already and that shit aint my thing either. And my parents wont help me out and let me get my inheritance so I can go get me a nice car and some tattoos either which are some of my goals im trying to achieve. So yeah I dunno wtf to do Like im trying to find an easy way out and would love that to happen or maybe I should join the military or file for disability. So yea I appreciate any helpful advice can get. Thanks :/"
    }
]