[
    {
        "name": "t3_jydb5d",
        "created": 1606003966.0,
        "ups": 6,
        "downs": 0,
        "title": "Need help with making friends.",
        "selftext": "Hey, so I'm 18 and started my college 3 months ago, I live in India. I've been shy for my entire life and wanted to get out of my comfort zone in college. I had a really small friend group in my high school. I decided I'll interact and make friends in my college as people from all over the country come there, but unfortunately due to this pandemic the classes were held online, everybody talked on the whatsapp group but the anxiety of not being acknowledged or being made fun of stopped me from interacting in those groups and now I feel it's too late to suddenly start texting and offline classes won't start for the next 3 months at least. I stay alone in my room most of the time mostly learning new things but seeing everybody make new friends depresses me and I have a huge fomo since I really didn't want to miss the College fun like I did my high school. I'm confused and anxious now, I really need some help as to what can I do to improve the situation. I really can't understand where to start and feel lost alone like life has no purpose at times, please guide me as to how to make friends, any help will be highly appreciated. Thank you so much."
    },
    {
        "name": "t3_jdfurq",
        "created": 1603054485.0,
        "ups": 1,
        "downs": 0,
        "title": "Should I use medication?",
        "selftext": "I wanted to know if the following has been everyone’s experience and should keep working on it or should I use the anti-depressants my doctor prescribed me for Depression/Anxiety to help me further - Lexapro 10mgI think I have social anxiety, I was diagnosed with Depression and Anxiety after a day long evaluation and tests, this is what I feel in certain situations:Parties - Going AloneBefore the Event:Before going to the party/social event I would sign up get excited but right when the moment arrives when I have to show up my mind gets filled with thoughts like - Should I go? Who would I talk to? What would I talk about? And then keep making sure I look good multiple times? Etc.During the Event:and finally when I do show up after wasting some time, I see all the people in events being in groups, I won’t know how to approach the group and due to the fear of looking awkward standing alone, I quickly run to the food section, etc trying to look busy and then slowly start with finding smaller groups or people from my same race (Originally from India), because it’s easier to connect with them about something. The conversation:I tend to stick to the usual boring questions which even bores the shit out of me, about work, location, and other boring small talk. After I’m done with smaller groups and my nerves are eased I try to approach bigger groups, this is what happens when I do that - I introduce myself, and asking some boring small talk shit out of context when the others are clearly already in a different conversation, then try to listen to what they are talking about while my mind is internally racing thinking listen to what they are talking, say something, say something, say something and then I just hang around in the group smiling, nodding and boring myself and not even being sure how to exit the group, so I just stand there doing this for a long time, by this time I’m standing there awkwardly and not even concentrating on the conversation.After the event:I feel very stupid and angry that I was not able to connect with anyone and had to go through that dreadful couple of hours and then start to get depressed about my social skills. Growing up I have always been quite shy, mostly had small limited group of friends, met my ex girlfriend through college in the same class, etc. I have been trying to work on my social skills and these are some of the things I have been doing which I think are helping:- Pushing myself to talk to random strangers - Either compliments, questions, and then trying to make some small talk- Trying new things like Karaoke, my hands and body were literally shaking on the stage, I just held on to the mic with all my power in order to control the shaking and not look stupid. I usually get these shakes during beginning of interview, verbal confrontation with someone, talk in front of a class.- Bodybuilding, cardio and healthy diet - this has been making me feel more happy and confident - One thing I definitely realize now is I tend to think people are looking at me, judging me or laughing at me,  but in reality no one gives a fuck about my mistakes, etc. I’m trying to work on this as well and Maybe I also need to work on some self esteem issues?All the above have definitely been helping with the nerves as I can notice I’m definitely more willing to jump into an anxious Situation/take action now, while still learning the basics of social situations, conversations, social awareness, body language etc. Should I continue to do this or start the medication as well? Just worried about side effects. Anyone who had similar problems, how did you overcome them?"
    },
    {
        "name": "t3_f6objt",
        "created": 1582205409.0,
        "ups": 1836,
        "downs": 0,
        "title": "Need to make this happen..",
        "selftext": ""
    },
    {
        "name": "t3_ikcvxn",
        "created": 1598959697.0,
        "ups": 6,
        "downs": 0,
        "title": "Need help to start dating, but I'm too anti-social and at this point I dont know how to deal with people",
        "selftext": "I've always been an anti-social(depressed) guy. Sometime in 2017 I learned to fake it all and act normal, where a girl proposed to me. Long story short, we broke up in 2months, and I dove deeper and harder into the anxiety loop than I've ever been. I have no idea what I'm supposed to do to get friends and eventually date. Plz help me!!PS: I live in india, one of the worst countries to build social skills."
    },
    {
        "name": "t3_ibrtne",
        "created": 1597744076.0,
        "ups": 9,
        "downs": 0,
        "title": "Looking for an accountability buddy- let's chat about our SA and how we're trying to overcome it",
        "selftext": "Hi everyone, i'm a 22 year old female who's dealt with social anxiety all throughout my childhood / highschool / uni years. My parents are from India but I was born and raised in Canada. So culture plays a big role in the development of my social anxiety as well. Some days i'll be okay, and then others I literally cannot do basic tasks without getting extremely overwhelmed.It'd be nice to connect with another female of similar background to talk about what we're facing. An accountability buddy of sorts. Feel free to message me if interested! I think it'd be really nice to have a conversation with someone that actually gets it when I say that hearing the doorbell go off when i'm not expecting anyone puts me into complete panic mode complete with a racing heart...Lol. (And that's just one example D:)Edit: females only please..but feel free to comment anyway - perhaps another member would want to connect with you"
    },
    {
        "name": "t3_i3x79d",
        "created": 1596623845.0,
        "ups": 3,
        "downs": 0,
        "title": "Anxiety causing me health issues and unwanted weight loss",
        "selftext": "Hi,I have been living in the USA for 2 years now for my Masters, earlier I was in India and used to live with my family, and have heavy social anxiety and nice guy syndromeEver since I started living with other roommates, it became a problem for me. I like to eat on my terms and not share groceries or cooking with others and that is a problem for me.There is a guy living in the living room (attached with Kitchen) due to which **I avoid going to the kitchen** since I'll have to acknowledge the guy in the living room with a smile or greet which I'm not comfortable or get really anxious. And whenever he goes to the washroom I furiously run towards to fill water and some food and get back to my room so that I don't meet/see the guy before he comes out of the bathroom. We rarely chat with each other.This had made me avoid going to the kitchen to the extent I skip cooking and eating meals and just satisfy my hunger with the prepared food items that I have in my room like chips/bread. This bad eating has caused me digestion issues due to which I'm having red stools(appointment with the doctor is set) and weight loss of 20lbs making me really thin with loss in focus at work.Please suggest something to avoid this anxiety, and I'm not able to deal with this issue.Also, let me know if this needs to be posted in other channel"
    },
    {
        "name": "t3_bwlapf",
        "created": 1559656822.0,
        "ups": 4,
        "downs": 0,
        "title": "Social anxiety and self treatment",
        "selftext": "Has anyone had any success with self treatment when it comes to social anxiety? I am not exactly in a position to see or afford a therapist so I was hoping that there are ways to treat yourself on your own. I understand that it may not be as effective as traditional therapy but I hope it can still make a difference in my life. I have struggled with social anxiety for a long time and have more or less resigned myself to a life of zero social/dating life and poor job prospects. But I really don't think  I can carry on like this for long and it hurts me to see my poor parents being constantly worried about my future.  I am really tired of my life and just want to make things a little better for me. So please, can you suggest some books or internet resources on Cognitive Behavioral Therapy,how to lessen social anxiety, build self confidence,etc., that has worked for you? Thanks in advance."
    },
    {
        "name": "t3_2cvvsr",
        "created": 1407450114.0,
        "ups": 12,
        "downs": 0,
        "title": "Traveling solo with mild social anxiety to Amsterdam, NL from New Delhi, India - Good idea or disaster waiting to happen?",
        "selftext": "Hi guys,I'm a 23 year old guy with a mild form of social anxiety disorder. I run an online business which gives me the freedom to work from wherever I want and I've been to 3 Asian countries so far but with my family and that was long ago. I've been home bound since around an year out of my own choice. (I hate socializing besides my anxiety anyway because most people in India are a whole new level of 'inconsiderate' and rude - sad but true)This year in December 2014 I'll be flying solo all the way from New Delhi, India to Amsterdam, NL and will stay there for 2 weeks and also visit Paris for 3 days via train.While I'm super excited about this trip as its the first time I'll be visiting a 'western country', I'm also equally paranoid / anxious about it because I have a mild form of social anxiety disorder that has the potential to skyrocket and completely take over me given the 'right' situation.To add to my worries I get especially self conscious and anxious when speaking to foreigners. Its like I imagine they think my Indian accent sounds funny like Apu from The Simpsons or that I look funny and all sorts of low level racist things.I know Amsterdam is a very friendly place with chilled out and laid back people but I am very worried that I don't mess this trip up with my social anxiety.It will be a drastic change for me and a huge challenge because over here months can go by where I even leave my house, bar a few times for business purposes. I'm at the point where when I do go out here I actually feel like I've landed in a new place.. LOL. I miss good ol' sunlight as well terribly.I know that is pretty extreme but I call my social anxiety 'mild' because when I do go out I can function quite normally and am mostly confident unless I'm in a particularly tough situation like speaking to strangers or going to a club (which I never do). I don't go out over here out of choice because living with social anxiety in India is anything but easy - if you try to get out of your comfort zone the people here will just push you right back into it. Around an year ago I was going out all the time and had a lot of friends etc, I managed pretty well except for a few times when my SA got the best of me - but the general rudeness of people here, backstabbing friends, friends stealing from me when my business became successful etc just made me feel like its not worth the trouble going out and socializing so gradually I stopped going out, then stopped responding to their phone calls and texts, eventually they stopped calling me and its been close to an year now where I haven't gone out at all except for a few times for birthdays or business meetings and such.I've built a nice wall around me here since the past year to shield myself from all the crap that goes on outside and I was kinda happy with it so far but now its starting to suck a little, I'm getting increasingly bored and actually wanting to go out but since I cut off all contact from just about everyone I'm not sure what to do. Its starting to feel a little bit like I've 'trapped' myself behind a wall that I made myself and can't reach out to anybody anymore.So with this trip I'm pretty much putting all of my chips in and pushing my luck - trying to break this wall I built over the last year.. maybe I would mess it up right from the airport acting all anxious and shy etc and by the time I go to Amsterdam I might not even have the courage to leave my hotel room.. but on the other hand I can see it being a pretty awesome trip where I could probably have the time of my life.What do you guys think? Should I go through with this or not? Traveling solo thousands of miles away first time with mild social anxiety. Good idea?"
    },
    {
        "name": "t3_4c44ku",
        "created": 1459076238.0,
        "ups": 3,
        "downs": 0,
        "title": "Planning to organize a meet in India, Bangalore for Socially Anxious individuals",
        "selftext": "Guys, I'm planning to organize meets and help socially anxious people overcome their phobias. If you're interested then do check out this group. Since this is a secret group I have no way of informing people about it except by directly telling them about it. This is a support group for people suffering from Social Phobia, Social Anxiety because as of now we have zero support groups for this in our country.https://www.facebook.com/groups/1699954696958778/Edit: If the link does not work then just PM me your email address. The secret group is not accessible directly it seems."
    },
    {
        "name": "t3_dlbwpr",
        "created": 1571743275.0,
        "ups": 0,
        "downs": 0,
        "title": "I froze twise while approching a on Ecstasy.",
        "selftext": "(Long Post)(Need help)This happened yesterday, their was a fest going on in our University and since it was my last fest, i decided to drop Ecstasy. Since our University is located in a rural area their are no proper bars or pubs to drink, so the students have started drinking in a garden which is 50 metres from our University. This was a three day fest and on day two i went out drinking in this garden. I was drinking with my buddies (all guys) and after some time a group of girls from our University came and started drinking besides us. While drinking i noticed that two girls from that group are checking me out. Something about myself:- I am a 21 year old law student in the last year of his course. I have major social anxiety and in my five years at Uni, i have only socialized with a small group of people in my four years in Uni and almost all of them were guys. This was primarily because i got a cultural shock when i moved from a small town to one of the elitist University in India. I am 6ft 2inch with good facial features but a skinny frame. Generally people rate me 7/10. I was decently confident when i started University, but due to my inability to speak fluent English (which is the primary language of conversation in this place) and the highly urban crowd which i had never experienced before, my self confidence was very badly damaged. On top of that i made friends with people who had the same problem of language and culture like me, people who didn't exactly 'fit' in this place. Irrespective, they were pretty toxic and always discouraged and scrutinized any attempts that I made to socialize with people out of our social circle. They would make fun of me for misspranousning  words in my presentation and not able to form a coherent sentence when participating in class or speaking to other students. This led to me becoming more and more anxious leading to a total stop  by me to try anything or interacting with new people. I just started keeping quiet in lectures and just didn't interact with anyone in the class and made my body language very unnapprochable. This led me getting isolated, loosing my self worth and growing more and more insecure about myself everyday. I started suppressing my opinions and started doing everything which was acceptable by my isolated group of friends. I turned to weed and used to numb myself with it to coupe with the anxiety but the paranoia kept making it worse. I finally started fighting back from my third year and started working on myself. I started getting better at speaking English, learned a lot of new things, got better at studies and putting my opinion forward. I started being more assertive about my boundaries and stopped my friends from walking all over me all the time. But still there is a lot of anxiety, insecurity and an overall inferiority complex. I have only dated one girl in my life which was long distance, we met twice in 3 months and just made out. I don't consider this a proper relationship though. I have a decent amount of good female friends. But it is very difficult for me to talk to a unknown girl, and usually make a fool of myself. I get a decent amount of female attention and a lot of girls have tried to flirt with me but i just get too anxious and awkward. I start overthinking the interaction and always find a way to convince myself that this one isn't right for maybe the next one. However, now i have changed myself and i am trying to actively communicate with girls. I even approached two girls in the gap of six months and got rejected both the times due to very awkward conversation both the times. I have been feeling very lonely for the past 3 years and i crave romantic intimacy.Coming back to story:-After realising that both of them have been glancing towards me, i started making eye contact with the one I was interested in. However, like always i didn't approach her and just left the place after finishing the booze and even give a look back. The next day( last day of the fest) i popped ecstasy and went to the  garden with my friends, i started tripping intensely after i reached the party garden. Coincidentally, the same group of girls from day two came and started drinking 20 meters away from us. At this time i had reached my 'peak' of ecstasy and was tripping major nutsack. The high started reducing and got a collected my self a little bit but i was still pretty high, now i start noticing that the same girl from yesterday was again galncing at me in very short intervals, i started making eye contact with her but would break it in 2-3 seconds because of second thoughts. My friends started leaving for college but i was still pretty high so i decided to stay on my own, i started socialzing with people that i knew and all this while me and that girl kept making eye contact. I still wasn't sure weather i should go and talk to her. Then she looked at me for like 10 seconds without breaking eye contact and gave a huge smile. Because of the lowself esteem idiot that i am, i looked turned my neck in both the directions to confirm that she was actually smiling at me. Any other day I would have bounced from that place without approaching her because of my fear of rejection and making a fool out myself but not this time. This time i was on Ecstasy and wasn't feeling my high level of anxiety which generally happens in these kind of situation. I decided I am going to make to make a move this time. I had promised myself in the summer that I'll try and break my virginity in my last year of law school. I waited for an appropriate moment in which she wasn't occupied too much by her friends. I saw an opening and started walking towards her, she was making her drink from the bottle which was on the ground. I stopped 3 ft away from she turned saw me and smiled like she was expecting me. She turned her head again and i just froze. I couldn't utter a word, and after standing there for like 5 seconds without saying anything. I just walked of from their. I cursed by my self for being so pathetic and thought about going back in the college. But i decided to calm myself and try once again because i was really interested in this girl. I smoke a cigarette, muster all the courage and started walking towards her again, this time she was standing with her friend who were both dancing on rap. I stopped she saw me then started looking at her friend. I am feeling extremely nervous right now but i fight it and after 3 seconds i say \" I am sorry for earlier, i just got nervous\" in a very shaky voice. She responded \"it's okay you don't have to worry about that\" in a very soft tone. I ask her name tell her mine then shook her hand. Another friend of her came thinking that i was making her friend uncomfortable. Her friend who came, starts looking at me in a very suspicious way because it could be interpreted by my face that i was on some hard Drugs ( which i think the girl who i approached also figured out) my anxiety shoot up the roof and i wasn't able to utter even an alphabet. I froze again and walked of again, this time for real. I had a very bad trip after this incident and kept cursing myself for being a losser.I seriously need help as to how to overcome my social anxiety and be self- confident, that why i gave a detailed description of myself. I also got to know that the girl i approached is a mutual friend of a guy freind of mine and he has recommended me to send a insta request and start chatting with her. I want your opinion weather i should send her a request or i should just forget about her"
    },
    {
        "name": "t3_btdao3",
        "created": 1558933826.0,
        "ups": 5,
        "downs": 0,
        "title": "Feminism, modesty,social anxiety,ocd, mental health, college, friendships",
        "selftext": "I feel I have been prude shamed by my friends in college for dressing modestly. What they don't realize is that it's not that I'm orthodox in my thinking, it's just that my mental health issues leave me little time to really care about how I dress. I'm just indifferent. My social anxiety makes me look all quiet and \"nice\", which just adds to the image of a naive little thing. I also am beginning to identify as a non-binary woman, which might be another explanation for the indifference towards dressing up. The weirdest part about all the stereotyping is this- people (okay, this particular person) say desexualizing things to me..but as I was growing up, something that distressed me and made me feel all guilty was my obsessive sexual fantasies! My OCD also meant that I had intrusive sexual thoughts apart from my own fantasies. I'm very open about my social anxiety but I don't tell anyone other than therapists about the sexual thoughts. So the thing is now I've become so conscious due to all the stereotyping that I'm in a really bad place now. I can't be myself ATALL. Even if I want to change my lifestyle, clothing etc., I cannot because people have labelled me a certain way already and it's affecting every little thing I do. This might not sound like a lot, but I'm at the lowest I've been, terribly lonely and unable to do anything creative. I cannot express how I'm feeling but I'm feeling miserable. All the narrow-mindedness has worsened my mental health. A lot of the loneliness comes from the fact that I'm unable to talk to people and feel very dependent on a close friend. It's more than the sum of all this though- it's taking a real toll on me.I want to change things here in my college. I want people here to learn to stop putting people in boxes. Tell them what they've seen of the world is not the whole of it. My college is very elitist and lacks diversity, which is probably why everyone here is quick to jump to conclusions and disrespectful of people who don't conform. I myself come from a privileged background...it's just on certain levels (everything described here) I don't fit in with the lot here. My mental health issues are the main reason, you could say. I want to start a group for alternative socializing on campus! :)  But I barely know where to start and am looking for help finding resources, people etc. Do give suggestions for websites, other online resources etc. I'm from Bangalore, India so if you know anyone working on something related here, please reach out to me. If you know about similar initiatives in other colleges (anywhere in the world!), that would be great. Do let me know of any useful, relevant material!Additionally, I recently came across a read on how eurocentric feminism punishes modesty. This was in the context of the hijab and I know that's an entirely different experience. However, I strongly feel that looking at modesty and mainstream feminism would be very relevant to my mission. So if you can direct me to anyone or anything related to the same, please do. THANK YOU!"
    },
    {
        "name": "t3_byvj7l",
        "created": 1560185973.0,
        "ups": 3,
        "downs": 0,
        "title": "Help",
        "selftext": "I've always had Social anxiety as a kid.. I'm from India and it's been 6 years since I came here to Canada.. Missing everything n everyone back home made the anxiety worse.. Now I've gotten over missing back home and want to get over SA..I feel like people judge me constantly all the time.. Judge on my accent and how I look.."
    },
    {
        "name": "t3_b1becp",
        "created": 1552659898.0,
        "ups": 0,
        "downs": 0,
        "title": "22-year-old female, always eager to socialize but literally zero friends :/",
        "selftext": "So I have 3 best friends who know things about me that’d make my family emancipate me lol but they live in Bombay (India), NYC, and Ottawa. One of the best friends, the one in Ottawa, used to live in my city (that’s where we met). After she moved away in September 2016, I’ve literally not made a single close friend. I have absolutely no one to hang out with. Since that time, I’ve always texted anyone I know first about making plans, they leave me on ‘read’ then I’ll ask again super nicely like the first time and they’ll say no or just never respond. I get along absolutely fine with my coworkers and I still haven’t given up on initiating conversation (both text and in person) but no one wants to hang with me and I’ve gotten so lonely, that I feel I’m just a waste of space. When people tell me stories about how their “friends” did something funny, and I try to come up with one in return, I don’t even know who I’m talking about when I say “oh yeah same thing happened to my friends haha...”I have started using the apps BumbleBFF and We3 and the latter seems to be headed fine so far but I want a real connection - I am desperate and feel very very very lonelyI have a horrible habit of oversharing too soon which I can’t seem to control but am consciously trying to continue avoiding that with the 2 girls I’ve met on We3.Idk if this info is useful but I’m 5”2, quite chubby, and very average looking. I have a 6”0 gorgeous af boyfriend who legit has these same issues except for the fact that he actually has serious social anxiety and he’s kinda learnt to be okay with it but maybe if I can improve I can help him too. I feel hella used by any acquaintances I’ve occasionally hung out with (like 2-3 times over a course of 6 months) and then I went hella hella HELLA broke from Jan-March of this year so when I got invited to something for the first time in like ever, I had to say no and I told them that it was bc my bank account was in overdraft and my credit card was over it’s limit but they didn’t believe me/understand it and have stopped responding to me and constantly lie when I ask them if they’re free by saying no then hanging out with the other girls I know. I love to socialize and am hella desperate to have friends and hang out. Please tell me what I’m doing wrong and what can I do to have a damn life &lt;/3"
    },
    {
        "name": "t3_acdth6",
        "created": 1546600553.0,
        "ups": 6,
        "downs": 0,
        "title": "I honestly just want to my brain of , maybe then I​ could have a normal life and friends",
        "selftext": "\\-autocorrect turned off to of for fucks sake.TL DR just a emotional vomit of my current life in regards to having friends?, I don't know anymore.College just started back its my second day on campus, and I am already in tears. Before the break a friend I felt close to said I was clingy and seemed jealous of her other friends. but still wants to be my friend but didn't really want to see me at the moment but said she still wanted to be friends . Break happened no to little contact. School is in session and no communication from her at all. its only been two days but I don't know a text or something would be nice. But nothing. I feel like its over, I tried overcoming my SA by attempting to initiate more with two friends. And it completely backfired she said I was clingy when I was just trying to do what she often did to me during freshmen year . She invited me to many things, she would just come over to say hi and pop in.I was primarily alone before that but then she showed up and started all this stuff to me, I got used to being around her. So much of my time freshmen year last semester was with her. New semester starts she rooms with her friends I'm also friends with and she starts contacting me less and less, Spends less time with me and all. Yet now I live across the hall . I'm constantly reminded of her and her friends every time I go to my room. I really thought we were close, but it was all one sided. It was like my SA told me my existence is a problem for those I want to be around. I really thought I had a circle that I was overcoming my SA , but I wasn't. Maybe im overthinking it its only been 2 days. maybe she hasn't had time to contact me yet, maybe she will eventually the semester just started. Am I clingy? , I kinda worry that I am sometimes. Is me wanting to see a friend once a 3 week break is over too soon. Is that not how friendships usually work? I don't know. The day I came back I sat with a group of acquaintance . The three of them are friends she just came back from India, and immediately made plans to have a meal with them and got them gifts from the holiday and dispersed them .I feel like that is what I wanted to do. I wanted to see them all of them the main friend I thought I was close to, and her roommates who I am also friends with . I wanted to see them all. Yet I didn't, they probably all met up already. I was probably never considered. I never am, none of them text me, the main girl I thought I was close to use to text me the other three don't. Do they just not text? I feel like they probably do, but not me. and then she joined them she became roommates and now I just feel like I don't exist to any of them. Before they were roommates the 4- 5 of us would do things pretty regularly . But now that they are its just the 4 of them never me , same activities but don't invite me.I asked the main one about this before break she justifies it saying its just \"roommates things\" is that really a justifiable answer. I feel like she doesn't want me to be friends or hang with  her roommates honestly, freshmen year she would have me eat with her and her now roommates often.But now if she invites me to eat its just her. Unless they enter by chance. But I also feel like that's to deep, no one would do that, thats just me overthinking. I don't know I'm just tired. I'm tired of feeling unwanted. I'm tired of thinking that I am a burden. Before that happened with the friend I thought I was close with , I was reaching out talking to people , trying to make connections, I thought I was growing, I thought that maybe people enjoyed my presence . But after that thing with the friend , I don't know.I kind just stopped everything, I stopped texting those I really enjoy talking to, for fear I am bothering again. I started apologizing for my actions a lot more . I got some games over break and I just been playing them to stop the feeling of loneliness, and it works for bit , I even started sleeping more just so I can be alone less. You can't feel alone if you are unconscious after all. I took a 5 hr nap by accident today, I haven't napped in over a year now . I can't even draw, I was drawing so much during break yet now I don't even have it in me to hold a pencil. I want to see people , I started to do that before break , but I'm afraid. The one person who I thought was okay with me wasn't, and I don't know what I should do im still waiting for her to possibly text me tonight.Today is her friends and roommates birthday , the friend who I am also friends with not close with completely, but close enough for me to call her a friend stated that she doesn't really do celebration and gifts so I said I understood and respected that assuming it was genuine but who knows. But knowing the friend I was close with she would definitely doing something for her even if its small. So now i'm wondering staying awake, in hopes that she may text me and invite me over to give a small celebration for the mutual friend. But I doubt it too . I walked to my room and I heard them laughing , I quite simply wasn't invited I think.But also I don't know , I could be overthinking , I probably am. I just wish that I could just turn of all these emotions I'm feeling , they only turn off when I'm sleep sadly. In my dreams over break I dreamt that I was hanging with all of them just having fun. But now that I am back not even 2 days in I have cried so much, but for what. These tears do nothing. They won't help them come back , they won't have them reach out. Sharing these feelings with them will help nothing. I actually shared my feeling with the one friend about how I felt and yet nothing has changed. It has only been 2 days , I know I need to give it some time. But the longer it goes the worst it gets. If something happens in general for me I need to hop back up immediately, if I don't I regress . I have had about a month of regression. I can't contact her first anymore ,I lost the ability  completely, if I do then I will be bothering her . So I am waiting , for her to initiate like she used to, since me doing so has fucked up so many things.I just had to let this out . I've been trying to ignore these feelings and all . these growing worries and fears have just been eating me up. I want to be around people, because when I am , I can keep it together. and can shove my worries away. but when im alone there is no one or reason to keep it together and I just fall apart. I'm tired of falling I just wish sometimes I felt nothing at least then things would be okay I imagine."
    },
    {
        "name": "t3_9vkdaf",
        "created": 1541798546.0,
        "ups": 10,
        "downs": 0,
        "title": "(Repost) A semi-complete list of medicinal plants used to treat anxiety",
        "selftext": "This is the most complete list of natural remedies for anxiety that I have been able to find. It is from the University of Science and Technology in Haryana, India. It is short, concise, and detailed. This kind of thing might not be the primary purpose of this sub, but as someone with even moderate social anxiety, I feel obligated to share this awesome resource with you all. Use it well: http://www.imedpub.com/articles/medicinal-plants-possessing-anxiolytic-activity-a-brief-review.pdf                                                                                   "
    },
    {
        "name": "t3_79e4q8",
        "created": 1509272228.0,
        "ups": 4,
        "downs": 0,
        "title": "Story of me beating social anxiety!!",
        "selftext": "Warning: this is going to be a long post. Hello, I just joined this sub Reddit and created this account just for the sake of getting my social life back in control. Before i go any further i would love to talk about where i was 4 years ago. Since i was a kid i always wondered why i am I so weird. Why can't i do social stuff like everyone else, why am I always scared, why do i stutter when i have attention of a group of people. These questions always were in my head until when day i found out about social anxiety and finally i was like i have the answer. Now i can look for a solution to treat my social anxiety. I think i was like 16 when i found out about social anxiety, although i was in India at that time so didn't had much support for it plus basic teenage stuff was going on in life. Getting bullied, being ashamed of being skinny which hurt my self esteem really bad, not being able to express my feeling to the girl i liked. All of this made my anxiety worse and i started to avoid people. Move forward to the age of 19 i come to new York, i feel now my life is gonna change. Somehow magically being in new York will turn me into some confident social bird. But i was wrong, i started college and things aren't changing i am still anxious around people have low self esteem, don't have a gf, skinny sf plus i am developing depression now. On top of that my mindset is changing into a mindset of a victim, i always feel like i am being attacked by people. This goes on for few more years and somehow i survive. Now I am 21, fucked up. Social anxiety is so bad that i can't even get out of house. I fucked up my semester in college and gpa is all fucked up. All i do is play league of legends whole day and i am only eating like one meal a day. Plus i am broke af don't even have money for food. I had it enough i said i have to change myself and will have to take control over my life. I had this burning feeling inside my body which i couldn't get rid of. So i started to taking, i did the following: 1. For first month i practiced getting out of house. I would go carts thinking about how do i get out of house. But i committed to it sometimes i would just walk outside for a minute and comeback. 2. Second month started to take walk outside house. My goal was to take walk a in places with lots of people, which is easy to do since i live in nyc. While walking my goal was to observe my anxious thoughts and try not to react to it. I read this book called power of now, where i learned about this concept of observing your thoughts. 3. Next I got a job as a salesperson. Holy shit that was a nightmare i have no idea how i even survived that, it was just crazy i wasn't event able to talk yo customers. I wanted to avoid that but i had no choice. 4. In college my goal was to ask questions in class. It was awkward though but i had made up my mind. I am not going to live like this, i have to beat this social anxiety. Now fast forward to 2017, one of my best years in life man. 1.I crushed it this year, i started my ecommerce business for which i worked my ass off and now i am making decent money. I am also about to launch my own social media agency. Plus i am part to so many entrepreneurial communities on social media. 2. Last semester i had one class where i would i was the most social person. Everyone knew me, i would make jokes and stuff. 3. I joined gym and went from 115lb skinny dude to 140 lb guy although i haven't been going regularly to gym recently. 4. Went to tony Robbins event unleash the power within! It was really crazy crazy. I am really into self development and tony is one my favorite person i look upto. 5. I went on a trip. 6. I tried to pickup girls, lol. It's fun but it's scary at times. And more stuff which will only make this post longer. How did i do it? I really believe that what we focus on is what we become. So my whole life i focused on social anxiety but in last few years i have changed my focus from anxiety, depression to the person i want to become. I try to focus more on what my goal is and how can i achieve it.  Also i feel you have to have a sense of like enough is enough. Frustration and anger have always been my fuel, they give me so much energy to push myself further and further. Do i get anxiety? Yes feel it everyday it's just matter of taking control over it. Decide if you want to give in to anxiety or you want to win over it. Also i recently read something cool about anxiety, instead of trying to call yourself being anxious call yourself as being excited as anxiety and excitement are similar emotions. So by doing this whole meaning changes. Although i haven't been doing things i used to do and getting kind of comfortable. Recently i started to stutter when asking questions in front of big group so i have start working on social skills again. Ask me anything guys. You want to message, do that. I will do anything to help you need any advice. I am here to grow and help others grow. Peace🙏 "
    },
    {
        "name": "t3_8qizj1",
        "created": 1528839448.0,
        "ups": 1,
        "downs": 0,
        "title": "The odd one out vaper.",
        "selftext": "Hi Internet, So I have very bad social skills and I stutter, I always try to blend in like a chameleon to avoid any possible attention. Anxiety has led me to start smoking, alcohol and weed. I'm trying to stop smoking whatsoever.I work in an MNC where we get 3-4 smoke breaks and all of them smokes (vaping is not a thing in India yet). Whenever I try to vape, I get these weird reaction/attention from others which makes me go haywire / sweaty pig.I try to vape alone sometimes backyard of my company.Please give me a suggestion on what you do when you are the odd one out. "
    },
    {
        "name": "t3_8em0r5",
        "created": 1524618164.0,
        "ups": 1,
        "downs": 0,
        "title": "[ask] Can anyone help me figuring a good excuse for missing classes?",
        "selftext": " have been suffering from severe anxiety and maybe even depression for the past one month, although attendance is not an issue in my college but still teachers/friends will ask where I have been. I really don't know how I will confront them, this itself is making me nervous. I don't really want to tell them anything about my problems because people don't really understand about mental health in India. Now that exams are there I need to go, any help?"
    },
    {
        "name": "t3_336hyj",
        "created": 1429518089.0,
        "ups": 10,
        "downs": 0,
        "title": "Any opinions would be appreciated...weird question",
        "selftext": "I am a 21 year old male. I was born near India and moved to the US at the age of 12. I didn't know English back then but I do now. I think in English too. But at the age of 12, I didn't vocalize my thoughts and opinions because I thought my friends wouldn't understand my English (not because of accent, but like grammar and I feared embarrassment). Now 9 years later, I still don't voice my opinions. In my mind, I believe that my inner English voice isn't the English that people talk in social interactions. So I become self conscious and try to put my thoughts out in a way i don't even know and it all comes out messed up and I cannot even think because I am so self conscious. This has contributed to social anxiety and depression and whole lot of other symptoms. Now my question is, are you inner voice English the same English in the outer world. I feel like mine is too, but I have this fear that it is not and I become extremely self conscious and can't even socialize. I haven't really connected with anyone in the US because of this fear so I really don't have anyone to ask this question to, without sounding like a pothead, lol. So is your inner voice the same as English being spoken in the world? Also if it is, do you just speak your inner voice? I mean, is that what an opinion is, your inner voice? And am I just overthinking? Thing is I feel like people don't go through what my mind goes through. I feel like mine is messed up and I am alone in this and makes me feel less connected with people. Please, please, please answer. It can really make my day if I find out that all these fears I have is nothing. "
    },
    {
        "name": "t3_1d8hwo",
        "created": 1367125675.0,
        "ups": 28,
        "downs": 0,
        "title": "Just want to clear something up",
        "selftext": "If I had a penny for every post that said \"developing social skills is just like learning to ride a bike\", I could feed the entire population of India for at least 25 years. It really irritates me that even the most understanding people casually throw this comparison around as if the two things have the EXACT same context. Here is how the analogy would be more accurate:Imagine you are a kid and your father is teaching you how to ride a bike. As you begin the process, you get on the bike and fall immediately. Instead of encouraging you to try again, your dad calls you stupid. A part of you withers away and dies inside, but you still want to try again. The next day your dad brings his friends to watch you fail. When you do, they laugh histerically and spill their beers all over you one by one. They say things like \"You shoulda used a condom\" and \"All the sperm that could've made it...\" as you sit on the sidewalk, broken and defenseless. I'm just about sick of the bullshit pseudo-optimismic attitude that learning to socialize is a fucking cakewalk. The people who imply this have clearly never had to worry about getting perpetually harassed for being awkward. I'm 19 years old and I have never had any close friends, a girlfriend or a job. If people get to know me, they will find out what a pathetic wretch I am. No matter how confident I act, these facts will deter them and they'll want nothing to do with me. If you want to help people, try to understand their mindset first."
    },
    {
        "name": "t3_5ig4a7",
        "created": 1481813584.0,
        "ups": 3,
        "downs": 0,
        "title": "s.a.",
        "selftext": "Has anyone from India, suffering social phobia?"
    },
    {
        "name": "t3_1rhg9l",
        "created": 1385483666.0,
        "ups": 3,
        "downs": 0,
        "title": "Trapped to an unsocial character. Will I be able to change by moving to a different country ?",
        "selftext": "HI I am 18 years old boy, from childhood I have always have been called the 'quiet one', it didn't bother me as much as it does now.I am from India.I have over protective parents like the driver would copy the plate number of a friend's car I hopped in , they did it because we've had a lot of incidents like robbery .I also had a voice problem ,which made me sound like a female and I had to cure it with therapy. I thought I would change after my voice changes, like all talkative and outgoing which I AM ON THE INTERNET AND PHONE.like I'm a flirt.Nobody would believe i'm like this in real life So it didn't happen, it was hard trying to be talkative with people who always seen me as quiet reserved one. So I tried being talkative getting to know strangers in England I went to on trip, and surprisingly I was talking to everybody without any awkwardness even a stranger i met in lift like' Hey ! What brings you here ? ' . But I could never do that in here, because the school I go to places I go I always meet a known person and parents are always with me .For being quiet I'm always made fun of by my parents in front of a large group of people ,aunts,cousins,friends. It's like trying to paint a picture over a painted picture . So for now I have to pretend like I'm an introvert but inside I'm dying to talk! So I decided to do a good result and go abroad alone and change myself for permanent and return to India after 5-6 years. My results came out good and I'm going to Singapore for further studies next year,I don't know anybody from there. What do you think will I be able to change??????????/ given the fact that I'm very talkative and outgoing on internet and phone. I even have a girlfriend here who I never met but only talk to phone, she plans to meet me though.But I'm scared if she knows the the \"Real Me'' as others. For now my parents are constantly asking ' How will you survive there? You don't talk . You are so quiet bla bla' Thanks a lot for taking your time and answering my question"
    },
    {
        "name": "t3_3udlwj",
        "created": 1448593047.0,
        "ups": 2,
        "downs": 0,
        "title": "Should I go out with my friends?",
        "selftext": "Long time lurker, first time poster here. My American friend invited me over to his place for Thanksgiving dinner with his family. I was exited to go at first, but yesterday, I turned him down. I didn't want to go as I felt I'd be out of place. I've never had family dinners or anything like that. Back home in India, its just me and my parents. While were close, we never really focussed a lot on family dinners. I feared that I'd fuck up during dinner and then everyone would laugh at me (stupid, I know). I'm also supposed to go to Canada with him and his friends tomorrow. He wants to go to a club and have fun. Thats all good, but again I have fears of going. I don't hate the club life, but I don't exactly like it either. Having a few drinks at the bar is what I'm looking forward to. But I constantly feel that I should make up an excuse of not going. All of his other friends are great at the club life, dancing, speaking to women at the bar. I'm not exactly fond of things like that. So, I'm kinda scared that they might make fun of me — which I know they won't, because who does that?Also, the fact that I don't know any of his friends properly, I feel that might create an awkward situation. I'm not the best person to socialize with. Although, I've met my friend's girlfriend and one of his friends (both seemed to like me), I still feel that I'd be out of place. I don't know. I don't want to go, but I know that if I go its going to be amazing. :/"
    }
]