[
    {
        "selftext": "How to get rid of over thinking.. When you have no one to talk.. When No one around you can realise your situation and your feelings. You are a introvert person.. You can not do the things you like.. What can help"
    },
    {
        "selftext": "Kya bipolar se suffer kr rhe log apne words pr nhi tik paate? Is it a quality of being bipolar?"
    },
    {
        "selftext": "Is duniya ka har solution hamare brain me hi hai.......ap jaisa sochoge vaise hi ban jaaoge......plzzz koi jyada na soche"
    },
    {
        "selftext": "Everyone have a problem, And every problem have a solution, So Don't be cry for this Now this is time to work on problem. . . . . We can.... n We do.. .."
    },
    {
        "selftext": ""
    },
    {
        "selftext": "According to someone-  To become a better you, you must: 1. Keep pressing forward 2. Be positive toward yourself 3. Develop better relationships 4. Form better habits. 5. Embrace the place where you are"
    },
    {
        "selftext": "Hello friends  I am not feeling good.... Most of the time feeling like crying.. Apne man ko samjhati hoon ek din thik rahti hoon agle din fir wahi... Breathlessness hoti hai.... Sir ekdam se tight hone lagta hai... Kabhi Kabhi sham ke time BP high ho jata hai.... Apne ghar ke logo se bahut irritation hoti hai... Unki har bat par gussa aata hai par react nahi kar sakti... Apne upar bahut burden sa feel hota hai... Man karta hai bhag jau yahan se kahi dur... Par ja nahi sakti... Backpain hota hai.. Chest me bharipan rahta hai Kabhi Kabhi... Ye sab kya depression ke symptoms hain? Kya ye kisi test se pata chal sakta hai?? Ghar par koi manta hi nahi ke aisa kuchh hota hai.. 3 dr ko dikha chuki but koi fayeda nahi mila... Main kya karu kuchh samajh me nahi aa raha..."
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Does anybody know about any center in India where treatments of depressed people are done through meditation, yoga and disciplined life style. It is better if it is a residential programme and minimum duration is 1 month. I am looking for one of my relatives who is suffering from depressions for a long time. He is under medication for a long time but medication is not helping him to lead a disciplined lifestyle. So we need little help from your side pls"
    },
    {
        "selftext": "Social media pe aana bura nehi hai, addict ho jaana hai...  Unhe zaroor achha lagta he, jo lonely hon life main...  Wese main lonely.. jobless hun this time...  Koi dost rishtedar nehi Resentment hai jese Log nehi lagte achhe....   Online time pass karo Pehle fb pe aata tha ab movies etc dusri chizo me timepass kar raha Koi kaam dhanda kuchh nehi jese Karne ka mann nehi karta  Laziness he bohut Well... 27 ka hun Parents half aged now One sister, Akela bacha main Upar se ye mansik bimari sardard (Mujhe kuchh karna hoga, motivation kese barkar rakhun...  pata nehi chal raha)  Zindegi kyun hai yesi Plus social contacts badhane honge thode, warna akele me bimari aur tez Lekin family ko chhodke aur kaun vishwasniya hai????   Kya critical zindegi hai"
    },
    {
        "selftext": "Hello all...I am not able to concentrate on studies...I always get distracted by my own negative thoughts..how can I get over it..any suggestions please? Thanks in advance.."
    },
    {
        "selftext": "कोई भी दुख आपके साहस से बड़ा नहीं। हारा वही जो लडा नहीं।।"
    },
    {
        "selftext": "Just need to speak someone..."
    },
    {
        "selftext": "Suicide Trigger: I'm continuously getting suicide thoughts since many days.. I think nothing is left in my life. I should rather die.."
    },
    {
        "selftext": "Its Hard to live...Tired Pls help me"
    },
    {
        "selftext": "How to overcome loneliness specially when you don't have family or friends..  I'm very depressed and lonely.. Not having interest in activities which I used to enjoy.."
    },
    {
        "selftext": "Apart from allopathy, has anyone tried any other form of medication for depression and insomnia.  Like is there any good ayurvedic Or homeopathic treatment for depression so as to avoid the side effects of such heavy allopathic antidepressants?  Suggestions are welcome.."
    },
    {
        "selftext": "Hi I am new to this group and I appreciate that I am part of it. I am really skeptical about sharing my life events but I have now decided to vent out.  I have been married for two years now and almost seven months ago I had experienced a miscarriage (at eight months) which left me devastated. I was psychological not in a state to control myself and I was put under psychiatric treatment and medication. I did get a lot of support from my family and husband but there are certain people in my life that bothered me. I have few close friends as I am not open to people. I really supported them and helped them in times of their need and also stood by them in times of happiness. However among these few friends, one of them had got quite detached after getting a job, like never replying to msgs and calls and all and never knew about my mishap (but she was quite active on social media but ignored our msgs and calls). The rest of us decided to let go off her and moved on with our lives. However my bestie started to respond to this so called let go off friend of ours through calls and msgs. This let me a little disappointed as I thought she disrespected all of us and we all must take an united stand. Adding to this disappointment, my bestie never turned up to my house after my miscarriage incident although she travelled to different places during and after the lockdown period. Till now she has not come to meet me. I felt really disheartened as I have experienced similar behaviour previously as well from her. I decided to discontinue the friendship. It is her marriage now and I so wanted to be a part of that as she was of mine. I have literally no one to talk to and feel defeated at certain times. I wonder am I being too dramatic or my expectations are too serious! I would acknowledge your thoughts on this."
    },
    {
        "selftext": "Pls help me .i m scared"
    },
    {
        "selftext": "I do know how to get rid of doubt on myself from life. It happens because of anxiety, depression, ocd,.what I did I don't feel I am doing right or wrong. i am in job I have fear to lossing job. I always doubt on self. I want to feel free and want to feel confident . But don't know how. I doing yoga everyday readings book. Doing everything but not getting results"
    },
    {
        "selftext": "Hi all I am in a bad place atm.. I have a history of spilling secrets which jeopardises all of my friendships.. yesterday only one such incident blew up in my face.. and the persons secret who I spilled can’t see me as a bestie anymore. I feel emotionally worn down can’t sleep and everything. More importantly are there any ways to counter the secret spill issues"
    },
    {
        "selftext": "इस मोड़ के बाद आगे सुकून है... ये कह कर पूरा सफर गुजारा हमने..!"
    },
    {
        "selftext": "ये जो गुजर रही है... क्या यही जिन्दगी है...!"
    },
    {
        "selftext": "Are u ok guy's???"
    },
    {
        "selftext": "I need some friend with whom i can talk"
    },
    {
        "selftext": "I am very much depressed and going through chronic anxiety. Getting suicidal thoughts and thinks that this fear and anxiety will never end. It will end with me"
    },
    {
        "selftext": "How to approach new people and make friends? Please give me some suggestions, I really need some friends."
    },
    {
        "selftext": "How to stop comperision with others. As my father ,grandfather and other family member showed me you are not good you have to follow others and become like other people who are there in the village. Now I want to delete the memories and all the comperision pattern of subconscious mind. What to do to stop comparing with others. I am trying my best but when I encountered with anyone it starts automatically. I always give affirmation to me but it is not working .  Now when they say become like others I just start frighting with them. If you hadn't provided in good education why are you expecting to become like other qualified people."
    },
    {
        "selftext": "Has anyone else experienced depression getting worse due to relationship problems between husband and wife..  Would like to hear your stories.."
    },
    {
        "selftext": "I have created a whatsApp group for all the members. I would request you to go through the rules in the group description. This is a serious group to help each other and understand each other in their difficult times. If anyone found misusing the group then strong action will be taken against him/her. chat.whatsapp.com WhatsApp Group Invite WhatsApp Group Invite"
    },
    {
        "selftext": "We have made an telegram channel for our group you can join us there. t.me Depression and anxiety support group - India This is the fellowship of those who suffer silence. End the stigma. Join us on Facebook also."
    },
    {
        "selftext": "i feel like i m gonna die"
    },
    {
        "selftext": "Please beware of this person!! He was removed from the group and I guess he has joined the group with some fake I’d and messaging g females that he can solve their problems by performing a pooja ritual and all the have to do is a video call without any clothes.. he is a sick man please don’t fall for this"
    },
    {
        "selftext": "Hi friends, I am not able to understand the nature of peoples..as they are with you when they need you and later when they don't think you are beneficial for them they will leave you. Even your close friends and relatives don't care about you when need is over. Is that is what modern society means..."
    },
    {
        "selftext": "I have been trying for last 4 years to clear exam for job, but I can't and as the time passes frustration is getting more and more. I can't concentrate on anything anymore, memory is shot. I am seeing my colleagues progressing in their lives and earning a good amount and i am still sitting at home doing nothing. I don't even know if i will get married in future cuz for that i have to earn first and have a  permanent job.  My future looks bleak at this time. Should i leave my profession and do some other part time job? or what else? I have no idea. Advice needed!"
    },
    {
        "selftext": "Hii family  Love you all miss u all    Kya koi laughing sense k coming KR skta h.mtlb koi h jiske comnt dusri Ko has some"
    },
    {
        "selftext": "Mera koi bhi bhai,behan mujhe apna dost samjh kar kisi bhi time mujhse baat kar sakta hai"
    },
    {
        "selftext": "Friends u can talk and share ur problem to me anytime"
    },
    {
        "selftext": "Why it is very hard to follow own suggestions... totally shattered today... trying hard to control my emotions bt all in vain... today i need help"
    },
    {
        "selftext": "Am I being selfish in wanting/thinking to live separately from my partner due to issues with in-laws in the past and present? I have a 4 year old kid too. I am very confused thinking about my daughter. I am mentally very disturbed and the situation is getting worse emotionally."
    },
    {
        "selftext": "0:00  /  2:35"
    },
    {
        "selftext": "Hi everyone Just wanted everyone here to understand an ethical boundary of admin/ moderators of this group and members. You will understand that this group has a purpose_ It is to support members with Anxiety and Depression issues. The Team does the needful to suggest, support and create a safe environment for sharings and learnings here. Please understand that The Team have their personal lives too which is separate from this group. In their 'personal' profile their friends etc, like, comment etc. It will Not be appreciated if new members from here post or like on their Main profiles. THAT space is not for such interactions. Respect this and learn to create boundaries too in your own lives. This helps maintain balance in life. Everything and everyone has a place in life, that is appropriate. We hope the message is clear. Thanks for understanding and bringing conscious awareness towards your actions."
    },
    {
        "selftext": "Every day 0:00  /  0:30"
    },
    {
        "selftext": "I see a lot of people say that if my friends need me, I will be there for them. This is great! My question is: How well are you connected to your friends so that you will KNOW when they need you?  When people need, they dont necessarily ask for help. As a friend are YOU clued in enough to know if they need help? Are you calling up/ catching up with them so YOU know what is happening in their life? Build relationships_____ Starts with actions to connect and then MAINTAIN. Need ka sawal baad mein aata hain. Introspect!!!"
    },
    {
        "selftext": "Guys as I posted earlier that she's getting married and her behaviour has changed towards me. She promised me to stay friends with me even after her marriage. But I couldn't control my emotions and ruined everything. So now. I would like to have suggestions from you guys. Observe the situation and advice me.  She's not at all talking to me now. Since I've had an argument with her. Which I never ever thought of. Until knowing about her marriage. Things were going fine. I also accepted to end the relationship and just be normal friends with her after her marriage. But recently when I lost my control over my emotions and I forced to give me some answers. Like where do I go from here when I'm left alone on my path. I imagined a long way to go with her. And now I've accepted to stay just a friend. But yet I'm not ok with her marriage. And I feel like losing her and unable to do anything about it. She replied that in just a good friend who shares the college things and stuff. I don't have any deeeep connection with her. There are friends who are closer to her than me. And for one favour that I did for her when I defended her against some dogs. She wants to return the favour with any professional help but not as a friend. The reply that she gave me actually shook me and I was cursing myself for what have I done and I'm such a person who can make a good person turn into an evil. So I definitely am hurt right now. I feel responsible for the reply she gave me. And since then we have only talked purposefully. Like about the college assignments and exams. Too formally. Not friendly at all. Not our conversations have turned very dry. And there are no emotions left in them. Now would you guys tell me to give her an excuse and explain her that I went too far with emotions and I shouldn't have forced her to explain my current position in her life. And do you think that friendly emotions might return. Or do you suggest me to keep it the way it is and make no excuses never apologise for the way I had talked to her. And especially those who have gone through such relationships. And heartbreaks would know better. Answer me and suggest me as per your experience. Especially girls in here. You can tell me how would a girl feel about my next step. And how would she respond. Because I don't know, things may get better or also may go worse. So guys and girls. Suggest me my next step."
    },
    {
        "selftext": "Life is precious So enjoy every moment Stay blessed"
    },
    {
        "selftext": "Whatever and wherever you may be. If we become aware, we can ALWAYS develop better human qualities and habits. That is the best part of Being humans, we can consciously choose another Path. Share your numbers here and share what you want to develop. Penny Thomas    ·  - - 2 2   - - N - o - - - - - - - - - - - - - v e - m - b - e r   - a t - - -   - 0 - - 6 - - : - 2 - - - - - - - - - - 0    ·  Pick a man before you read!!  Which number of the 21 little people in the tree do you resonate with?  Look at the picture before reading below....[translated] This simple psycho-emotional test inspired by Pip Willson's method can reveal interesting points about you. Pip Willson is a psychologist and trainer known worldwide for the very simple method in which he manages to help people find their maximum potential and balance in life. Pip Wilson also invented the Blob Tree method. If you chose the little man 2 or 3, then you are an ambitious and confident person. You know that you will succeed all the time and that convenient situations will always come up to help you in your progress. Little man number 1 is a self-assured person, content with his life and optimistic. He is an intelligent person, the capabia should see in perspective. Little man number 21 is a person who tries, but does not know how to find the best solutions for his life. He is a little man who must learn to ask for help from those around him and to give up his suspicious nature. If you chose the little man 9, 19 or 4, it defines you as a non-social, suspicious and confident person. The number 19 man can have narcissistic inclinations and is envious of the success of others. The number 4 little man gives up too quickly, does not trust his extraordinary potential. And the number 9 little man will do anything to prove that he is wonderful too, but it is easier to keep his lonely side, because in this way he justifies his mistrust in others. Little people 7, 11, 12 characterize communicative people who know how to offer support to their friends. These people are characterized by a high emotional intelligence that helps them successfully deal with life situations. They have team spirit, they see the bright side and they find solutions all the time. The number 5 little man is creative, loves life, enjoys every moment, love and knows how to be grateful to all the good things around him. This helps him to maintain a positive outlook and so he always has open doors to all the best! The number 6 little man needs to feel loved, protected and safe. He is the kind of person who always falls in love with the wrong person, because of his unwed need for affection and love. This little man must learn to look more carefully for those who can help him in his evolution, and not those who do not understand his vulnerability. The number 13 little man is filled with despair and the loss of hope. He must do his best to recalibrate himself to the tree of life and he can easily regain confidence in himself again, seeking the support of his loved ones! The little people 16, 17 and 18 are optimistic, full of life, with team spirit, perform in any field and look at the challenges with detachment. The number 18 little man likes to feel loved and appreciated, and when he feels it, he becomes your best friend! The number 14 little man is a soul, a philanthropist, he would do anything to help others. He is characterized by a lot of empathy and a ′′ great soul \". This little man should learn to take care of himself, not just others! The 10, 15 and 20 men are winners. I love the taste of success, even if everyone has different ways to achieve it. The number 20 man is ambitious, confident and full of life, is an innovator and is not afraid to take risks. His detachment and passion bring him many achievements and satisfaction. Little man number 10 is ambitious, but also very cautious. He is hardworking and determined, that's why he is successful, pretty much anything he wants. His ideas always stand out and he is appreciated in any environment. And the number 15 little man is motivated by the beauty of the road to success rather than the success itself. He is curious to know new things, to have new experiences, to meet people and to learn something from each one. The number 8 little man is a dreamer and romantic. He likes to have some moments just to himself. This is how he regains his energy and the mood for life and socialization. It is good for the loved ones to understand their need for isolation and not to misconstrue it, to understand it and to leave the space it needs."
    },
    {
        "selftext": "Clue: Instead of 'Make friends', realize its 'BUILD Relationship'!! Introspect and think..... 1. Who would you build a relationship with? 2. What character qualities are desirable in people around you? Are you developing it in yourself? 3. What can you do from your end to build this between you and another? 4. What you expect from friends, are you doing that in the relationship as well? 5. When do you say, this is not working and Create distance? AND Can you build many at a time and choose the best ones who are reciprocating to become thick friends?  BIG YES. Enjoy building everyone. It is in your hands.  having friends Answer to these questions in the comments? Others may get clues too on how they can go about this.... Let's support like this too.... Have a wonderful day!"
    },
    {
        "selftext": "How do I effectively increase focus and concentration while also reducing stress and procrastination? Thank you for this very important question. Lately, we all are being subjected to losing focus, concentration, mental fatigue, stress, and procrastination. This all occurs for many diverse reasons, including current situation, insecurity, personal or professional issues and if these are not taken care will, they can lead to more severe challenges such as anxiety, depression and suboptimal productivity, and creativity. This also may lead to some serious metabolic problems such as obesity, hair-fall, and oxidative stress impacting skin issues. However, you will be glad to know that, this is totally reversible, in fact, you can actually improve your focus, concentration, mental clarity, and energy much more than you have normally. You can also reduce procrastination, stress, and anxiety effectively. Here is what you should consider, this is backed by a great amount of long-term research and endorsed by top mental-wellness coaches across the world, Meditation & Exercise Brain Supplement (Nootropics) Meditation which is practicing of breathing exercise along with physical exercise is found to relieve stress, normalize cortisol levels, and bring the mind to the present time, and effectively elevates focus and concentration, If you can do this routinely you can see a massive improvement in your outlook, it also helps to shape perspective where you see any issues or problems as just a challenge, and your inclination goes towards finding an effective solution over getting afraid or running away from it. Brain Nutrition is the most impactful and important factor which is responsible to increase focus, concentration, and mental energy. We should know that our body needs nutrition such as protein, carbohydrates, fats, and fibers to manage the healthy functioning of our body. Our minds also need specific supplementations such as nootropics also called brain food or cognitive enhancers, which manages optimum levels of choline, lipids, alpha brain wave production-related and are important to make great brain health, these nutrients support in improving focus, memory, energy and help to relieves oxidative stress, mental fatigue, procrastination and thus improves brain health. Some well-known nootropics for the brain are Bacopa Monnieri, Gingko Biloba, Green Tea Extract (L-Theanine), Huperzia Serrata, and Vinca Flower extracts. These nutritional dietary ingredients assist the brain to maintain healthy levels of choline, alpha brain waves, and improves neural connection. Ultra Brain from giver nutrition is one very well optimized natural nootropic which has most of the above-mentioned nutrients including other highly effective nootropic ingredients that support increased brain performance. Ultra Brain is an amazing brain supplement and in today's world of constant competition and demanding situations, it is imperative that we feed our brains with the right nutrition and keep it healthy so that we can perform our responsibilities with the highest efficiency. These are my hacks to stay concentrated, motivated, and not get drawn to stress, mental fatigue, or procrastination."
    },
    {
        "selftext": "Dying.. My depression hit me back.."
    },
    {
        "selftext": "I have seen a lot of Nigerian scammers in many health related groups promising herbal cure for almost any disease.. a kind request to everyone pls don't fall for these frauds.."
    },
    {
        "selftext": "Are u ok inside??????"
    },
    {
        "selftext": "I feel low mood from last  9 months and also consult with psychiatry but hesitate to take medicine... please help."
    },
    {
        "selftext": "I'm listening to the song : Ab koi aash na ummeed bachi ho jaise?"
    },
    {
        "selftext": "That was pretty quick and I had this coming before her wedding. Now she says \"I have my own friends. That are closer to me than you. And you are just a classmate I know. Who shares notes and assignments when necessary. You're not my childhood friend or someone special. So don't get it complex in your head. It's my wedding.\" Me. A person who always helped her when she needed. I defended her when those dogs used to bother her day by day. I stopped that for her. Now those dogs have had their revenge on me. Yet I survived that just for her. I always made her feel that she's not alone. Always told her there are good people in the college. Never feel alone and be friends with them. Maybe I just got too far with my emotions. I knew the future yet I trusted that this friendship would continue for a long time. She wasn't supposed to be my friend. And actually this is.... 7th time that I feel totally broken. Totally heart broken."
    },
    {
        "selftext": "I don't know how to overcome ,depression anxiety fear , over thinking OCD. I am totally helpess .I have many decades like ibs arthritis migrane etc. I do yoga but nothing working on me. I had taken depression medcince from 2006 to 2015 but nothing works."
    },
    {
        "selftext": "Happy birthday to the person I admire the most , my self.."
    },
    {
        "selftext": "gonna die soon"
    },
    {
        "selftext": "Where y'all saving the money!?"
    },
    {
        "selftext": "A True and a short story : Yesterday she told me, \"I'm getting married.\""
    },
    {
        "selftext": "Amazing...in destruction also if one can see beauty! That is the type of eyesight that needs to be developed. Piu Banerjee Soin    ·  3 - - - 0 - - - -   - - - - - - - - N - - - o v e - - m - - - - - b e - r   a t   0 8 - - - - - - - : - - 3 - - - 1 - - - -    ·  The tallest tree in Wales had been damaged by a storm and was supposed to be cut down ... but chainsaw artist Simon O'Rourke found a better solution to symbolise the tree's last attempt to reach the sky. https://mymodernmet.com/simon-o-rourke-chainsaw-carving.../"
    },
    {
        "selftext": ""
    },
    {
        "selftext": ""
    },
    {
        "selftext": ""
    },
    {
        "selftext": "hi,  im always scared...about any accident happend to me..and my kids..mostly worried about my kids and wife...  and other family members also...please help me...how to reduce my anxity and tesnsion...."
    },
    {
        "selftext": "Why we all are depressed!?"
    },
    {
        "selftext": "0:00  /  0:08 Panache    ·  - 2 - 9   - - - - - N - - o v e m - - b - - - e r - - - - -   a t - - -   - - 2 1 - - - - - - - - - - - - : 3 - - - - - 6    ·  You don't need to be perfect   You are AMAZING!!! #youareamazing #dontbeperfect #you #PanacheMind"
    },
    {
        "selftext": "Its Hard to live...Tired"
    },
    {
        "selftext": "मैं एंजाइटी से इतना परेशान हू! की मौत का डर लगता रहता है! कभी कभी लगता है! की सन्यास ले लू और भगवान की भक्ति करू क्योंकि एक दिन मै मर जाऊंगा! मौत का डर परेशान करता है"
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Ramya Iyenger    ·  2 - 9 - - -   - - - - - - - N o v - e m b - - - - - - - - - - - - e r - - - - -   - - - a t - -   - - - - 1 7 - - - : 5 6    ·  Today when everyone is trying to get ahead, either personally or professionally, we are being more considerate and careful of our mental health as we do for physical health. We are marching towards an era of great possibilities and greater opportunities.  However, we all might not get what we want or aspire and may have to settle for what is given to us, compared to many individuals who will get, exactly what they wish for or may do better. Now, you might be thinking these people who are getting ahead must have some extra power, qualities or are just supernaturals. Yet, it is not the real case, of course, many people have edge over many things, but it is not what gets them much ahead, what measurably distinct between mastery and mediocrity are as follows,  \"Challengers\"  These four things are the factors which differentiate every individual, we all have it in some proportions, people who have most in greater proportion are the ones who get greater things and the vice versa. It might be easy to read it, and then accept it, what is not so much easy is following it up, why do we not follow this up although we know it is the only way, \"Defenders\"  Now, we also have all of this factors embedded in us, truly, in most of us, but we choose not to accept and live in a self-made delusion as what we are doing is right and your time will come, or you are not fit for it or its not your calling or you just are not motivated, personally or socially. Hence, in the race of challengers vs defenders, it’s the challengers who always get ahead and defenders get settled. Now, what can we do to be in the club of challengers but not defenders, we stop defending our failure rather challenge them,  How do we do it? These are the 4 key that will transform you to get in the club of challengers and you will then be not settling but excelling. This would not be easy, this need not be difficult either, just follow what challengers do, as their results are the evidence of your success. This will never change, once you get the hang of it, it will then come naturally to you. While you are at it never overwhelm yourself, take time to relax your body and mind, as you supplement your body with exercise and food, you should also supplement your mind with mediation and brain food. Now, we all know about food, yet very few people who seek greatness know about brain food, yes, there is brain food, the natural ingredients which help you improve your brain performance, meaning you can improve your cognitive performance and get a real edge over the competition while you are in the club of challengers. Let me give you some numbers, 88% of c-suit executives use nootropics (a brain food) daily, while 77% of Ivy college-goers take them routinely, and only 0.04% of people in India are even aware of it.  Now, that is called limitation of knowledge which is keeping us distant from our best selves, imagine people wanting the same things as you do, and they are well equipped rather better equipped than you, considering they have a greater knowledge of the tools that they can use to out-run you, as we all know that the tools are the keys, and if you do not know about them you don’t have all the keys meaning you will open only a few locks but might just get stuck or may not have the key for next lock, which is potentially your desired or destined goal. Now, as we all live in the world of greater connectivity, it is now easier to get the keys, we are no more limited by knowledge but we need to ask the right question to get the right answers that are all that we need to do. Talking about brain food or nootropics, these are not new, it has been in use from ancient times in Ayurveda, Unani, Chines Medicines and many more, but these are lately getting more attention than ever before we all are realising that there is more to our brain than we are using right now and these ingredients will assist you to unlock that potential.  Some of the well-known nootropic ingredients are Bacopa Monnieri, Huperzia Serrata, Caffeine, L-Theanine, Gingko Biloba and Vinca Flowers. There are hundreds of nootropic ingredients available that assists in increasing your cognitive performance. These can be used by healthy individuals or individuals who are cognitively challenged as these are the highly effective and safest form of brain nutrition. To name a few well-known nootropic supplements that you can get right away are ULTRABRAIN BY GIVER NUTRITION (India), and  to improve your brain health and stay sharp while you are relentlessly working towards achieving your greater goals. Last 4 things to keep in mind, If you feel this can help many more people please like it and share it. Let’s get more challengers happening."
    },
    {
        "selftext": "Start your life from First. Never care about yesterday even passsed sec.  Stay positive and healthy    ·  2 - 9 - - -   - - - - - - - N o v - e m b - - - - - - - - - - - - e r - - - - -   - - - a t - -   - - - - 1 5 - - - : 2 8    ·  #love   #mentalhealth   #stress Start your life from First. Never care about yesterday even passsed sec. "
    },
    {
        "selftext": "I hv faced so much failure in my life... yaar success kyu nhi milti..govt exam na crack hori na IT sector mai job mil raha..kya karu..na dost hai na job hai..sirf ye meri depressed duniya..sadness does last forever"
    },
    {
        "selftext": "53 hours without sleep, 40+ hours without any human interaction. Can't even open my eyes at the moment but unable to fall asleep. What the hell is happening?"
    },
    {
        "selftext": "Anyone suffering from indigestion???.. I have Bad IBS"
    },
    {
        "selftext": "किसी के यादे के बिना जीना नामुमकिन सा है, और उसके यादो के साथ जीना खुद को तकलीफ देना है"
    },
    {
        "selftext": "Always"
    },
    {
        "selftext": "I am a woman who recently got married to my guy.. he is making me feel low.. making me regret my decision because he doesn’t seem to care for me or my emotions. I am deeply disturbed "
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Plz help me.. I don't know what to do.. m pregnant & unmarried living in Delhi..I can't tell this to my family & I don't have anyone in my life ..not even a single person with whom I can share this with.. [Past in Apr 2017 I have gone through d&c due to no heart beat of baby..(that time I was very excited about the baby & wanted to keep it also but the guy gave me wrong medicine with the help of a lady Dr.(killer)bcoz he was against it and was pressurising me for abortion]. After that incident I jst wanted a baby.. nothing else..I don't know from where..with whom ..I jst wanted a baby all time..My situation was like ..m asking anyone irrespective of who he is or whatever he is to give me a baby..I was jst behaving madly. Then after one & half year someone came in my life and I got attached to him from the very beginning (maybe bcoz of my condition) at that time.I love & respect him from beginning ..he also treated me good.But he cleared at starting only..that he can't marry me.. I only always wanted him to come closer to me(like only for pampering purpose.. hugging, kissing jst)..but at that time we always met at some public places..One day I don't know how I got little far from that pampering part..& he too. But that was ok..bcoz there was no chance of anything else than that(which I was not aware of). One day he told me to meet at metro and took me to a place which I was not aware of anything).He took me to his new house which he has recently shifted.But I didn't feel good about it..bcoz he didn't informed me before. But that day nothing happened only cuddling.After that he stopped meeting me at any public place.So always I have to go to his house which was far away (1.5 hrs) from my place..We met there 3-4 times..but nothing like that happened..but after that all happened & even in bed also before doing that he told me that he can't marry me. After that we meet once every month or in 2 moths. But this time..we met after 8 months and I got pregnant now.He is also not financially stable bcoz he also do nothing..he is jst preparing for government exams. I am also not at all financially stable.. I do nothing at all.All day I jst sleep..even I am unable to do my regular personal chores (like taking bath, brushing teeth, eating).I don't know why m jst so mentally sick.. Looking for your valuable suggestions.."
    },
    {
        "selftext": "I am preparing for competitive examination but whenever I tried to study, I tend to start overthinking about past events, sometimes I mix it up with my own imagination and thinking about alternate outcome. I don't know how to overcome this"
    },
    {
        "selftext": "Even if 20% of the people showing support in comments, were as supportive in DMs, this group would be a bit happier place."
    },
    {
        "selftext": "We think our pain is too much. But trust me, the people who are battling with physical pain (in hospitals) and are on the line of death and life, knows what they are going through. We should cherish if we don’t have physical pain and our body is healthy.  Still being a human we do feel depressed. So for that... I am always here (we all are actually) if you ever need somebody to talk to. Am here if you need somebody to listen to or discuss to.  Please just don’t hurt yourself mentally. Hit me up anytime. "
    },
    {
        "selftext": "So I pushed my bed a little n boom my chest n arms starting hurting so bad.. my heart felt as if it was crushed badly... I am at that stage where I can’t even move from bed widout pain.. I am just 21 n suffer from these physical issues.. even those who have heart failure can walk n run n live normal lives n me whose echo was normal can’t... Dont know what tests to do... I don’t even have anymore money to spend on doctors.. I"
    },
    {
        "selftext": ""
    },
    {
        "selftext": "0:00  /  7:12 Janhit Mein Jaari    ·  5   - N - - - - o v e - - - - - m - - - - - - b - - - - - e - r    ·  How To Move On From A Break-Up  Name A Friend That Needs To Move On From Break-up"
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Yes, there comes a point. I've come to that point long ago and now I've moved even further. Now I choose to exclude myself from things. Like, even if you invite me to a party or a function, I won't show up. It's not that I'm not happy for you, I am, as much as you are but my social anxiety doesn't allow me to show up in gatherings even if my heart wants to. No, I don't feel bad for being left out in case you forgot me. Nothing is going to change between us, my intentions will always be pure, I'll never hold any grudges. Deep down, I'm happy and thankful to you because that saved me from making an unwanted excuse I would have to make because I wouldn't have showed up anyway. But you know, I was not always like that, I don't remember what changed me. No no, I don't remember getting hurt or being let down that resulted into this change. I guess this came all by itself and I welcomed it whole heartedly because I've realised that It provides me with mental peace and that my friend, is my first priority at this point of life."
    },
    {
        "selftext": "I'm so hollow from inside and numb outside. I don't know what's going on, I don't feel anything, not a single thing crosses my mind. I don't know when the day begins and when it ends. What's happening? What's wrong with me? Anyone else going through the same?"
    },
    {
        "selftext": "I've become so numb nowadays. I just wake up, go to work, come back and sleep. No human interaction, no feelings, no willingness to do anything but deep down I'm getting restless and want to break the monotony. I've lost people I trusted and pushed others away because I was afraid that they'll leave me soon. Now I feel like I should talk to someone but I don't have anyone to talk to. I know I can talk to my parents but I don't want to bother them, I don't want them to worry about me. What should I do? I'm so lost and confused."
    },
    {
        "selftext": "Beware of the Fraudsters..!!"
    },
    {
        "selftext": "Hello guys . Hope u all are doing great  . Aaj se mene phisiotheray shuru kiya and doctor bol rahe hai that this will help me alot. Each step that i am taking is pushing me towards my goals and i am feeling really great . Next 6 months me complete transformation ho jaaega mera, upper se braces   and chashma  bhi nikal jaaenge , I can't wait to see myself like this   in sha allah I will be more confident and  stronger in upcoming days ."
    },
    {
        "selftext": "What kind of jobs you people do it's difficult to concentrate??"
    },
    {
        "selftext": "I'm holding on, why is everything so heavy?"
    },
    {
        "selftext": "How do I make friends?  Hello guys, I have terrible social anxiety and I used to have only one/two frnds at max in school/clg. After school/clg I have lost touch with them due to them moving out to other cities for studies. They are extroverted and have made new frnds now they don't even want to meet me when they home back to town for holidays. I don't have any frnds except them. I always had small group of frnds & all of them are frm school and clg. I don't have frnds out of my clg & school. Coming to making friendship with cousins , they are all elder than me & they are very mature than me. Relatives were not around when I was growing up (I mean they were far from my hometown) now if I want to start a conversation ,suddenly it feels like they're strangers. And one more thing is that I don't even know what to talk with them except hello, hw r u ? (Basic stuff) I can't hold conversation longer. I'm boring for them. My parents are worried that I don't have good bond with relatives. I feel so immature. I don't know how to fix it. I'm very lonely. So my social skills are non-existant. I live in a rural area so having good relationship with relatives is very much mandatory.  (Sry if there are any grammatical errors)"
    },
    {
        "selftext": "Hii family    How are you all . today I wanna tell you my story I came here in May with mrne ki soch nd bhot jyda panic attack hote the m past m thi jo 7sal phle ki bate thi.vo meri liye Aaj tha.aur aj mei to m thi  nahi.m jinda thi lkin dusro ki njr m.but now I'm completely out of past ,nd baki SB b 90%bilkul thik hu.ha ye SB ki vjh Abhimanyu sir Pooja nd apsb h jinhone mujhe family Jese treat Kiya jb meri khud ki family mere saath nahi thi.so I call u family    Ye post h unke k liye Jo aj us halat m h Jha Mai thi .  Ummid krti hu meri ye post meri family k Kam jroor aayegi.love u all "
    },
    {
        "selftext": "Plz help me.. I don't know what to do.. m pregnant & unmarried living in Delhi..I can't tell this to my family & I don't have anyone in my life ..not even a single person with whom I can share this with.. [Past in Apr 2017 I have gone through d&c due to no heart beat of baby..(that time I was very excited about the baby & wanted to keep it also but the guy gave me wrong medicine with the help of a lady Dr.(killer)bcoz he was against it and was pressurising me for abortion]. After that incident I jst wanted a baby.. nothing else..I don't know from where..with whom ..I jst wanted a baby all time..My situation was like ..m asking anyone irrespective of who he is or whatever he is to give me a baby..I was jst behaving madly. The guy is not financially stable bcoz he do nothing..he is jst preparing for government exams. I am also not at all financially stable.. I do nothing at all.All day I jst sleep..even I am unable to do my regular personal chores (like taking bath, brushing teeth, eating).I don't know why m jst so mentally sick..I don't even want to go out of the house or my room. Plz help me with the pregnancy issue.I don't want to suffer that pain again..plz save me.M at my 3rd week. Looking for your valuable suggestions.."
    },
    {
        "selftext": "Happy birthday to a person that’s charming, talented, and witty, and reminds me a lot of myself. Happy birthday. God bless you"
    },
    {
        "selftext": "Hello friends ! One of our members  Shraddha S  lost her mother   Please keep her in your prayers   May gif give her enough strength!"
    },
    {
        "selftext": "Always "
    },
    {
        "selftext": ""
    },
    {
        "selftext": "friends while studying i get too much confusion , i am not able to decide in what way i would approach the question. i think whole the day about this and come to no solution.i am not able to concentrate on my studies due to this. confusions are escalating day by day. i am taking depressing pills fluxotine 20 mg and qutipin 25 mg. is this a ocd??"
    },
    {
        "selftext": ""
    },
    {
        "selftext": "I have a problem that i get into a relationship, then get bored with it and repent later why i did this. Any advice ?"
    },
    {
        "selftext": "What is your take on spirituality￼?  Do you guys go to places of worship.. 6 years back I had a lot of faith whenever I would face any little problem I would still go to the nearby temple and pray there and before every important event I would pray because I had this faith that God has the power to heal each and every problem of mine. If I will pray then the problem will go away ￼ but as I grew  I understood that that was all a false notion  God is not going to solve any problem and if it’s written in your destiny that you have to suffer then you have to suffer no matter how many places of worship you go and how many times you pray￼.. The people suffering from cancer and other very severe illnesses someone has lost his loved ones and many people who are in an unfair situation they all must also be praying daily but the problems are not getting solved because it’s decided that they will have to suffer from that so nothing is going to change that￼￼"
    },
    {
        "selftext": "Suggest me some Netflix series (sci-fi, adventure, fantasy, mystery, comedy), feeling bored."
    },
    {
        "selftext": "Hi frds, does anyone felt adhd symptoms like no focus in anything that causes work and life issues.."
    },
    {
        "selftext": "Hi all Just letting everyone know that this group is to Share your issues. Its a learning just by reading the responses that the person posting receives....Make use of that and apply it to your life!  There are people here who are truly opening up their life and struggles with their issues. That warranties help and gets help! And on their part their courage is so commendable. If you are not willing to express here in a group where all are going thru similar symptoms/problems, then where? If courage is missing, then it will be difficult to change things too right! Open here, share here, talk here. Admins are lovely people and holding the space very effectively. Have a great day."
    },
    {
        "selftext": "Anyone suffering from facial twitches and muscle twitches all over ?"
    },
    {
        "selftext": "How to overcome constant failures in your exams? I am sick of this."
    },
    {
        "selftext": "I cant breath  ..terrible  night"
    },
    {
        "selftext": ""
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Aaj phir himmat kyun kamzor par rhi h Itna ladne k baad aaj phir aisa kyun lag rha h jaise zindagi se saath chutne ko hi h Feeling very bad Very tensed Larr larr k thak gye Pata nhi iss raat ka koi savera h bhi ki nhin "
    },
    {
        "selftext": "Overthinking kills happiness"
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Iam failed infront of 5 years small students than me,it downs me"
    },
    {
        "selftext": "Hii... I hve been doing govt job.. Since age of 20 ...my father died when i was  very small.. I m single child, hve done lots of struggle...i sacrificed my higher  studies(M. Sc)..which ws one of my dream....that tym Only one thing ws rolling in my mind ...it's my duty to do job fr my family fr my mom...luckily, I cracked the exam in my first attempt..  I couldn't think about my self alwys i think about my mom first...but my mom alwys says wht hve i done fr her... Nothing... All of my relatives expects lots frm me , monetary supports ... If i can't fullfill they feel angry...they r not emotionally connected... They  r not ready to understand what is my situation....feeling so much depressed... Lots of tym i thought abt sucide only i couldn't  do becz of  my mom... I kw she won't admit wht i hve done.. But if i will leave her there is no one .... Only fr dat i couldn't..."
    },
    {
        "selftext": "Has anyone here lost the fear of dying at all? I'm not suicidal but I'm not afraid of death either."
    },
    {
        "selftext": "Batch topper and an excellent shooter police officer who asked for a lift and deputy SP found that the beggar is his batch mate. Mental illness is not selective but a love and care is always proven best antidepressants"
    },
    {
        "selftext": "A N D.....    THOUGHTS WENT LIKE"
    },
    {
        "selftext": "I have severe anxiety of dying from heart attack or cardiac arrest..i think as if my heart is tired n struggling to beat and it will stop anytime..i cant sleep coz of this fear.. my rhtym feels weird n its as if heart cant beat more.. what to do guys?? Every second is like time bomb n I have other symptoms related to heart too"
    },
    {
        "selftext": "Happy Bday  Pooja  !! "
    },
    {
        "selftext": "Let's welcome our new members: Ravi S , Sagar Thorat , Tathagata Paul , Vishal Sawant , Ak Sh , Saiteja K , Himanshu Goswami Goswami, Andy Ahuja , Hemraj Khushboo , Viral Shah , Navin Jethva , Omkar Singh , Ashish Gupta , Md Danial Hossain , Shakira Pprabowo , Sagar Kapadiya , Suhana Thappa , Tf W Jui , Sakshi Sharma , Kapil Mavi , Ritika Singh , Swati Ojha , Vineet Kumar , Manvinder Madaan , Neeharika Jaiswal , Arnab Kr , Aarti Reddy , Girish Bhatia , Lium Ete , Mehab Q , Abdul Abdala, Mimi Guha , Prince Aashiq Ashu , Shakti Yoga , Biswajit Kisku, Kunjan Singh , Rahul Makhija , Khilan Mistry , Mital Rana , Mohit Singh Choudhary , Thankam S Nair , Vinit Sagar , Tejan Gupta , Rohan Sharma, Sameera Khan"
    },
    {
        "selftext": "When close ones hurt the most, then home feels barren and filled with hate. Then work suddenly becomes one's priority. Yet people think that it means that I can't fight. Well I fought, probably the wrong way, and now I'm numbed by failure and the storm brewing in my future."
    },
    {
        "selftext": "Hate to admit but I am struggling mentally and need support but what makes me more sad is that I don't have anyone to admit this to."
    },
    {
        "selftext": "Anyone dealing with physical symptoms like dizziness, nausea, fatigue, haziness, shortness of breath, heart palpitations wtc ... every other day theres a new symptom or change in old ones n its so real that no matter how much I try I cant dismiss it as product of my anxiety.... Doctors u know r not bothered much....when patient is a young female all her symptoms wud be attributed to mental stress Anyone who dealt wid it/ deals?"
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Sometimes we think a lot...."
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Few month back i had verbal argument with someone since then i m in constant fear and anxiety ....i m fearing person will harm me"
    },
    {
        "selftext": "When people do shitty things but don't take responsibility for that, and judge me for my faults, how am I supposed to let go of that and forgive? Especially when it's ones own family. They don't practice what they preach and expect me to do all the understanding"
    },
    {
        "selftext": "Admin plz kick this guy out from grup These perverts just need some chance to get into dms and show dere cheapness  Girls beware of these frauds"
    },
    {
        "selftext": "Hi guys I just want to share my story here. It will be long so please bear with me. Thank you.. I am married to Hindu, vegetarian, Indian man and living with his family for more than three years now. I am a Catholic, non vegetarian, foreigner. I got good career in Philippines, an achiever and somehow a bread winner of the family that time. I am pretty independent and dominant. I married him because I love him and he promised me 1. He will respect me 2. He will love me for who I am. 3. He will support me for whatever I wanted to do. 4.he wont change me. I married him even if my parents were against as they don't want me to be faraway from them. You know India's reputation towards treating its women. Wives are expected to be submissive, stay at home, respect and obey husband and inlaws and take care of them. I have many struggles here: 1. Culture is very overwhelming. I was told to wear their clothes, behave like them, and serve the family. 2. I cannot eat non veg at home. The \"support\" I get from my husband is him buying non veg from outside and I am eating it secretly in our room like some crime. 3. I feel my elder sis in law (wife of husbands older bro) wants me to do housework like her. Which I did for first 2 years. 4. I PRETEND it is ok for me to do their religious ritual where in fact I hate doing it. It is against my belief. We worship snake, monkey, cow dung etc. 5. I always feel alone. Having diff language, I have difficulty communicating with people. 6. I became powerless. I cannot even roam outside alone. 7. They have lottttt of days not allowed to eat non veg.. Lotttt of religious holidays it is killing me. 8. I am introvert, they are extrovert. One time I was forced to dance in front of crowd, I felt so embarrassed that I cried. 9. In my country, we believe in leave and cleave. But here, my husband wants us to live in their joint family. I dont have that opportunity to be happy designing my own place, using my own things. Everything is shared. They can even enter our bedroom anytime they want. 10. They wont tell me their plans then later on rush me to get ready to attend something and blame me for being late. Etc... With these things, it makes me crazy, deeply unhappy. until now I do not want to bear a child in this environment. I do not have people to talk to as I am embarrassed on what I have become. I cry alot in my room but smile a lot when meeting them. I do not know if I am depressed. I feel suffocated secretly and my chest feels heavy all the time. I gained so much weight as I eat a lot whenever I get chance to eat non veg. I lost confidence. I just like to sleep all day  What to do? AM I DEPRESSED? To be continued..."
    },
    {
        "selftext": "Has jealousy ever driven you to \"improve yourself\" instead of making you more depressed/anxious?"
    },
    {
        "selftext": "Found this post quite amazing... When we are mentally stuck at a place, these are some things one can look out for and see if they are happening in your life. If they are not, then How can you Create these in your life....? ...because Freedom from being Stuck where you are, comes from Developing these... Have a great day!"
    },
    {
        "selftext": "Admins... plz in logo ko allow mat karo... Do something.... Put some questionarie before allowing/joining members"
    },
    {
        "selftext": "Let's welcome our new members: Suraj Sharma, Nikhil Jain , Anushka Sharma , Vaibhav Kumar , K Ankit , Manoj Kumar Khatana , Ashish Pithadia , Shaheb Shyam , Ashith AB , Sachin Kodag , Irfan Ahmed , Surya Shashank Sekhar H , Masih Avinash , Sara Kumari , Divya Joshi , Minni Ahuja , Vicky Max , Sandeep Bhatnagar , Yash K Pandit , Pampa Prakash , Shilpi Matani , Sonu Yadav , Bandhan Jha , Chetan W Bhalerao , Omkar Salvi , Piyus Kumar , Ravi Mehta , Ira Singh , Ydv Neha , Addy Teddy , Sai Sankar , Saloni Mehta , Abhishek Pontem, Roma Khare Das , Originof Yog , Geetesh Udania , Muhammad Asim , મન મોજી , Mushtaq Ahmad , Suraj Ramu , Moman Sethi , Sumantha Rathore , Shoaib Malik , Ankila Joshi, Kashyap , Sampradhana Charitable Trust , Abdul Rahman , Suvidha Mehta"
    },
    {
        "selftext": "hi frnds  im havng anxiety frm.past 2 yr i hav seen many up and down but i feel very sad whn i get mad on my parents and being irritable for no big reasons and after that i found myself guilty for shouting on them  i dnt knw  if this happns to me only or is it common ... plzzzz hlpp me guys "
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Really No Help... Really No one there.. crying"
    },
    {
        "selftext": "Something I just don't understand. Showing emotions is bad or not showing is bad? I mean, I may be angry but if I choose to control my anger I'm still being made to feel guilty for feeling angry??? So should I be a robot and do things according to my husband? And when I ask him this question he says that I am just blaming him for my problems! This is so confusing"
    },
    {
        "selftext": "I am having shortness of breath since yesterday morning continuously and couldn't sleep whole night . Can anxisty cause this ? So afraid"
    },
    {
        "selftext": "I did work but result bothers me"
    },
    {
        "selftext": "Hyyy guys hope everyone is doing good. I just had a weird idea. Many of us might play cod so let's play it together it would be fun. Dm me Or comment who all are interested"
    },
    {
        "selftext": "How recover from my symptoms? Dizziness Off balance Anxiety Negative thinking Ear problems Head ache Always having anxiety attack... Pls give me solutions from life style,diet,what ever.... Pls help me..."
    },
    {
        "selftext": "Need some friends to talk"
    },
    {
        "selftext": "Family     Mujhe kisi kisi vkt Aisa lagta। hjese nvj hmare hand  m pulping krti। hvese pair  ungliyo। mhand। kiungliyo। mhoti feel Hoti fudkti.kya kisi Ko maloom h kyo hota h Aisa .mujhe ghbraht Hoti h isse . Nd second think m kisi vkt lgta h aage kya bolna h bhul jati hu bate apke sath hota h Bolte Bolte ?prso hua mere saath Nd third one mujhe hr vkt chkr se aate h.alpazolam dva layi hu m bhi jb jyda lgta h half goli leti hu.smjh nhi aata fir b ku hota h.please tell m"
    },
    {
        "selftext": ""
    },
    {
        "selftext": "I wish we had a reset or restore button."
    },
    {
        "selftext": ""
    }
]