[
    {
        "selftext": "Read this"
    },
    {
        "selftext": "Thanks for letting me in. I have OCD, social anxiety and depression. I am from Lucknow."
    },
    {
        "selftext": "Guys I have a condition called dermatilomania along with Ocd.. Aur iski wajah se mujhe antidepressants k sath sath clonazepam. 05 mg khana padta h per day... Kyuki ye ek skin picking Ki problem h... Jisme mujhe bina clonazepam k rahat nhi milti h.. Lekin in dawao k sath mujhe memories problem baht hoti h yaha tak ki koi lines padhne mein aur samjhne mein bhi taqleef aati h sometimes.. ... . Ocd toh h he sath mein taqleef dene k liye....  But clonazepam se I think memories problem aa rhi h mujhe.... What's ur opinion about this?"
    },
    {
        "selftext": "Don't let others' opinions or judgments about your mental disorder pull you down. Either they may not understand or they may not want to. Either way, it is their choice. You can battle it out with or without their support. That is your choice. Choose wisely.  ------------------------------"
    },
    {
        "selftext": "A parents’ intentions are always harmless and that can’t be questioned. But they may be doing some things without realizing the ill effects it may have on their child. And drawing comparisons between the younger and elder siblings is the most common mistake parents make. Read our latest blog on how comparisons can severely affect your child's mental health. #comparisons   #siblingcomparison   #siblingrivalry   #anxiety   #depression   #lowselfesteem   #lowselfconfidence   #parentingmistakes   #mentalhealth   #mentalhealthawareness   #mentalwellness wetrainbrains.com Parents, This Habit Of Yours May Be Ruining Your Child's Mental Health Comparing your child to his/her older sibling might be affecting them deeply. You need to stop doing this before it's too late."
    },
    {
        "selftext": "Do you feel threatened when your partner compliments another person or gets a lot of attention? Do you feel left out and nervous during social gatherings? Do you feel low on self-confidence and esteem? Are you always second-guessing yourself? Do you feel like you're going to screw up something even before taking it on? Are you extremely critical of yourself? Do you feel uncomfortable when loved as you feel you don't deserve it? Do you feel guilty, ugly, and like a failure? These are all signs that you as a person, are insecure. So the big question is- why do we feel this way? Read our latest blog and ways to overcome the feeling of insecurity. #insecurity   #signsofinsecurity   #insecure   #symptomsofinsecurity   #howtoovercomeinsecurity   #insecurityissues wetrainbrains.com Why Do I Feel So Insecure And How Can I Overcome It? There are a lot of factors that could make you feel insecure. We look at these in detail, and how you can deal with insecurity."
    },
    {
        "selftext": "In my profession, I often come across people who have some common fears such as fear of illnesses such as AIDS, cancer, and other fears like rejection, failure, commitment, and in recent times- fear of Covid 19. But this was one of those rare cases where the fear was so extreme that I was challenged to my limits on how to tackle and eradicate it. Read my experience with this client here. #fear   #fearofillness   #fearofillhealth   #fearofaids   #paranoia   #hypochondria   #mentalhealth   #mentalwellness   #mentalhealthawareness   #covid19   #pandemic   #coronavirus wetrainbrains.com Client Story 2: A Man Who Lived With The Crippling Fear Of Getting AIDS This client was poked by a sharp object once and feared that it may have been contaminated by the HIV virus that could give him AIDS."
    },
    {
        "selftext": "Everyone knows of common addictions such as that to alcohol, drugs, gaming etc. But did you know that people could be addicted to plastic surgeries, or hoarding? Today, we look at some unusual addictions that you probably didn't know of. Watch video! https://wetrainbrains.com/ #addiction   #typesofaddictions   #unusuaaddictions   #mentalhealth   #mentalhealthawareness   #mentalwellness   #neurofeedback   #braintraining 0:00  /  1:25 Brain & Co.    ·  3 0 - - -   - N o - - - v - - - - - - - - - e - - - - m b e - - - r - -   - a - - - t - - -   - - 1 - - 9 : - - 0 0 - - -    ·  Everyone knows of common addictions such as that to alcohol, drugs, gaming etc. But did you know that people could be addicted to plastic surgeries, or hoarding?  Today, we look at some unusual addictions that you probably didn't know of. Watch video!  https://wetrainbrains.com/ #addiction   #typesofaddictions   #unusuaaddictions   #mentalhealth   #mentalhealthawareness   #mentalwellness   #neurofeedback   #braintraining"
    },
    {
        "selftext": "People who ocd and people without it have worries that develop into habits. Then after sometime maybe months or years they will know that what they used to worry was useless. When one worry goes another worry may come out in normal people. In ocd we have irrational thought that feel like real we should have purpose in life and give less importance to ocd or there may be a time come how irrational they were. Ocd is disorder you can only conquer it by will power by stopping compulsions. In ocd people you should do of reverse doing compulsions and procastinating work. When you have overcome by stopping your behaviour  will have improved life. To live you have understand your repititive thoughts and fear. If you have freedom from tension your will be tasteless because you had not tasted tough times"
    },
    {
        "selftext": "Unlock your mind- Support for OCD, anxiety & mental health    ·  5   D - e - - - c - - - - - - e - m - - - - b e - - - r   - - a - - - - t -   - 0 - - - - - 9 - - : - - 4 7 - - - - -    ·  Our Thoughts, feelings , moods and the state we are in, impact our interpretation of others' behavior! The behavior of the other, which is lot less likely to cause disappointment, anxiety, anger, frustration when we are are in a good state, can magnify the same feelings  at another time due to our pre-existing thoughts, feelings and moods about something else.  Since thoughts and feelings are fleeting, inferring others' behavior at a time which is not amiable to do it and worse still, responding to the person at that time, can be damaging to the relationship.  Working on not attaching meaning to unhealthy thoughts and feelings calls for being mindful. It is one thing that comes out of regular practice through both formal and informal ways and upping the skill. But not responding and inferring others' responses from within the framework of our influenced state, is still in our locus of control.  This understanding serves the person who is acting based on his thoughts as well as the person on the receiving end of that response. A behavior displayed at a time when the person is not in good state is not the authentic behavior of the person. Generalizing the behavior of the person and taking it personally will water down all the pleasant experiences for which you have positive regard and may cherish. Stay mindful ! For Tips on Emotional wellness, Mental Health and wholesome Living, follow: भावनात्मक कल्याण, परिपूर्ण जीवन और मानसिक स्वास्थ्य पर पोस्ट के लिए फेसबुक और इंस्टाग्राम पर फॉलो करें। : Facebook:  https://www.facebook.com/unlockyourmindcounselingservice Instagram : https://www.instagram.com/unlockyourmindcounselling Twitter:  https://twitter.com/uymcounseling"
    },
    {
        "selftext": "Thank you for adding me "
    },
    {
        "selftext": "Denxiety    ·  5   D - e - - - c - - - - - - e - m - - - - b e - - - r   - - a - - - - t -   - 0 - - - - - 0 - - : - - 1 2 - - - - -    ·  How to increase your understanding? To increase our understanding, we have to look at every problem as it is. Suppose an incident happened to you, then one thing is that you think that this incident has happened because of this. The second is the real reason, there is a lot of difference between what seems to you and what is real. As if you look at your problem, one thing is that you think it is because of this, the other is its real reason. For the complete solution to anything, we have to go to its root. in short, to increase your understanding, you will have to see every problem with your Sight rather than your perspective. From the perspective here, it means your past conditioning. Would you like to Join me to Increase your understanding for free  ?"
    },
    {
        "selftext": "How to stop intrusive thought in 8years old kid? He is aware of these thoughts and tell me he cannot ignore it, any good ocd specialist in mumbai?"
    },
    {
        "selftext": "Denxiety    ·  - 4   - - - - D - - - - - - e - c - - - e - - m - - - b - e - - - - r   - - a t   - - - 0 - - 1 - - - - - - : 0 4 -    ·  Change your habit to change your life  Whatever we are today, our habits are reason of whatever condition we are in. So we have to change our habits to change ourselves. We have difficulty in leaving any habit, it takes effort. Because that Habit has placed in our subconcious mind. In fact, our habits are the patterns that we automatically do. That's why we have trouble in changing the habit. we have to change our habits because we knowingly or unconsciously have caught the wrong habit. And when we try to change this habit, we fail again and again, but no matter what, we should always follow the right path. If something is wrong, it should be discarded. our mind always runs towards the comfort zone. Our thoughts have contributed a lot in forming these habits, our body does not know which habits are good and which are bad. In the end, I will just say that to change your life to change your habits.  Join me for free to overcome mental problems :"
    },
    {
        "selftext": "https://www.youtube.com/watch?v=0BO-NW4u6r8 youtube.com भारत में जल्द आएगी कोरोना वैक्सीन, मिल गई मंजूरी || #CoronaVirus#Ram_Gopal_Varma#COVAXIN_Phase_3_Trials_in_India# #CoronavirusIndiaUpdate #Covid19NewsUpdate#DainikJagran#Pfizer_BioNTech#Britai#CoronaVirus#Ram_..."
    },
    {
        "selftext": "https://www.facebook.com/104586584837876/posts/106592781303923/?d=n Brain & Mind    ·  3   D - - - e c - - e - m - b - - e r - -   - a - - - - t - - -   1 - - - 2 - - - - : - - - - - 1 - - - - - - - 1 -    ·  #itsoktonotbeok   #mentalhealth   #mentalhealthmatters   #mentalhealthawareness   #mentalhealthsupport   #mentalhealthrecovery   #mentalhealthadvocate   #mentalhealthprofessional"
    },
    {
        "selftext": "I have started going to a Yoga Classes in evening, Kyuki join karn ka to pichle janam se mann tha, lekin subah uthne me asafal rhe. Isliye finally ek evening ka batch mila. Aur mene start kar diya.  Bata nhi skta, ki us class k dauran me kitta consciously active rehta hu, aur kitna Zinda Dil feel karta hu. Jaise zindagi me isse jyada aur kuch important hai hi nhi mere liye. Because, Paiso k liye, doosro k liye, aur manoranjan k liye to hum bahut kuch krte h. Par apni health k liye bahut kum time dete h, aur bahut kum effort dete h. Mene bhi bethte bethe problem k baare me baat krte hue bahut time barbaad kiya h. Par finally ek solution mila h, jisse ki me bethe bethe health ko improve bhi kar pa rha hu. I recommend all of you to please start practicing yoga and meditation immediately. Or any other exercise or sports you like, but on a daily basis, and if possible under some guidance or mentor."
    },
    {
        "selftext": "A Day on the banks of Narmada River 0:00  /  0:40"
    },
    {
        "selftext": "A  poem, a mirror to the inner dialogue  from a Friend.  An uplifting letter to self with a touch of compassion. We often lend a shoulder to our buddies. Can we be our own buddy !  Dedicated to all those who need to see this today.  Thank you Mangesh Cheke for penning these lines."
    },
    {
        "selftext": "I started searching on quora about bad karma done in past. They said it can be only forgived by God only by repenting for sins in bhagvad Gita. They said heaven is not permanent destination for soul vaikuntha is permanent abode of soul. This   can be only by following spiritual path. You have to go Himalaya to get moksha. But I repent so much like I killed ants or mosquito I searched on Google for it is a sin. Then I stop killing them. In google I searched about guru nanak his quotes says that are moksha is predestined by God. Then I became stressed. Somehow I have to get moksha but it was difficult to follow somehow the path of Hinduism. Then I searched in about Christianity that in it was written believed in god he will get u salvation or if u don't Satan will take your soul. Then I find Christianity little easier path then Hinduism. Then I started having abusive thought about Jesus, I google started to search on bible, how will Jesus forgive then in one verses it was written God knows your thoughts whomsoever have blasphemous thought he will not get forgived tortured by eternals.                                  I think about God Ganesh that he is fat then I searched will he forgive me and I called god Krishna black in my mind it is sin. I said sorry to god a verse given in google by swami Vivekananda guru Rama Krishna prahamnsa I repeat it my mind. Then after sometime I thought another way to say sorry then i said \"I am sorry god I am also a human please forgive me I am sorry from the bottom of my heart\". At start when I had thought about abusing Krishna I changed it in my mind saying it Krishna(name of my college mate). I watched marvel movie Thor I abused him then I thought to say sorry to him by searching Norse mythology. I searched Vedas, upanishads, purana and many Hindu scriptures I thought that most books I read the more I will shift toward getting moksha. In bhagvad puran it was written until 14 a child bad karma doesn't count this gave me relief. Then I thoughts what of after 14 years age karma how to repent on it. Follow spiritual path and I see Sandeep maheswari video he says to follow spiritual path.                               Then my mind want to know the power of God how much power he has so I see NASA video it shows universe with billions Galaxy and dark matter nobody can't see what is in dark matter. So I just become on this and watch YouTube Hindi universe. I searched about how many temples are there of India. There are 12 Shiva ,51 Shakti temple,106 Vishnu temples. Most temples are there in Tamil Nadu around 4000 . I want to see sai  baba tv serial episode and Radha Krishna episode as well. In vaishnavism there is highest aspect mahavishnu and for Shiva is parashiva are formless parabrahman. Then I become feeling low about my caste as I am Sindhi not a Brahmin Brahmin can easily get salvation. For Hindu there is Hindu God's for moksha and Christian there is Jesus and for Muslims there is Allah . But I found myself a Sindhi whom to follow as there is caste discrimination. In kaliyuga it is difficult to get moksha.                          I showed to psychiatrist he said I have ocd and given my medicine but still I am searching for moksha. Now I considered these thoughts silly and irrational fear by ocd. I hadn't tell my family about these thoughts because of shame and they will not understand ocd. These were bullshit thoughts that I feared. People suffered from ocd may won't normal life but normal people have thoughts popping in their mind but quite rational they are."
    },
    {
        "selftext": "OCD and Anger/Rage with J onathan Grayson  and Liz McIngvale  International OCD Foundation https://fb.watch/27wxqXFv05/ 0:00  /  1:02:41 International OCD Foundation  was live.    ·  2 - -   D - - - - - - - - - e - c - - e - - - - - m - b - e - - - r -   a - - - t -   2 - - - - - - - - 2 - : - - 3 0    ·  Dr. Elizabeth McIngvale with special guest speaker Dr. Jonathan Grayson will be discussing OCD and anger and rage. Watch live on Wednesday, December 2nd at 12pm ET."
    },
    {
        "selftext": "Hello everyone! I am Dr. Neeharika Jaiswal, a Consultant Psychiatrist.  I have started a page - Brain & Mind. This page is dedicated to spreading mental health awareness, changing attitudes toward mental health & breaking free from stigma. Let’s prioritize & make mental health a part of our daily routine!    I am available for online consultations. Please DM to set up an appointment if you need it.  I am also open to answering queries so please drop a message if you have any.  Through this page, I am hoping to make a difference - one step at a time.  Please visit & follow for mental health related content: https://www.facebook.com/Brain-Mind-104586584837876/?view_public_for=104586584837876 Brain & Mind ﻿ Mental health service Like"
    },
    {
        "selftext": "How I've overcame my OCD completely and learned why I got it in the first place. youtube.com The Greatest Trick the Devil Has Ever Pulled The video about the voice in your head.Special thanks to Honza Novák for walking backwards for 20 minutes straight, especially walking backwards on pedestria..."
    },
    {
        "selftext": "I have doubt that some people says  ocd therapist are not well trained in India. They are suffering 10-12 years but nothing works. But as I see nimhans the best hospital in India is rank around 4000 in world mental health. People are trying everything but nothing happens. They say world best ocd expert are there in USA. So what should I do ,how can I talk to Americans about Indian deities and they will not understand. I have ocd more than 2 years my religious ocd is not stopping. My believe on therapist is going down as many ocd affected  say Indian psychologist are not good. Then how to treat ocd. How to have belief on Indian therapist back again and do therapy. Please help and tell your views"
    },
    {
        "selftext": "Have anyone tried DBS for OCD?"
    },
    {
        "selftext": "My life have become living hell. I had ocd from 2018 about religion. I just completed class 12 in 2018 in April I have listened from my mother about karma(deeds). Now I thought I have beaten my brother and friend so I would create karma(sin). When I playing cricket in home I hit bat to my mother by mistake. Then I searched in that childhood bad deeds or fight are sin. They said about bhagvad Gita that  soul transfer from 84 lakhs births to get a human body. Then there was written that God punish people for their bad karma(sin) and made animal in next birth. Then I become overthinker about sin. I started google thing on quora and speaking tree. It says karma will be there always for sure. In speaking tree is was written one who read bhagvad Gita and shiv puran 4 times he will be free from birth and death cylce. So I wanted to read that. If I hurt a ant I start google that I create a sin. Then my mind become feared from my childhood deeds that I have done God will make animal next birth. Then in September 2018 I had a panic attack. I was in college 1 year my thoughts about abusing god or sexual thoughts come i feared chanted phrases or verses to apologize.                         Later I searched which Hindu god is greater Shiva or Vishnu then I came to know parabrahman the supreme god. In Christianity they have three Gods and in Hinduism also Trinity which made me more believing in Hindu scriptures. I think God would made animal when people talk with there friend ,one say to other dog or bird I think they saying me about my next I would be that. Then in Indian movies when actor says in movies to other co actor. Crow. I think he is saying to me. Whenever I go outside I see a dog or bird or other animal in my imagination there forehead hits my forehead I think would be that animal in next birth, so I imagine hitting my forehead to other person forehead so that I can be human(this was going in my mind) this give me relief. Then while sitting I have thoughts in my mind someone saying to me that I will be animal in next birth. I tell in my mind about my friends that he would be animal in next birth(so I try to change it in my mind ). I compare my karmas with other person karmas that my friend had many fight in college and he tells that he hits bat at back of head of someone. Then I say he had done severe crime than me. He will be animal in next birth.                        In 2019 there came a movie in India sonchiriya of sushant Singh rajput I think that is signal of God to make animal in next birth. Then I continued had abusive thoughts and I searched google. One time my mind was saying to me to say sorry to god while imaging god Krishna picture in my mind and say sorry 10 times if imagine fades away before 10 sorry or 10 times repeating verses in my mind then he would not forgive me. I never abled to do that. Then in March 2019 I had thought about god abusive and sexual so I used to repeated verses 30-50 times in my mind. this consume my whole day I left the college. Please tell me it is ocd or pure o ocd I am confused to what to do"
    },
    {
        "selftext": "I HAVE OCD SINCE 3 YEARS AND I HAVE DEVELOPED IT BECAUSE OF EXCESSOVE USE OF INTERNET GOOGLE AND REASONING OR LINKING IN ACADEMICS.I HAVE DEVELOPED PARANOIA BECAUSE OF MY BIGG BUTT, I AM MALE WITH NICE BECAUSE OF SQUATING IT BECOMES HUGE AS COMPARE TO OTHER WHEN I GO TO PUBLIC PLACE EVERY PERSON STARE AND SMILES AND PRETEND LIKE COUGHING AND SAYS HUDD !!!! TO MAKE DOG AWAY BUT THERE IS NO ANY DOG THAT JUST SAY AFTER SEEING ME.I FEAR TO OUT BECAUSE EVERY PERSON MAKES FUN OF ME AND SOME TRY STARE AT ME LIKE I AM GAY OR SEX WORKER AND WOMENS ARE ALSO ATTRACTED BUT THEY DONT DO ANY HARM BUT THAT MALE TRY TO MAKE FUN OF ME AND STARES AT ME. PLZ HELP ME TO GET OUT THIS SOCIAL ANXIETY ISSUE MY LIKE BECOMES HELL BECAUSE OF THIS."
    },
    {
        "selftext": "Sun, 6 Dec The Voice Of Silence - A Narrative Therapy Session for women Shared to OCD Mental Health Support Group for Indians (Self-Help Group) Interested"
    },
    {
        "selftext": ""
    },
    {
        "selftext": ""
    },
    {
        "selftext": "Magdalena Alicja Klimkowska    ·  3 - - - 0   - N - - - o - - - v e - - m - - - b - - - - e - - r   - a - - - t - - - -   0 - - 6 - - : 0 - - 5 - - - - - -    ·  My affimation  I free myself from my negativity and embrace love and prosperity ...  And what is yours?"
    },
    {
        "selftext": "PSSD (POST SSRI SEXUAL DYSFUNCTION) youtube.com Sexual Dysfunction May Be a Permanent Side Effect with Antidepressants — Psychiatrist Stuart Shipko For more information, including links to the scientific evidence base for the statements in this video, as well as further resources: http://medicatingnormal..."
    },
    {
        "selftext": "I have ocd at the age of 18, but when I was small somewhere in KG I have sexual thoughts. I used to see my KG or PG teacher I sit in the front and I used to see her waist when she was writting in black board as her salwar suit her waist was sometimes visible to me. Then when I grow 6 or 7 years I used to touch her waist one big girl living nearby. I had same thought about my mother I put my head on waist while she was laying on her bed and some sexual thoughts going in my mind. And I did have same thoughts about my grandmother when she was sleeping on bed I had sexual thoughts I put my legs and my part below abdomen on her waist. When my mother goes in bathroom for bathing I used to watch her from space below the closed door . I had these thoughts in childhood. I have same thoughts about maid(kaam wali bai), when she sits on folding bed made of straps(patte Wala) I see her body from spaces between the straps. I used to hide in bathroom to see my mother while bathing, but she caught me.            So I was so bad that I have  sexual thoughts and doing this bad deeds. Now I think I had so much bad deeds with my family and others. God would punish me for this. Please help me           Does anyone have these thoughts in childhood and can you relate."
    },
    {
        "selftext": "Living with anxiety is like being followed by a voice. It knows all your insecurities and uses them against you. It gets to the point when it’s the loudest voice in the room. The only one you can hear. – Unknown"
    },
    {
        "selftext": "There are many who cringe at the mere thought of exercise. The heavy lifting, the exertion, the sweat, the breathlessness- such a turn off right? But did you know that there are people who simply can't get enough of it? Exercise addiction is real and people with this condition simply can't take a break from working out. They feel the need to hit the gym or exert themselves in some way or the other. They are extremely conscious about the way they look and are obsessed about keeping in shape. Here are some signs that you or a loved one may be suffering from exercise addiction: 1. Exercising even though it might be causing physical harm 2. Inability to stop despite wanting to 3. Exercising in secret 4. Experiencing withdrawal symptoms after exercise 5. Reduced activities in other areas and investing maximum time in exercise 6. Inability to exercise for short durations and opting for longer durations Exercising helps release two hormones- endorphins and dopamine- which are both mood lifters and make one feel good. Therefore, exercise addicts keep going back to working out as they wish to experience these emotions consistently. They love the feeling of being buzzed right after a workout and consider that as a natural high. https://wetrainbrains.com/ #exerciseaddiction   #addictiontoworkingout   #exercising   #workingout   #addiction   #typesofaddictions"
    },
    {
        "selftext": "The Importance Of Trigger Warnings For Ensuring Mental Wellness When it comes to mental health awareness, one of the key things we need to consciously do is to create a safe space for those suffering from mental illnesses. Therefore,  trigger warnings are of the utmost importance. These are basically warnings you give people in advance about topics that you are about to highlight that could potentially be triggering. This includes discussing or sharing write ups about ailments, violence, death, abuse etc. Such grave topics can be triggering to someone who is battling anxiety, trauma or other mental health conditions. For example, those who have hypochondria (fear of illnesses), may go into a spiral after hearing about someone battling a serious illness or how covid cases are increasing day by day. Similarly, social media posts about sexual abuse, violence etc., could drive the other person into a dark space that they are trying their best to come out of. Hence, make sure that before discussing such things or even sharing content about them, you warn those around you in advance about them. If you wish to talk about something that could potentially be triggering, ask those around you whether they would be okay hearing it. If someone says no, respect their sentiment. Same goes for sharing content on social media. Include 'trigger warning' at the starting of every post so that the other person knows what's ahead before downloading an image, article or video. Let's vouch to be more responsible. You never know what demons everyone is battling. #triggers   #triggerwarnings   #mentalhealth   #mentalwellness   #mentalhealthawareness   #mentalhealthisimportant"
    },
    {
        "selftext": "In India there are 33 crores Indian Gods of whom only vishnu,Brahma and Shiva are main. Different religion different deities like Jesus,Allah,Krishna. But Hindu scriptures says that source of all Gods is one supreme parabrahman formless god and in Sikhism it is nirankar. But some saints like Kabir das,guru nanak Dev says vishnu,Brahma, Shiva are minor god there is only one god formless. Kabir das also says Brahma, vishnu, Mahesh are minor deities and are son Kal purush who makes people divert from righteous path to the path of lust, greed,anger,etc. Kal niranjan was created by Satya purush the only supreme god.                    It's so confusing some believe in God and some doesn't believe say god is not there god is not visible why he don't punish rapist, theives and bad people.                     Some people say the visible universe has billions of Galaxy there must be some architect to prove god and Earth is right position from sun neither too far nor to near so they say is not mere coincidence.(from science point of view).                So what I do whom to believe and whom not to believe. If God created us then someone has created god. Tell your views on this. Please "
    },
    {
        "selftext": "Insight - All about Meditation    ·  - 1 - 4   - - A - - - - - - - u - - g - - - u - s - - t    · "
    },
    {
        "selftext": "My son is suffering from OCD ,ADHD and little Tourette but his OCD is pretty bad. We seen a Neurologust she prescribed a Medicine but his OCD is even worse, now who should I see not to just spending money to see different Drs and make his miserable OCD reduced ? I can’t see him Suffering He  keep asking same questions all day and jerking his head sometimes and then asking for forgiveness  PlZ HELP"
    },
    {
        "selftext": "OCD and Depression.."
    },
    {
        "selftext": "I am so anxious and overwhelmed by my feelings, that I always try to ignore or numb them. I am unable to be mindful of them, acknowledge them, and make them feel heard. I am unable to calm down via breath, grounding techniques or anything else. How do I start to acknowledge my feelings? It seems impossible to me."
    },
    {
        "selftext": "Anastasia Lee    ·  - - 2 4 - -   - N - - o - - v - - - - - - e - - m b - - - e - - - - - - r - - - -   - - a - - t -   - - - 0 - 5 : - - 1 1    ·  I think we can all agree this has been a really long year.. So, can we please just drop the whole \"Happy Holidays\" debate now..?   Let's just hold the intention of wishing everyone happiness and prosperity this time of year and always. Let's wish each other health. Hope. Good food to eat. Clean water to drink. A solid roof over our heads. Laughter. Peace. Love...  Let's hold the intention that we all have a great holiday season with all we need to thrive. All creatures great and small.  Whatever you celebrate, I hope it is a wonderful, joyous and peace filled holiday season for you and your loved ones. "
    },
    {
        "selftext": "Please read it"
    },
    {
        "selftext": "Work with faith! Unshackle    ·  2 - - - 8 - - - -   N o - - - - - - - - v - - - e m - - - - - - - - b e - - - - r   - - - a t -   1 - 2 - - - - : - - - 0 1    ·  Work with faith!"
    },
    {
        "selftext": "The worst part about intrusive thoughts is when your anxiety prevents you from logically looking at them. No matter how unlikely the possibility is, you can't stop being anxious about it..  But with therapy and counseling we can gradually shift your focus towards rational thinking. So that these thoughts no longer disturb your peace.  Connect with me for OCD therapy sessions online..it takes some time don't get impatient.. Start your recovery today  Happy Saturday "
    }
]