[
    {
        "name": "t3_jjs9yl",
        "created": 1603935175.0,
        "ups": 2,
        "downs": 0,
        "title": "I can't make a decision...",
        "selftext": "I've (F26 from India) been suffering the impact of what I feel is ocd, depression, social anxiety and panic a lot lately. My general physician recommended me a good Neuropsychiatrist a while back. I'm considering going now that I'm feeling really into depression.But there's 2 things that's keeping me from going, so please help me make a decision...1. Does every psychiatrist talk to the patient alone? I'm too scared to let my family know any details about this and am really scared that the doctor will start asking questions in front of my family member. I'm scared the room won't be sound-proof, so anyone outside can hear the conversation. Will all my details be kept totally confidential?2. Do the doctor always prescribe medicines? I'm very uncomfortable taking medicines (have had to take so many medicines for other illness recently). Can it be only therapies or something?Please let know from your experiences. It'll be a lot helpful for me to prepare for the visit. Thank you."
    },
    {
        "name": "t3_hys6qu",
        "created": 1595885045.0,
        "ups": 1,
        "downs": 0,
        "title": "How do I know for sure if I need a therapist or not?",
        "selftext": "First time poster. Background: I am from India (22F) with 3 siblings. Basically I am a third girl child. During the initial years of my life, I was not loved by majority of my family members except my dad and oldest sister. Hence, I started doing things that made me look good and other happy so they would love me.I got successful. Then during my teens, I met with few accidents and started gaining weight. So much so that my mom stopped buying new clothes for me because I would outgrow them. I wasn't allowed to wear the same type of clothes like my sisters used to wear. Firstly it was because of the weight and secondly it was because I have heavier bust than most of the females in my family. I have body image issues and most of the times I am too concerned about how am I looking. It has reduced a bit but is still quite prevalent and the comments ( thought to be funny by my friends and family) doesn't help. I also have low confidence because of the constant comparison done during my childhood and now whenever I meet someone with more skills than me at the same age, I am so low on confidence that even if I have a great idea, I am too doubtful about it. I constantly feel that I am not enough, not beautiful enough, not skilled enough. Also, my parents relationship was a strained one and my eldest sister whom I look up to had a bad first relationship. It left a mark on me and during my first relationship, I suffered a lot because of some of the actions of my bf and because of my outlook of relationship (I am not so sure about the reasons).Now, it been two years since we separated but I am not able to connect with someone like I used to connect with him. I still miss him a lot though he has hurt (emotionally) me badly in the past. I feel very low most of the days and though I am interning with an organization to keep myself busy and improve my skills. I just feel lonely, bitter and tired. I am not sure what to do.Note: it's difficult to go into much details so sorry about it. But I would be willing to answer any questions. Google has screwed me because there are so many things that I feel match my current state."
    },
    {
        "name": "t3_hh8wn1",
        "created": 1593350285.0,
        "ups": 2,
        "downs": 0,
        "title": "\"I don't know\"",
        "selftext": "*this might not make sense to most people*I feel like these three words can define my whole life. For as long as I can remember I've had trouble making decisions. When I was in my teens I was having problems in making decisions, important decisions like picking a major or what I want to study as well as easy ones like where do I wanna eat lunch. But back then I didn't think much of it. As I grew up, right after high school is when major changes started to happen in my life. I couldn't decide on what to pick for my college education. There were times every option seemed doable and there were times when nothing seemed favourable. So for most part in my life I do things which are most commonly followed by people, thinking that is probably the safest bet as majority of people do it. So I got into engineering, like most Indian kids. I simply did it because I didn't know what else to do. I was miserable the whole while I was there. My grades sucked, I had no friends, only two people I talked to because we went to college together. I didn't like anyone. For 4 years of my college I spend my day sitting in class waiting for it to end. zoned out. Absolutely blank. I didn't even leave class during lunch breaks. I have been living in the same house with my mom my whole life (Im 23now). My father used to work UAE for 10 year from when I was in 6th standard to when I finished my graduation. I cannot remember much of my childhood days. The only thing I remember is my mom and dad fighting and shouting. Everything is a blurr. So much that, I can almost remember an incident when my dad was trying to hit my mom with a belt and I held onto it to stop him. Now I don't know if it was real or I'm just making it up in my head. Now I'm 23, graduated last year with shitty grades, and I'm at my first job for the last 9 months which I couldn't give less fucks about. I got this job simply because I didn't know what else to do and came across an ad. It doesn't pay much, I'm mostly sitting in front of the laptop. But it pays the bills. Now days the indecisiveness has become much more prominent. It's like a constant battle in my head about what I should do. Should I do this, should I do that, what if I had done this, what if it was the other way around. I just don't know. All I want is to be dead. I have been wishing for death for the last 4 years. Not that i have made any attempts to take my life. I have just been hoping to die. In any manner no matter how painful. Just for this miserable life to end. I think the only reason I have not killed my self or tried to so far, is because I have to support my family now. My father is retired. And me and my sister are working. I am 4 years younger. I feel so helpless that I don't even have the option to end my own life because others depend it. Which somehow seems worse than being dead. When you're dead, you're just dead. It's those around you who have to get through this pain. But when you want to die and you know that it's not an option. You have to suffer every single day. Pretending to be normal. I have been considering going to therapy for the past two months, because it's not a common thing around here to seek therapy. If you're from India, I think you can relate. Growing up I didn't even know there's a thing called therapy. There's hardly anyone talking about going to therapy. But the thing is... I don't know!I don't know if what I am going through is actually some mental health issue or I am just being overanalytical or exaggerating things. I don't know if it's depression, dysthymia, aboulomania. I don't know if going to a therapist would be the best thing. Since the lockdown I have been looking this stuff up on Google and that's where I came across the term. Aboulomania. Idk if what I am going through classifies as that. And I don't want to call myself depressed because I know there are people going to much much worse. All I know is, I tell myself that 'i wish I was dead' about 10 times a day. I have been feeling this way for the past 4-5years. I know that I am scared of everything. I don't know if I wanna get better. And I don't know why I am even writing this. If you have actually read this far, I thank you for your patience, and if there's someone out there who feels same please hmu."
    },
    {
        "name": "t3_do3wdh",
        "created": 1572264781.0,
        "ups": 5,
        "downs": 0,
        "title": "Plz help me",
        "selftext": "Hey I need help,I've been telling my mom that I need to go for therapy and have asked her to find one but whenever I ask if she found one she has the same reply that is 'maybe later' I mostly have anxiety and anorexia and I've understood this and that's why I talked to my mom about my problems  , but very briefly and didn't say  most of the thingsBut I feel she thinks that these are just my mood swings and that I'll be ok But it's more than that , I know that but she doesn't understand I need help in making her understand that it's more than my mood swings and that she needs to understand ( I'm 15 I can't go by my own )"
    },
    {
        "name": "t3_fxsvik",
        "created": 1586469480.0,
        "ups": 7,
        "downs": 0,
        "title": "Does anyone have no direction in life?",
        "selftext": "So I recently passed sophomore year and soon will be a junior. Here in India, you’re supposed to choose a stream (Science, commerce, humanities). Until a year ago when I was not going through anything, I was a fairly good student, almost a topper. I was quite determined to become an astrophysicist and take science but now after anorexia and depression I don’t know what to do. I’m not able to concentrate on studies and I don’t think I’ll be able to cope with science. Commerce is basically accounting and banking and stuff and that’s a straight no for me. I’m interested in studying human psychology but I’m not yet sure about the other subjects. I want to become a chef( I know seems hypocritical considering I’ve been through anorexia but that’s where my head works). But my parents to think I’ll need a real job and that cooking could only be practised as a passion. I’ve no idea what stream to take and the time to take the decision is coming near. My parents are quite convinced that I’ll take science and I don’t know how to tell them I want to take humanities when I’m not sure as well. Whenever I try to focus my mind and try to come up with a decision; well I can’t just think about it, my mind always gets diverted, it just won’t allow me to think about it. I’m lost as of to what to do?TLDR- No direction in life. Not sure what stream to take. Cannot focus on the issue and come up with a decision"
    },
    {
        "name": "t3_fwv46k",
        "created": 1586330597.0,
        "ups": 3,
        "downs": 0,
        "title": "Accord pharmaceuticals",
        "selftext": "Anyone have any experience directly with them? My new klonopin refill is always generic but got switched to them now and I start friday. The pills look completely fake and hand pressed almost and literally just have a divider and a 1 and 2 on each half. Apparently sourced in india, compiled in china, and pressed in america. Every review i read online basically was completely negative of the company saying things like it was a sugar pill, made them feel sick for 3 weeks, made them a zombie, greatly increased their anxiety, and a few people even drug tested themselves through a doctor and didnt even come up positive for benzos. Not sure why Im all of a sudden on a new generic when I've been on the same one for years. Not sure if US manufacturers shutting down, or everyone faking anxiety cause they're scared of corona and too stupid to do safety precautions. Bleh im annoyed and nervous to start this. Hopefully it works okay for me or I can call my doctor and request a change although I highly doubt that."
    },
    {
        "name": "t3_e5ieps",
        "created": 1575414540.0,
        "ups": 14,
        "downs": 0,
        "title": "So close to making a decision on abandoning my home. Push me through the edge.",
        "selftext": "I'm 23, with no career and proper education. I work in American MNC just like slaves. We get paid barely $170 per month in India. I live with my parents and my sibling.  She's complete asshole or world made her. I tried making things special for everyone in my home, but no one ever cared much. They must have done, showed the acts of care by putting the blanket on me and taking extra pillows out. But emotionally they are killing me every minute.  Mom and dad keeps fighting for trivial things, they both are 53 and 50 respectively. My sister is 25 and divorced. I'm single, my ex married to a guy in 2017. They have a beautiful baby girl. I want to study Linguistics and Philology in German, Russian, Mandarin and Danish language. My dad is unemployed. My sister work for some other MNC and with both our salaries, we manage the household expenses and our living.  My dad drinks a lot, and is violent to my mom. My sister just never let me live peacefully on my weekoff. I'm writing this while I'm sitting outside , in the park, 9° C, wearing a t-shirt,  slippers, jean, freezing, because I had to storm out if my house because they again started fighting and started to emotionally torture me. I am in this bad situation of my brain that I can't be left alone.If there is someone with who I can talk is in office, working. She understands me well, she cares for me. I love her. I can never say this to her. I don't want to lose the emotional support I'm getting from her. Sometimes I do feel like if I tell her everything, she'll think I'm a loser, weak and she'll me just like everyone does. My mother is not my real mom, she's my stepmother. My Biological mother left us when I was 2YO. Then my father married someone, she and her son used to assault me and my sister, my dad divorced her. And then he married my mom. I was 8Yo. I never trusted her, never loved her much, never was able to emotionally attach to her. Most we talk about is what to eat at lunch and dinner. I'm weak. I cant cry. I feel like I'm living in a suffocating environment. No real friends,  no understanding family."
    },
    {
        "name": "t3_ea7uq3",
        "created": 1576290872.0,
        "ups": 1,
        "downs": 0,
        "title": "Does this sound like bipolar to you?",
        "selftext": "So in 2015 right after high school I had dealt with an inconceivable low. The lowest I've ever been. Had suicidal thoughts everyday, nearly did it. I went to the doctor and they diagnosed me with depression and gave me meds. I can say it didn't really help even though I said it did. When I came back from India I still suffered from an irritable mood and went back to the doctor where I was pushed to go to the hospital as I had been currently experiencing suicidal thoughts. Met with two psychiatrists who said it seemed I only had seasonal depression and not chronic and kept me on the same meds. Well one doc said I didn't need it and it was only a state of mind. Stopped them a few weeks later because of family pressure and well kind of felt a bit... Dismissed. So... Yeah.So I've been on and off depressed every year, sometimes very irritable (like this passed week.) A few weeks ago I experienced something very odd in which I had a bout of very high energy; I started writing, reading again, I slept for like 3 hours everyday and it was actually one of the best times in my life. I had so much confidence, thought I could do anything, be anyone! I wish I was going through that now. But I'm back on my lows and I swear it's affecting how I am at work with my peers. I also have extremely crippling anxietywhich makes it difficult to leave the house sometimes so even though I write this post today; I had my doubts for about a month or two now. My question is: is there a chance that I might have bipolar, even though the psych (two psychs) didn't see it? Can I see a walk in clinic for this? Maybe I should say both my dad and mom are diagnosed bipolar.Live in Toronto! 23 years."
    },
    {
        "name": "t3_azr2f1",
        "created": 1552322875.0,
        "ups": 1,
        "downs": 0,
        "title": "Some questions as a teenager..",
        "selftext": " IDK if this is the right place or not to ask this but i need to do it anyway.   So before getting to the question here is some background about me.   SO  I am a 17yo high-school student from India.Computer Geek (But i am  open  to any kind of knowledge and i keep reading about stuff ) Highly   interested  in politics and a wannabe entrepreneur.   So Here is my question   So there are people who talk to them self but its little different in my case    I  dont have convos with myself but I talk to other people.Like i  imagine  being into an interview/seminar and i am answering the  questions or i am  giving a speech for a political campaign etc etc.So i  am always talking  to other people   I dont have good relation with  my parents (Personal Issues) and i have a  GF ( ps -- she is my life's  first and only crush ) i love her alot and  i love her family too...more  than i love my family..so sometimes i  imagine that we both have grown up  and i am with her family..spending  some quality time..helping her  mother in kitchen and things like  that...cooking for them and all...so  it keeps hapening..and by  \"imagine\" i dont mean that i force myself to  that state of mind..it  happens automatically..like i am studying and  talking..cooking and  talking...there is not any fixed situation when  this happens...it  happens anytime...sometimes i am just sitting in the  chair talking to  myself and my legs automatically start walking towards  the bathroom and  then i am inside locked myslef in standing in front of  the mirror and  talking and my voice is not loud..its loud enough so that  only i can  her myslef..even my lips dont move when ther are people  around me .SO  is all this normal...or should i be worried about it?   \\[PS-  i prefer being alone..i dont go out..i am always in my room  studying or  coding...maybe this could give you some idea about me\\].   Thanks  "
    },
    {
        "name": "t3_9iftl0",
        "created": 1537801268.0,
        "ups": 3,
        "downs": 0,
        "title": "Mom just had a delusional hallucination episode",
        "selftext": "Hi Reddit,I live in SF and my parents live in India. Just today my mom has a delusional hallucination episode, where she claimed that she had to save someone from a negative attack from the astral world. And apparently, someone will be picking her up form her city and taking to LA, where she will help a certain spiritual organization to overcome the attack. 1. It only seemed today that she has some kind of mental issue. Because she wanted to leave today itself. (And there was no ticket/ or any communication in real life). I spoke to the spiritual organization and they said that it seems to be a mental issue, and there have been few cases where people claim to have a direct message from God. And asked me to take her to a psychiatrist.Though it became a bit extreme today, I do remember several incidents where she claimed certain spiritual experiences which seemed to be out of reality.2. My question to the community: How do I convince her to visit a psychiatrist? She is so much convinced that she is the divine incarnation, that it is very difficult to convince her anything. I am travelling to her asap. I told her that not to go anywhere until she gets the tickets in hand. And also How do I handle this situation ahead?Note: I just had got a call from my mom and this drama unfolded. I am shooting this to multiple reddit mental health communities in hope for some guidance. "
    }
]