[
    {
        "name": "t3_ju4mms",
        "created": 1605400224.0,
        "ups": 11,
        "downs": 0,
        "title": "How to stop comparing myself to his ex (looks, intelligence, what they shared)",
        "selftext": "Hi all,I have been going to CBT to stop obsessing over my partner's most recent ex in terms of looks and intelligence. I am really struggling to stop the obsession of snooping on her life, by now I know more than I want. Yet I give in to the compulsion of thought experiments and checking her github non-stop.**Intelligence**: She is a doctorate student in sciences at an elite uni on the west coast, while I have a Masters in history from said uni (and two other degrees, OK, yes, two, but all non-science). I cannot stop comparing myself to what she will achieve in the future, that she is in sciences like my partner, that she probably uses mathematical models that he studies (he's in quantum physics at the same uni) and that she shared more with him (both are heavy into science!). I lose when it comes to comparing myself to her. I work in an ops-heavy job now. Yet I know that I could have ended up where she is now, if I had set my mind onto it (obsession does help with studying!)**Looks**: She looks just like his other exes - i.e. nothing like me (I have brown short hair, she has blonde locks, just like his exes). I have a really small frame, whereas she definitely weighs more and has big breasts. I just look nothing like any ex - they all look similar. I am slowly coming to terms with this, so it's less of a problem, but the above is.I make up scenarios in my head where I see them sharing great memories e.g. seeing their favourite scientists, I see objects in our apartment that he moved in and think that he probably got them with her, etc. I think about her now and compare myself and I lose against her - because I will never earn as much money, people will always consider scientists more valuable than non-scientists, I will never be able to win prizes and do groundbreaking research. I lose when it comes to intelligence. He will never have huge breasts to play around with as long as he is with me, because I don't have them. She now is dating a quantum physicist that looks just like my partner. From India, like my partner.I'm 31. He's 32. I don't want to do this anymore. I told myself I wouldn't check her github anymore, but I gave in today. I feel like I failed once again... please, can someone share a positive story? A story of success? I feel like I will never overcome this and it robs me ob my joy.(Yes, I know the above sounds ridiculous, but it actually tortures me)Thanks,Mar"
    },
    {
        "name": "t3_jihnv3",
        "created": 1603758387.0,
        "ups": 12,
        "downs": 0,
        "title": "Looking for people who succeded in getting over contamination OCD",
        "selftext": "Hi, i am from India. I have a uncle who is 40 years old and is struggling with contamination OCD from past 9 years. He is married and have 2 kids. He is a very sweet person who takes care of everyone. He cleans his hands with washing machine powder.He baths for hours , worries if someone touches him, dont sit on chairs. Recently he is skipping meals citing some other reasons but i sure know its because he has seen some one sneeze another part of house. It is hard for me to see him go through this. He avoids a doctor saying such treatments will make his brain numb and there will be many side effects and is not coming to a doctor.He always in bad mood,nagging about trivial things. His family getting disturbed.Somewhere deep inside i think he lost the belief he can be normal again. So first i want to make him visualise and believe that someday he can be normal again by not just saying things but by making him meet people on skype who succeded and turned their life to normal . For that i am reaching out to this community,  If you are someone who succeded significantly in overcoming contamination OCD , please please contact me.I will arrange a video call with him to share your experiences.It maybe only half an hour of time but can make a difference to my uncle's life.  Please comment here or reach out to me at vaddiajayrathode@gmail.com"
    },
    {
        "name": "t3_iytsrb",
        "created": 1600967291.0,
        "ups": 2,
        "downs": 0,
        "title": "For those who has gotten some help from ashwagandha",
        "selftext": "What is your dose and how often?"
    },
    {
        "name": "t3_iirwhq",
        "created": 1598734452.0,
        "ups": 3,
        "downs": 0,
        "title": "Life is not worth living anymore",
        "selftext": "I have had OCD since I was a little child.I loved my family a lot and so a lot my obsessions were based around me doing things I did not want to do to keep them safe.The obsessions and compulsions  were few and far in between so childhood was the only phase of life that I actually enjoyed, My family loved me, I topped my class for many years and so the teachers and classmates were always on good terms with me(How I miss those days) Anyways ,It was smooth sailing and I loved my life because I had everything going for me.All this while my OCD grew slowly but it still quite manageable for me so It did not deteriorate my life in genereal.I have also been very religious since childhood so I prayed at all the Temples(I am a Hindu) en route to my school, I also this Idea that all gods are same so I prayed even at churches and mosques.I studied in a Christian School here in India and we sang a lot of songs(about Jesus) and I loved god so much that I got extremely emotional sometimes while singing these songs. I really counted my blessings. OCD raised its ugly head when I was in class 9  My uncle passed away and it had a very bad impact on my overall mental health (which by the way was already quite shakey as I was starting to notice some really disgusting thoughts whenever I was praying).I did not want the thoughts but whenever I went near any place of worship my mind started to race and a lot of very distressing thoughts which were basically the opposite of what I was would come running in (Praying for things I did not want, Cuss words and sexual intrusive thoughts about God).I was left confused and devastated because my entire Identity was based around the fact that I loved God and My Family.I never knew these were symptoms of a disorder so I kept mum.(How do you explain to your family that you are having sexual thoughts toward God).Then the worst phase of my life began when I moved out of my home to prepare for IITJEE (An entrance exam in India for the godforsaken Indian Institutes of Technology (IITs) with acceptance rates hovering around 1%).My family had really high hopes from me but I was caught in a web of OCD and depression and it has all been downhill from there. I underperformed at a level that my friends and Parents could simply not believe.I've gained weight and my religious fears and anxiety have increased like a 100 times.I have sinned many times(Would have told what I did but that's a story for some other day) and I live under constant fear of punishment from God and  there is just massive amount of guilt and anxiety that does not allow me to function properly.Sometimes I feel like I am not even the person I used to be.I recently moved home due to the pandemic with one year of my \"Preparation\" still left and I don't know what to do now.I cry almost every other day because I HATE MY LIFE.Earlier when I got Intrusive thoughts I could tell them from my normal thoughts.But now whenever I am angry I feel like I actually want bad things for my Family,Worse still whenever I am angry these blasphemous about god fill my mind and I feel like a part of me really is thinking them on purpose and it is just a continuous string of intrusive thoughts, urges, unwanted arousal, groinal responses and self loathing.Every time I seesomething that reminds me of my happy days I feel like crying. I really just wanted a normal life but instead I got this.I look at normal people with longing every single day I know I will never land up in IITs because I have not studied anything.Whenever I want to study I feel like \"well ! whats the point if you are going to hell anyway\" People turn to god in times of need but who do I turn to? I am sure God hates me but what do I do? Its hard to live in constant fear of hell, Its hard to die and I don't know how long I can go like this. I do not see any hope for my future.I hate myself."
    },
    {
        "name": "t3_hmqzmc",
        "created": 1594140972.0,
        "ups": 2,
        "downs": 0,
        "title": "Someone help",
        "selftext": "I keep thinking about this awful headline in india about eight teenagers who committed these horrible acts of animal cruelty and those animals never got justice. This is especially harmful to me right now because both of my dogs recently passed away. I can’t stop thinking about it, about them and every agonizing little detail."
    },
    {
        "name": "t3_hhvi8j",
        "created": 1593444755.0,
        "ups": 3,
        "downs": 0,
        "title": "Avenues of Getting Help?",
        "selftext": "I have recently been thinking more and more about how I might need some sort of help with what I think could be OCD. (This post is not meant to diagnose or confirm self-diagnosis). It usually gets worse at night when I get super paranoid about things and so I have a nightly routine of sorts. I lock my windows and doors a certain way, arrange my shoes, reposition the chair at my desk, drink ten sips of water, say goodmorning and goodnight to my s/o in a very specific way (and expect the same back). I’ve been doing things like these for almost my entire life, so I never really considered the possibility of needing help. All this to say, I want to get help before this gets worse. I’m extremely worried about some event happening to make it get out of control at some point. However, I can’t afford therapy right now. I’m a 19F in India and especially because of COVID-19, things are really tight and so I don’t think I could ask my parents for it. Does anyone have any suggestions of what I can do? TLDR;; Can’t afford therapy, what else can I do?Also note: I apologise if my post contains anything ignorant in it. I don’t know much about this space but I’m open to learning."
    },
    {
        "name": "t3_bl9nu6",
        "created": 1557161688.0,
        "ups": 1,
        "downs": 0,
        "title": "OCD – Types, Symptoms &amp; Treatment in India, Punjab, Ludhiana",
        "selftext": ""
    },
    {
        "name": "t3_gdd28w",
        "created": 1588632996.0,
        "ups": 1,
        "downs": 0,
        "title": "Any patient here changed countries? How did you manage your medicines?",
        "selftext": "I have been taking medicines in India, but now I have to go in a different country. How do I go about taking my medications which suit me?"
    },
    {
        "name": "t3_gcx35i",
        "created": 1588564744.0,
        "ups": 1,
        "downs": 0,
        "title": "I am an OCD patient, struggling with quite a few years, should I go to graduate school?",
        "selftext": "Hello everyone. I got diagnosed with OCD just after I finished my high school(2011) in India, and got to know I was having it since a few years from then. After that I completed my bachelors degree with OCD treatment as well as multiple relapses in between. After that I worked with 2 companies also. All the time I have been living with my parents at home. My OCD hasn't been cured completely, I can say its 50%. Now I have decided to go to graduate school in USA, should I take that risk? I will be living completely on my own, that too in a completely different country, studying way too difficult topics, taking up loans for studies. Should I do that?"
    },
    {
        "name": "t3_e0elov",
        "created": 1574522086.0,
        "ups": 3,
        "downs": 0,
        "title": "My OCD Story..",
        "selftext": "Well.. Hello everyone my name is Sahil and I am from India. I am 17 years old.. And currently preparing for an entrance exam to become a doctor..  As this community is to support the ocd sufferers, it is a privilege to be here.. I would like to share my ocd journey..  Well.. My ocd was always there since my early teenage years but I never noticed it anyway.. Belonging to a orthodox muslim family in India, I got very religious and well my earliest ocd were religious ocds.. During my prayer times, the thoughts of hurting Gods would trigger me, I was small I didn't understood that so I thouggt it was my inner demon which consumed me.. So I thought its me, who was carrying those evil thoughts.. As time went by I became less religious my ocd was only triggered when I entered to mosque.. I then ignored it as I  didn't often gad too many visits. Situation became worse during final exam of class 9, I was doing below average in school, I was very weak in maths, Then somehow I typed and searched in internet about maths disability and the word dyscalculia strucked my mind.. After 4 or 5 seconds I lost track how could I add, subtract, my brain started to deny my calculations, I juxt broke down and started crying, I thought I had dyscalculia, my brother consoled me though I didn't know to figure the left or right hand of others so I became more convinced, then my brother just told me that u juxt have to reverse ur own hands, lol.. It took me seconds from then on.. I managed my intrusivity towards maths and bingo I did well in maths and got convinced I  didn't had any disability...At the onset of class 10, I was preety darn focussed then my ocd took a worse turn, all creepy thoughts of failing in exam took me, I liked science but in class 9 I didn't do to well. So when I studied science, I felt my head ached  , my eyes sore, lol, I knew it wasn't true.. Somehow I managed nd gave the exam.. Well, I became one of the finest students in the class so this thought juxt got away..I was focussed in my final exam, class 10 th examination in India was considered very important, I was religiously engrossed, things took ugly turn nd I found myself over nd over thoughts of killing Gods nd hurting prophets,.. I suppresed my thoughts often broken many days.. I somehow appeared in the exam and I did wellNow here I am, in class 11 struggling in a massive ocean of studies along with fighting ocd nd body dysmorphic disorder , when I was young my brother used to tease me about my jaws, now well it seems it paid off, I find my jaws my breaking in off... I tried meds from a prescribed doctor, doctor was only giving meds, no interest in therapies , after 2 months becze of side effects I quit.. Now here I am, living with ocd well I have been from d past few years, life had been difficult, we all know.. So here it was, Iknow it was long! I hope I didn't bore u"
    },
    {
        "name": "t3_cmsda2",
        "created": 1565135735.0,
        "ups": 2,
        "downs": 0,
        "title": "Washing my hands for too long",
        "selftext": "Whenever I leave the bathroom, I end up washing my hands for 8-10 minutes.I just cant stop washing them after a minute and as a result I am scared of going to the bathroom. I now often suppress an urge to go for as long as possible because I cant bear to wash my hands again. I am in a new college and people are beginning to think that Im weird.I cant stop washing till I have cleaned every finger thrice and washed each and every spot of my palm.However I am in a country(India) where mental health isnt considered to be real so I cant really visit a doctor. I would appreciate any advice to help me take care of this on my own.Thanks for reading"
    },
    {
        "name": "t3_8e981y",
        "created": 1524490973.0,
        "ups": 11,
        "downs": 0,
        "title": "Attempted Suicide Today",
        "selftext": "Mod please remove if violating rules. I checked the rules and according to me my post isn't violating any.So as the title says, I attempted suicide today.I got diagnosed with OCD in July, 2017 and my psychiatrist says I have had it since September, 2014. I have Pure O and my obsessions keep on changing and currently my obsession is POCD. I am from India. And if you guys are aware from news lots of bad things are happening in my country right now. It didn't help that I have POCD. Since past 2 - 3 weeks, every morning I wake up feeling as if I am a monster, feeling I am a rapist or a pedo. I am not though. I have never done nor would ever do such horrible thing. But still I wake up feeling like an evil person. So today morning I decided to end it all. I didn't want to die but I also couldn't live like this - wake up every morning feeling like a monster, constant fear that police will arrest me, constant thoughts telling me I deserve to die.I wrote my suicide note, placed it near my computer monitor and wrote mobile number of my mum on my palm. When my mom went for yoga classes, I went to nearest railway station to jump in front of a train. I know I shouldn't commit suicide this way as I might give PTSD to train driver, but I didn't see any other way to attempt suicide which would guarantee death.I stood in front of tracks and called my best friend. I wanted him to break the news to my mom of my suicide rather than police guy. I apologised to him for involving him in this. He talked to me for half hour and said don't kill yourself for ocd. He is now coming to meet me in sometime. My mom knows something is wrong from my face and all day she has been trying to talk to me but I tell her it is job stress. She doesnt know about my OCD.I still feel like monster.Currently thinking that had i attempted it this feeling of monster would have stopped.But I will wait for my best friend to come and talk to me. Just felt like sharing with you all. Long time lurker on this sub.Thank you."
    },
    {
        "name": "t3_9h68n0",
        "created": 1537400444.0,
        "ups": 7,
        "downs": 0,
        "title": "17M, having a horrible time at school",
        "selftext": "Firstly, I'm sorry I'm even bothering you guys with my shit, not trying to be an attention garner, just tired of myself. I've been diagnosed with OCD since about 4 months although the thoughts have been bothering me since more than a year. My life has gone from what seemed normal to absolute hell. About one month back, I struggled to do anything. I wrote everything again and again, striking it out over and over again. I read every word I ever read (even car number plates) again and again. I did every action again and again (4,8 or 16 times), be it wearing clothes, sitting on a chair, walking from one point to the other. I constantly struggle with any writing tasks as I feel forced to scratch out what I write if the letter goes below the line. I've lost all interest in studies and my marks (I live in India) have dropped from 75-80% to 30-40%. I've never felt worse. I have no friends at the moment, everyone's moved on from me, and the friend group I did have hates me because I felt compelled to act in an egotistical way towards them (I felt I didn't deserve them and they deserved better than me) and this led to the break-up of my girlfriend(also best friend) and me, which sorta put me into a spiral of just self hate and shit. My elder brother, my one sole friend, is now studying like 9000 miles away in the US. I'm struggling to barely pass right now and I honestly can't see much point in my life, even if I get cured. I also dream of meeting a woman who's perfect for me, but I'm afraid that even if I do meet her, I'll feel too anxious and that I don't deserve her and ruin it again. My mind is just a shit hole. I'll be writing and all of a sudden my mind thinks up some shit like \"I swear my soul to Satan\" or some shit or \"The Devil wants you to write properly, so don't write properly\" or God know what. I also have religious and sexual obsessions, wherein I think inappropriate thoughts about Gods having sex, literally while performing a religious ritual or spending time in a temple. I also think random shit about strangers, mostly random women I see, that they should get raped or that I should rape them. Everytime I'm about to perform some action like drink water or sit, my mind tells me the devil wants you to do that. Plus I'm always afraid my actions will affect my loved ones, and I fear that if I touch something of someone else, I'll curse it for them or some shit. I've seen two psychiatrists who have diagnosed me with OCD and prescribed me Flunil 20 (twice a day), and Uvox (once in the night). I also have conflicting voices in my head right now, one telling me all the bullshit and one telling me that it's all bullshit, I just don't know what to do. I did a few sessions of Cognitive  Behavioural Therapy too, but since a lot of it had to do with writing, I gave up on it. I'm sorry for ranting so much and taking up so much of your time but honestly I've never felt so depressed in my life.Some things I forgot to mention are:I've lost 15 kilos of weight because I haven't been eating, mostly because I feel I don't deserve it. I'm stuck in these loops, wherein I don't allow myself to perform a task, then get mad at myself for not performing it. These loops are mostly what end up with me being sad these days. PS not gonna lie it sorta sucks to be alone."
    },
    {
        "name": "t3_b6xqae",
        "created": 1553897360.0,
        "ups": 1,
        "downs": 0,
        "title": "HIT AND RUN OCD",
        "selftext": "Hey,guys,i i am from India,been suffering from hit and run ocd from the past 6 months,a 5 km ride would sometimes tak e me about 3 hours time,because of the constant rechecking and driving along the same route,to make sure i had not hit someone,this would cause me intense distress,wastage of time and resources ,lately i am better now,but recently all of a sudden ,my mind keeps on playing a past incident ,which took place on 27th december,2018, i have played that memory 100 times in my mind,to convince myself that i had not hit someone that night,my mind keeps on giving me doubts that whether i was driving on low beam/high beam,were the street lights on,was my windscreen dirty or clean,was i changing the radio or fully concentrating on the road ahead,whether my music was loud and hit the person and did not know,there is no damage to my car,but then i wonder if i  hit the person and still my vehicle is not damaged,had seen 100 videos of pedestrian crash on youtube,but still every morning i get up with the feeling that maybe i injured that person on that particular day and the guilt just keeps building up in me,what to do guys,this OCD is really messing up with my life ,please guys do comment, you people are only my hope."
    },
    {
        "name": "t3_9erybo",
        "created": 1536648669.0,
        "ups": 2,
        "downs": 0,
        "title": "Confused and Scared",
        "selftext": "First of all, I have not been officially diagnosed with OCD. I just came here to see if other people experience the same thing I do and hopefully get some advice...I was fine until this summer, late July. All of a sudden, I had a sudden flare-up of an experience I have known since I was 11 or 12 years old. It hadn't resurfaced again until this year, and I am now 17 years old. Basically I think of a disturbing thought randomly, and somehow I can't stop obsessing over it. In July, I went to India. I was watching some Buzzfeed Unsolved videos with my sister because it was boring as hell there and there wasn't anything to do. I felt really strange and sure enough a few days later, a horrific thought popped up in my mind: What if I am a pedophile? Usually I would be able to ignore random weird thoughts, I had done it for 5 years continuously, but this time something really bad clicked and I literally couldn't stop thinking and fearing that I am attracted to children. I began to look at random kids and check if I was aroused, read things about pedophiles on the internet and make irrational connections that convinced me that I am a pedophile, and I also considered killing myself so I would never get a chance to harm a child. Now i am considering not having kids in the future for fear that I will do something to them, because I'm scared that if I am ever alone with a kid I will not be able to control myself and abuse them. This (and many more thoughts that I can't recall immediately) broke me down so much that I had a mental breakdown alone in my grandparent's house for like half an hour. And it became worse because my two little cousins visit this house almost everyday. And I couldn't tell anyone why I wouldn't engage with them or talk to them. Because I'm scared I might be a pedophile.Quick flashback to the past:There were some strange events that I experienced when I was a kid that I now realize are similar to my issue now, but I couldn't tell back then. First, there was a time where I got terrified that I was lesbian, and not because I was homophobic. There was a time where I obsessed about the thought that I was pregnant at 11 years old, even though I had never had sex so it logically could never happen. And there was an even worse one where I thought I was attracted to my own sister, and several other moments that I can't recall now but seriously petrified me when I was a kid.Back then, I didn't think to research these symptoms because of my shame, but now that I have, I really want to get to the root of the problem? Is this an actual issue? or am i really a pedophile, a thought that disgusts me but keeps reaffirming itself in my head. It feels real and I think I am driving myself insane. Moreover, I have this fear that one day, I will stop being disgusted at the idea that I am a pedophile and I will accept it. I really don't want to be one. This fear is keeping me grounded but also driving me mad, making me feel confused and guilty. And I could never tell my parents. They would think that I am just not occupying myself with more important things and that \"Idle minds are the Devil's playground\" (if that truly is the case, then hopefully when college starts and I become busy, this all will go away). When i first had these thoughts this year, I immediately recognized having them from childhood and I almost instantly dreaded it.After I came back from India, things got better, but now I have thoughts that I will become a serial killer in the future. I have found myself thinking about stuff like \"If I killed someone, would someone find out?\" \"Where would I hide the body?\" and I realize that I am thinking this and immediately feel disgusted and scared. And I also once read that some serial killer said  ‘I knew long before I started killing  that I was going to be killing – that it was going to end up like that.  The fantasies were too strong.’ And I was engulfed with dread, disgust, guilt and fear that this might be me one day. It horrifies me. I might kill myself because of this, if this keeps going on. I thought this would never come back again, that it was over like 5 years ago. But it's back and I am not handling it well. It seemed to cure itself before. I keep trying to tell myself that it's just a mere thought, ignore it, but it keeps coming back.  I even feel kind of manipulative writing this post, like what I'm talking about is just to gain sympathy or attention from others. I feel like a different person, and not in a good way. No one knows this is happening to me. I don't want to tell anyone. They're going to think I am crazy. I really hope this is just some sick joke my mind is playing and it will stop soon. There are so many more things I want to say about this, but for now this is the most i can recall. Thanks for reading.&amp;#x200B;"
    },
    {
        "name": "t3_8tp3ft",
        "created": 1529947050.0,
        "ups": 9,
        "downs": 0,
        "title": "Inviting Anxiety To Tea",
        "selftext": "Hey guys, thought I would share a quote that helps me in the daily exhausting battle with OCD. Hope it will be helpful to some of you as well. :)\"One of my favorite stories of the Buddha shows the power of a wakeful and friendly heart. The night before his enlightenment, the Buddha fought a great battle with the Demon God Mara, who attacked the then bodhisattva Siddhartha Guatama with everything he had: lust, greed, anger, doubt, etc. Having failed, Mara left in disarray on the morning of the Buddha’s enlightenment.Yet, it seems Mara was only temporarily discouraged. Even after the Buddha had become deeply revered throughout India, Mara continued to make unexpected appearances. The Buddha’s loyal attendant, Ananda, always on the lookout for any harm that might come to his teacher, would report with dismay that the \"Evil One” had again returned.Instead of ignoring Mara or driving him away, the Buddha would calmly acknowledge his presence, saying, “I see you, Mara.”He would then invite him for tea and serve him as an honored guest. Offering Mara a cushion so that he could sit comfortably, the Buddha would fill two earthen cups with tea, place them on the low table between them, and only then take his own seat. Mara would stay for a while and then go, but throughout the Buddha remained free and undisturbed.When Mara visits us, in the form of troubling emotions or fearsome stories, we can say, “I see you, Mara,” and clearly recognize the reality of craving and fear that lives in each human heart. By accepting these experiences with the warmth of compassion, we can offer Mara tea rather than fearfully driving him away. Seeing what is true, we hold what is seen with kindness. We express such wakefulness of heart each time we recognize and embrace our hurts and fears.\""
    },
    {
        "name": "t3_8p9637",
        "created": 1528395556.0,
        "ups": 6,
        "downs": 0,
        "title": "Urination ocd",
        "selftext": "Guys I suffer ed from this ocd for about 6 years.in the middle I tried suicide also.i lived hell life in 5 to 6 years discontinuing education n I was most of the times sick with that sensation....I stopped going out of home.In India there is no one psychiatrist ,to tell also.it is ocd and since  two years I came to know that it is sensorimotor ocd.Now I am normal but still if I take up challenges it can cause problems...so I am searching solutions n CBT types as to how to come out of that preoccupation if I am going for job interviews or any major things.or suddenly I remember that I suffer ed so much.it visits but as I have grown 20 years with that I just neglect..but I am really not confident of leading independent life with good job eventhough I did engineering after recovery on my own.If I am just jolly doing household chores n watching TV no problems. sort of I avoid trigger ing situations n just lead normal.simple life ...But while doing engineering I was quite confident that I overcame issue.eventhoufg other forms of ocd anxiety trouble d me all my life..But again at the end of engineering I developed fears if I was in stress situation...I do meditation n take medicine now.N I am searching all internet mindful Ness etc etc to find permanent solution for this...and live carefree life.i feel.i am.still.under that strong ocd.other intrusive thought s I can ignore ..Since 15 years now I am 35.. struggling ..Any specific guidelines to overcome this urination ocd ..will be helpful...I want to create trigger for me in daily life n get confidence that it never bothers me even slightly in whatever situation .. whether when I remember my old past or during job interviews..But never give up your life.this ocd involve s that sensation uncomfort also together with anxiety..it's worst one.i was compelled to empty my bladder .but I would again feel same sensation....and if I am not going loo.always preoccupied with bladder feeling...oh god .my advice I can't advice also... somehow I came out ..but not completely... any one suffering from it.i feel you can lead fairly simple life just by detaching associated anxiety with it.."
    },
    {
        "name": "t3_5zp82q",
        "created": 1489678022.0,
        "ups": 5,
        "downs": 0,
        "title": "Anyone else want to try Gamma Knife for OCD",
        "selftext": "I've been seriously considering possibly getting surgery via gamma knife for my OCD. Medications work for me but I'm 25 years old and the thought of taking antidepressants for the rest of my life with all the side effects that come with them seems kind of hopeless at times. In addition, going off meds and using ERP/CBT every single day seems extremely challenging as well and is a lifelong struggle of coping. Wouldn't gamma knife destroy the misfunctioning circuits in the brain causing OCD once and for all? For instance, not the same scenario, but I remember reading a while back about a man that had a suicide attempt that had OCD and he essentially shot himself in the head but didn't die. In fact, the bullet destroyed the circuit in his brain causing his OCD and he was essentially cured of it. Brain surgery seems like it could produce the same results. Scientists can already see what circuit (s) is highly overactive in someone with OCD simply by triggering you and taking an fMRI scan. The overactive parts light up like crazy. I feel like if surgery was done more often scientists could perfect the technique and the success rates would be even higher instead of pushing everyone on to medications, but it would probably cost a bunch of money to have surgery on the nearly 3 million sufferers in the US alone. I'm sure you could probably have it done in India or something and just pay 10 to 15 thousand dollars out of pocket and some one would do it because they won't do it here in the US for all the \"we want to try everything else first\" yada yada"
    },
    {
        "name": "t3_6d6sco",
        "created": 1495707345.0,
        "ups": 0,
        "downs": 0,
        "title": "The Ancient Wisdom of Curing OCD",
        "selftext": "I once read a beautiful Zen story:The great zen master Bodhidharma travelled all the way from India to China in search of his successor, but found no one up to the task. He then came upon a faraway cave, and sat inside facing the wall in meditation, waiting for the right disciple. He waited thus for nine years.A young man at the time, Huike, was suffering from various mental afflictions. He had tried many methods of healing and visited various famous masters, but the maelstrom inside his head grew worse. He had been about to give up hope when he heard of the mysterious Bodhidharma meditating in the cave. Bodhidharma was known for his strange and unworldly ways. The emperor of the realm had once asked the master if he could build him a magnificent temple, if that would gain the emperor merit. Had Bodhidharma said yes, the emperor would have willingly spent a fortune, and Bodhidharma would have lived in opulence, but instead Bodhidharma replied, “Even if you build a temple, you will not gain even a sliver of merit.” The emperor was so angry at this reply that he banished Bodhidharma from his kingdom. And so it was Bodhidharma lived in a cave for nine years, meditating every day in total silence. He had not talked to anybody in all that time.When Huike heard that story, he said to himself, “I don’t care about earning merit. I must learn from him if only because he can stay quiet and still for nine years whereas I could not keep my mind still for nine hours, let alone nine years!”Indeed, the most difficult thing to do is to not do, to simply sit quietly alone. Being alone is different from being lonely; loneliness rings of sadness, and is accompanied with the need or desire for others. But true aloneness is a state of beauty. A truly alone person does not need anybody, but is spiritually fulfilled by himself. We are always affected by others: happy because of them, suffering because of them, and have never tasted what it is like to be totally, wonderfully alone.Huike found Bodhidharma’s cave and begged to see the master, but was refused time and again. So Huike set up camp near the cave. He waited as a spring filled with plum blossoms turned into a snowy winter. On a day with snow flurrying in the sky, Huike went to the opening of the cave and, kneeling in the snow, violently cut off one of his arms, saying to the entrance of the cave: “If you do not come out to see me today, I will kneel here for all of time.”Bodhidharma finally came out. “Young man, what do you want to ask me about? What sorts of problems do you have?” he asked Huike.“My mind is wrought with unrelenting pain every moment,” said Huike.“Please, Master, release me, allow my mind to be at peace forever!”“Bring me your mind, and I can make it at peace,” Bodhidharma replied.At that moment, Huike was hit with the truth. He had been troubled with problems originating from his mind, but no one had ever asked him where his mind was in the first place. Searching for his mind and seeing it for the first time, he erupted into tears. In that moment, he was enlightened. He went on to become Bodhidharma’s successor.Huike became a master, but he once suffered from all kinds of psychological disorders. Like everyone else, he struggled with demons within but did not stop to actually look at his neurosis until Bodhidharma asked him to find his mind. Looking in this way, he saw through his own demons.For you, yes, you, reading this essay right now, can you stop and look at yourself for a moment now? I mean, really look at, and even appreciate, your own psychological symptoms.The more you practice, the more you will realize the power of simple observation.www.yihewtherapy.com"
    },
    {
        "name": "t3_2hprnj",
        "created": 1411957230.0,
        "ups": 6,
        "downs": 0,
        "title": "This song helped me today :P",
        "selftext": "So yeah, i just felt like sharing this song, that i like. I kinda feel better when i hear it :) [Nina Simone- Aint got no, i got life]  (https://www.youtube.com/watch?v=L5jI9I03q8E)Please feel free to post other songs.Greetings, kiri"
    },
    {
        "name": "t3_3i1p4x",
        "created": 1440332644.0,
        "ups": 3,
        "downs": 0,
        "title": "ocd",
        "selftext": "Hi Jason... i don't know if that is your name... but i really want to thank you as i read your comments about OCD and it motivated me a lot. i have problem of breathing obsession. every time i think of it... i get an urge to have a deep breath. when i do that, still i don't feel relaxed. i once had heard of hyperventilation. and afraid of that too. i had panic attack one year ago when i became aware of my breathing. since then i had this obsession. i went to psychiatrist once and had medicine for almost 6 months. then i discontinued it because my family members asked me to discontinue it. i don't want to have medicines. i don't know if i can find a good ocd practitioner here in India and the place i am living. i want some info that as to how can i practice the ERP in my case. when i am doing some work...i will have some backside voice as \"I need to breath\"...it is disrupting and causing concentration problem. i am a bachelor looking for a good job... i don't know why i am saying all this ... i just think that you can help me with your knowledge and advice. i am trying from my side to return to my normal life.please help and thank you so much."
    }
]