[
    {
        "name": "t3_jgkvry",
        "created": 1603479296.0,
        "ups": 9,
        "downs": 0,
        "title": "Traveller's schizophrenia?",
        "selftext": "I hear voices telling me to leave my homeland and go on an adventure in Asia ie thailand vietnam, china etc. Or to go to western europe in search of a better life. Are these normal. And then i start listening to british music, imagining i am living in britain, or listening to swedish music, imagine im living in sweden etc."
    },
    {
        "name": "t3_jmgi0z",
        "created": 1604317744.0,
        "ups": 7,
        "downs": 0,
        "title": "What are y’all’s opinion on Robert Whitaker’s anatomy of an epidemic as well as this Documentary about Finland having the highest recovery rates.",
        "selftext": "Open Dialogue: an alternative Finnish approach to healing psychosis. Research shows Western Lapland Finland has the highest full recovery rates for schizophrenia and psychosis in the world. https://youtu.be/HDVhZHJagfQTime stamps 28:45 33:50 ( roughly 70% of diagnosed by western standards schizophrenics living in Nigeria and India in a 25 year long study were asymptomatic and working at the end of the study ) 39:36 ( in western worlds we see a large number of people “disabled by mental illness” and employment rates significantly lowerd. With a selective medication manner we see the exact opposite. ) the use of neuroleptics are used in a short term manner and are actually given less frequently then say sleeping pills for people who are psychotic. I am one of the cases that is valid for use of neuroleptics however I can guarantee that if I was in Finland they would be supplying me with a much lower dose of antipsychotics as well as using them for short term use."
    },
    {
        "name": "t3_i1285b",
        "created": 1596203544.0,
        "ups": 12,
        "downs": 0,
        "title": "I have a schizophrenic sister and don't know what to do",
        "selftext": "My sister , who is 10 years older, was first diagnosed with psychosis when i was around 14... later when my parents noticed a change in her behaviour the took her to her psychiatrist (i think) and she was diagnosed with schizophrenia( about a year ago) I'm from India so there isn't much awareness and mental health isn't something people are open about and often stare and talk crap about someone that has some mental health issues. I don't even remember what she was like before  (i.e her likes and dislikes) all i know is she's very soft spoken and sensitive. I don't know how to talk to her because all she does is stare at me everytime i try the most i can get out of her is a  nod in agreement and very rarely a hmm or a proper answer. Any tips on how i can get closer to her or support her?"
    },
    {
        "name": "t3_epexct",
        "created": 1579181410.0,
        "ups": 1,
        "downs": 0,
        "title": "To those who liked my videos, I'm getting back into it with a new account. I'm currently getting the footage for a Requiem for Dream parody if you only smoked weed. In the meantime while this isn't mental health related here is India getting thrashed in cricket to Yakety Sax. Bon appetit!",
        "selftext": ""
    },
    {
        "name": "t3_iemi0g",
        "created": 1598145885.0,
        "ups": 3,
        "downs": 0,
        "title": "Book - Empathy of Delusion.",
        "selftext": "&amp;#x200B;&amp;#x200B;So, most people here express themselves towards the art of drawing, or painting. I do that with literature. I'm schizophrenic and I just started writing a book about a protagonist with a mysterious gender (I don't reveal it with pronouns like she, he or they) that suffers from schizophrenia and on my own way, I relate some of my psychosis on the protagonist life, with experiences coming from myself. Other things are purely by my vivid imagination. I like to be very descriptive and specific on storytelling. There are references to *ars et scientia* and the genre is sci-fi. There are brain chips that injects substances on someone brains, A.I., upload of consciouness in simulations, colonization of Mars, an union between socialist India and China and other things I better keep saved for you to read. The main goal of the protagonist is to find a cure of the illness, but that's not explicit in the start of the book, it became explicit with the social interactions the protagonist do.I hope you have a good time reading! Also, feedback is always welcome.Here is the link to the book: [https://www.wattpad.com/story/237430719-the-empathy-of-delusion](https://www.wattpad.com/story/237430719-the-empathy-of-delusion)&amp;#x200B;https://preview.redd.it/y9ljh73nali51.jpg?width=878&amp;format=pjpg&amp;auto=webp&amp;s=bb5804c824611021aa82b28cc36f585b8d39c1b2&amp;#x200B;"
    },
    {
        "name": "t3_dg568c",
        "created": 1570773115.0,
        "ups": 8,
        "downs": 0,
        "title": "The psychoanalysis of a teen turned youth and his problem with porn and his emerged schizophrenia from this porn. And the cultural tradition of india",
        "selftext": "Today I have decided to quit porn forever , i.e , 11th of October, for my own good health ,both mental and physical. I have been trying to quit for past few days very seriously but the gravity and longevity of my addiction holds much more than its levity and evanescence. For I know that it's nothing compared to what I can achieve in my real life but the allure of porn always push me toward it for it being easily accessible and my past experience of abstaining from it causing schizophrenia which I will elaborate later. I have been watch porn regularly after I had relapsed one year back on 23rd of April which was a consequence of my mental health deterioration and I was taken to a hospital for my mental check up. There I had the voices in my head telling me that all the nurses and doctors are trying to seduce me in my thought and that was the urge that I gave into which made my addiction to reemerge and that would take another 2 year for me to decide not to watch it again today and by writing it in my phone made me look like more serious of giving upto these urges. \rI have written down my secrets that a few know and those secrets are not known to a single person. It's like opening your inner self to one person , and then opening your much darker secret to somebody else. The person I most believe in is my friend who I know would abandon me whenever he is put to test. Maybe that assumptions is for myself as I am known to abandon friends and acquaintances whenever they are in need of. I have always believed myself to be hard willed , sharp in mind , and to leave anything which I found to be not much worthy of my respect and time  . But I have turned out to be wrong . I will lead from now with a story that you may find intriguing. Maybe my lack of word power in English can make me incompetent of telling my story in a more comprehensive manner but nevertheless I will proceed:-\rThere was a time when I was young and restless. I had all the desire of being successful and to have the knowledge of the world . And for that I started to read everything that would come up to me even the match sticks. I found reading to be much more valuable than anything else even the family . This was the time when I was around 12. I had not explored the world , even now I haven't but with the technology in my hand now I am trying to garner as much knowledge as I can then to try to pass it to others about how the exploitative mindset of our own leaders, you can also call them guide if you are on that side of spectrum where you conform to every single things that's mainstream, leads us to our own destruction, morally and ethically , like sleeping with girls and exploiting them as done by our own Mahatma Gandhi , even though I haven't read his autobiography , I can tell that from what I have heard of his writing about his sexual deviation and his desire to check this by sleeping with two teenage girls , which made our society so downgraded that I feel shame whenever I walk on this wretched land of mine , i.e India. For you may have heard of India and it's view of sex as a taboo to be discussed in open. It is the thing people take pleasure from in night but in day it's like there's nothing called sex and there is so much shame running around in this country about sex that I would suspect even the most progressive of writers like Nivedita Menon take upon herself to break the taboo around it. I , therefore , respect a much better writer , i.e Arundhati Roy , who is far more open about taking up issues like this to bring it in open. I guess this would have to do with their differentt backgrounds and both being from a Brahman family, I guess that would have to do with their experiences with it , one conforming to norms and other breaking it. Befor I proceed to my story I have a story to tell of this two writers which I have made up in mind .\rSuppose there are two girls from same family, a lower caste shudra family. One who is far more expressive than her sister. And other is just going with the flow but within her harbouring a much more rebel nature in her to revolt against anything that comes up her way. One is against a one section of inequality and other against the whole system. Whom would you support ?Let me help you by giving you some more example . One has watched her mother , her sister , other women being oppressedby their male counterparts , not just their counterparts , they are being ‘oppressed’ by their own children that is male . And the other one who has watched the suffering of both and much more the sexual exploitation of girls and boys alike , one boy might be her brother, and both have spoken openly about this when they got to know the nature of the suppression , it’s effect on the mental health and their physical stuntness which has caused to behave more like an insane person . Whom would you support? For me I have chosen the latter one to be my guide because in this epoch of India , i.e 2019, I believe that suppression happened on both side , maybe one has material gains which can be obtained from oppression but the other has spiritual gain which can be only obtained through suppression of other's feelings because they have been devoided of the material gain. It is my opinion only . I don't think of you conforming to my illusion but nevertheless I will proceed .  The fact that one has been spiritually suppressed can be best understood as the number of intellectuals that are really intellectuals being women . And the number of materialist who are men. From this perspective I have gained insight on the spiritual nature and material nature. Now with two girls . One who is wholly for the spiritual gains decided to point out the material inequalities that have been bequeathed on women , because gaining spirituality has become her nature , her intrinsic one as is embedded in her through long years of oppression of her kind . And the brother I talked about totally in for the material gains decided to point out the spiritual incapability of his only to gain more material as has become his intrinsic nature . But one who has found a silver lining between these two and set out a path for herself , for she is the seeker of truth , decided to point out the system and in every circumstances giving a hand to oppressed or suppressed like his brother and sister who have taken the path of their destiny without ever questioning it. I have not specified upon the brother because I don't find myself gaining control over material thing , for I know spirituality preceds materialism .if you have been spiritual enough then you might not need look for the material. But for surviving material is also necessary which I think have been forgotten by the oppressed section that have come to their mind rather late.But the economy is run by materialist which I think have been so suppressed that they might have took a dive in the darker areas of human nature which is what ruining us or might be making more knowledgeable about our dark ambitions. That's why I am going to be focused on the two sisters. For it is a positive article which I have written for myself to make me come out of the dark. Now the two girls I am talking about are Nivedita Menon and Arundhati Roy both excellent in their own domain. But I guess I would rather walk a silver lining than to go treading on the positive area because for me I can't even I try to because I have spent so much time in the negative areas,i.e materialistic in nature , that it might not be possible to me walk on that positive area because there is also suffering and pain. Pain adjoines everyone irrespective of what they might be doing , even a sleep can cause pain , a pain of time lost. Therefore it is imperative to me to first find a silver lining at which I can cling my faith onto because it's the only place that one can keep an eye on and stretch their hands for because on the both negative and positive areas there is not much to hold onto. One's a deep sea where you have to dive in without putting a oxygen mask on waiting for to last your breath but if you have that insight that you can't go further you hope for the surface and that is what for me is a silver lining. And the other one is the sky where you have not yet learnt to fly but will only hope so when you are at the surface . So for me this silver lining is important . For this silver lining will open the scope for my further growth. I have desire of leaving the silver lining as soon as I reach there but in the contrary I have the desire of going every length of that silver lining and explore it then learn to fly . For me that brother is deep into the sea and yet he is the king of the underworld he can negotiate with the queen of the sky to give him passes which can make him fly for a brief period of time and he can in return help her elder sister dive into sea and explore it for a short period. But the one who is at the silver lining has to suffer her for eternity even though there is no suffering here but we can never know what suffering means to someone who has not experienced any suffering . For her it might be the suffering of not feeling suffering. There's another girl , who is the 3rd sister , on the silver lining which work cooperatively with her at the other end in holding the line. Both have come from different area of experience , one has the experience of sea and one has the experience of sky but they decided to not go further and settle down at the surface and help the people coming from death or life to go into the other world.i have only decided to make the two girls my main character because they are much loved by the so called intellectuals who wants to fly into the sky but to also know the little secrets about the sea . \r_ To be continued"
    },
    {
        "name": "t3_fj6ydd",
        "created": 1584329383.0,
        "ups": 4,
        "downs": 0,
        "title": "I hear voices. And they’re racist.",
        "selftext": "Also poster on r/blackladies I started hearing voices about a year ago. They tell me that racism is a real, metaphysical, spiritual force. It’s connected to my body and this feeling that I feel. It’s connected to what I perceived was God and spirituality. They tell me that I’m a nigger and that they have proof based on this feeling that I have. They say that I’m in hell, that I’ve been there, and that I’m going back. I’ve been to this realm that they’re saying exists and it’s nothing but pure pain, what a nigger would be if that were true....crazy, I know!!! The interesting thing about these voices is that they prey upon the most traumatic beliefs that I had after I experienced trauma abroad (I went to India and experienced extreme colorism).  Edit: I am black!!One thing I forgot to mention, which is CRUCIAL is that the voice is someone that I know, a white man named  Brian. The voices say that he’s God and that he knows that I’m in a n*gger. Any thoughts on psychosis induced by a specific person?? What’s going on with him??I know that what they’re saying isn’t true. I know who I am. I would love insight as to what might be going on (product of trauma, clearly), as I’ve never heard anyone share an experience such as this one. The interesting point, too, is that I had a spiritual awakening when I was eighteen where I experienced myself as God (wild, I know) and it was easily the best experience of my life. The voices say that this doesn’t matter/isn’t true. How can I integrate this experience into my thought patterns to combat these evil voices? Does anyone have insight on racism as a spiritual/metaphysical matter as opposed to a social one? Has anyone ever experienced racism as an energetic force?All thoughts/opinions are greatly appreciated. Thank you for your time!"
    },
    {
        "name": "t3_9ttve6",
        "created": 1541278700.0,
        "ups": 8,
        "downs": 0,
        "title": "Brother missing and I am a wreck: India",
        "selftext": "Hello everyone,My brother is still missing he left home on 23rd sept 2018. It has been 40 days that our family is at a still. We went to places where we thought he will be at and still couldn’t find a trace. The police is not able to do anything since he is not carrying any phone or credit/debit cards with him. There is no news of him at all. He is schizophrenic and was taking his meds. But recently was drinking an entire bottle of cough syrup everyday. We did not know about it because we have learned to give him space when he goes out of the house to buy something and we learned to trust him with his life as always. And he has never been happy in the family or with the family rather because we are very dysfunctional. My mother is also schizophrenic, who never wanted meds and chose to step away from the family 11 yrs ago which made my brother hate me and my father because he thought he are the ones to blame because my mother blamed us. Even she hates me to the core. She recently stayed with my brother during his job switch and that messed up both of them. She pressured him to be back on the family. But she never spoke to my dad about it. She doesn’t understand that it is between her and dad that she comes back home or not. She has always involved us kids in the conversations. Now she is home and still isn’t okay mentally. But still won’t take meds. So I am not pressuring her because now she’s 52 and she feels I am cruel etc and she gets very violent at that. And I get scared that I don’t want to piss her off because if my brother comes back anytime I want him to find a peaceful home and I feel it is karma Even I was diagnosed with bipolar 2 which I managed out of because I got medicated very early on 15. I am shitting bricks that my brother is not home and it is all my fault that I couldn’t understand him and help him better. But I did what I could for him. He used to be in my thoughts all the time.i got a little overprotective but when he told me that I was dominating I stopped giving him any advice as an elder sister. Then he blamed me for not helping him out and that I was a horrible elder sister. I don’t know what to do. There were only 2 anchors in my life. My granny whom I lost in jan this year and my brother. Now I don’t know what to do. I following up with the police. Posting on Facebook groups. What more can I do?Can you guys share your homeless experiences with me ? And are there chances of his return considering our family situation?Also anyone from India who can let me know what more can I do to find him out ?Thanks a lot and sorry for babbling "
    },
    {
        "name": "t3_9xyxhm",
        "created": 1542509739.0,
        "ups": 1,
        "downs": 0,
        "title": "Question about schizophrenia in India",
        "selftext": "In India, where people aren't really aware of various mental illnesses, I see tens of homeless mentally-ill persons, wearing dirty clothes and carrying huge trash bags all the time.On Reddit, however, I see people who can frame proper sentences, leading normal lives and being very much aware of their condition.Is it due to better medical facilities or am I not reading about the homeless mentally ill in western countries?"
    },
    {
        "name": "t3_f7y1h8",
        "created": 1582431103.0,
        "ups": 0,
        "downs": 0,
        "title": "homeopathy",
        "selftext": " Hello FolksI am just curious if any of the members have had success in using homeopathy for psychiatric illness.I have heard of many cases in India where patients were able to stop their medication or reduce it substantially using [homeopathy.](https://homeopathy.one/)One of the successful psychiatrist is Dr.Mahesh Gandhi,who left allopathy and became homeopath as he felt the medications were drugging his patients.It would be great to know about the experiences in the west."
    },
    {
        "name": "t3_dkremr",
        "created": 1571641299.0,
        "ups": 4,
        "downs": 0,
        "title": "Whats the esoteric meaning of snakes and ladders",
        "selftext": ""
    },
    {
        "name": "t3_cy9xif",
        "created": 1567373286.0,
        "ups": 16,
        "downs": 0,
        "title": "Welp",
        "selftext": ""
    },
    {
        "name": "t3_8gk2k1",
        "created": 1525317555.0,
        "ups": 2,
        "downs": 0,
        "title": "Any Schizophrenic's from India?",
        "selftext": "I am a sufferer of Schizoaffective disorder"
    },
    {
        "name": "t3_6p9sfr",
        "created": 1500945095.0,
        "ups": 1,
        "downs": 0,
        "title": "\"If u were a good friend of mine in India, I would have......\"",
        "selftext": "within the past year or so i went to a mental health/illness convention sorta thing. there was a Yogi/Pharmacist there who i met through my mom because he was her Pharmacist. then he was my pharmacist. he was very knowledgeable and well versed in yoga and meditation as well as a lot of pharmaceuticals. he was doing some subtle chair yoga and a guided meditation which imo is fuckin amazing!!! most of the time me and almost everyone else falls asleep and somehow we wake up at the last minute or two. its  Perfect, Wonderful, and i EnJoy his guided meditation Very Much! (:Eventually i brought up schizophrenia. then the Yogi/Pharmacist said this to me \"schizofriendinya... if u were a good friend of mine in India i would have brought u to some Yogis/Saints/Mystics to learn Yoga, Meditation, and other techniques to help u deal with this... I dont believe or think that medication like anti-psychotics are right for every case of schizophrenia.\" I know that they use antipsychotics and other medications for schizophrenia in India. Ive also read that for the most part in India their voices are Positive, PlayFull, Funny, HelpFull, etc etc...... whereas in the western part of earth voices are mainy, negative, rude, etc etc...I did ask him what techniques, but he didnt want to discuss those for whatever reason. maybe so that i wouldnt search them to try the techniques on my own. just for my safety.Shortly after i was diagnosed 2 years ago i met with this Yogi/Pharmacist and he described schizophrenia as very simliar as being a deep sea diver where if u are not trained u are going to drown. ive also heard Jung talk about this where he was talking to James Joyce about Joyces daughter who Joyce thought had a mental illness and said \"the only difference between u and ur daughter is that U are swimming. She is drowning. the Yogi/Pharmacist also told me that Yoga, but mainly meditation has the same idea of swimming. if u try to enlighten or transcend yourself or whatever then u are most likely going to drown. and even if u get a teacher that seems knowledgeable and wise on teaching u the techniques on how to dive deep without drowning if u and the teacher are not extremely careful u can still drown.ever since the Yogi/Pharmacist told me about \"if i was his good friend in India....\" I have been very Very VERY Interested in what techniques i would have been taught :/"
    },
    {
        "name": "t3_cbj1oe",
        "created": 1562805690.0,
        "ups": 5,
        "downs": 0,
        "title": "[RESEARCH SURVEY] [MOD PERMISSION ACQUIRED] Call for participants diagnosed with Schizophrenia regarding a survey dealting with Sleep.",
        "selftext": "Hello guys!I hope you're doing well. My name is Mohammad Abdullah Sarkar and I am an aspiring clinical psychologist. I am still an Undergraduate student and this is a research I am carrying out regarding the sleep quality people diagnosed with schizophrenia receive. I belong to Aligarh Muslim university, India. If you choose to click the link below, you'll be taken to a Qualtrics survey where you'd be asked 19 MCQs and also asked to write a bit about your sleep pattern. It won't take more than 10 minutes if you're quick. I hope you'll be able to help me out and advance the current literature present on the topic. Information regarding the survey is present within it. Best wishesQUALTRICS SURVEY BELOW[https://qtrial2019q2az1.az1.qualtrics.com/jfe/form/SV\\_0ozMnNcNpNCOzR3](https://qtrial2019q2az1.az1.qualtrics.com/jfe/form/SV_0ozMnNcNpNCOzR3)"
    },
    {
        "name": "t3_bj5wiy",
        "created": 1556673357.0,
        "ups": 2,
        "downs": 0,
        "title": "Anyone else on Risperidone and Escitalopram? What is wrong with me? Any side effects?",
        "selftext": "I've had MDD in 2016, and got over it in a year and a half, now I'm again on something. I'm from India, the doc just gave me this prescription since he knew from back then. I've read that one is a psychotic and the other is a mood stabilizer.Also any side effects? I've read up online about various things and they seem scary. I've been on Escitalopram before and it was tough, no idea about Risperidone.Crossposting it."
    },
    {
        "name": "t3_b7uzo1",
        "created": 1554107528.0,
        "ups": 5,
        "downs": 0,
        "title": "Aspie/Schizo Misdiagnosis?",
        "selftext": "We all get that feeling sometimes....\"am I misdiagnosed?\" Not being neurotypical can mean so many other things... neurodiversity comes in different forms and shapes... I was diagnosed with paranoid schizophrenia in my late teen years when I didn't leave the house and suspected that my peers had poisoned me ...  that was the onset of my illness. I didn't see figures, or imagine voices in my head... but I had some delusions of grandeur and ideas of reference. I have been on Olanzapine and Quetiapine (don't remember the dosages)... and I was under the impression that my peers are all against me..so I just used to chat with people all day on the computer hoping to find someone who can understand me...later on, allegedly at one of the best psychiatric facilities in India they diagnosed me with \"internet addiction\"... my hope was lost in Indian psychology. I was taking Aripiprazole , Escitalopram and Naltraxeone back then. A few months ago, I went to another psychiatric facility and they did some really oldschool tests on me ( Rorschach, TAT, MMPI)  and said that I might have Schizotypal personality disorder with schizophrenia unspecified (non-organic psychosis)...but finally decided that I am on the high functioning autism spectrum... this has changed a lot of things (aripiprazole with setraline) and even though I was skeptical of this too...my [RAADS](https://www.aspietests.org/raads/questions.php?show=b3b3eac9356348&amp;locale=en_GB) results say I might be on the AS... One of my online acquaintances who went to the aspergers IRC, told me I might have it tooMy problem?I don't relate to aspie people...I am definitely NOT a savant, and more like schizotypal from my own perception... and I am not that cold either... I have tried talking to the aspie community and feel like having an IQ of 107 is not good enough for being called an Aspie. I feel like they all look down on me, because I don't have a hobby/interest I'm good at.but I don't relate to paranoid schizophrenic people either...Anyways...**Not asking for diagnosing advice**I'm just curious if anyone has similar misdiagnosis experience with schizo/aspie. "
    },
    {
        "name": "t3_aq7g1q",
        "created": 1550098970.0,
        "ups": 7,
        "downs": 0,
        "title": "Missing schizophrenic brother. I am really worried how to find him",
        "selftext": "Hello everyone,I am here to ask for help. My brother has been missing since 23rd sept 2018. He just left home without saying anything and went to the bus stnd. Post that we dont know where he went. No one saw him post that. India doesnt have a system where he needs an ID to get on any buses. So we do not know where he went. No phone. No cards. I have been looking for him for so long in different cities where the chances are. 1. Created a facebook page to create awareness. https://facebook.com/HelpFindShubhamMehta/2. Put up posters in different cities so that anyone can cal if they see him. He is very tall 6 feet 5 inches. India doesnt have thay many people. He said he was in a bad state and it was all because of us a day before he leftSo I am not able to understand if the efforts I am putting in will drive him away ( some people are saying so)I am just so scared to make efforts. Please let me know what all I can do to find him. Police is not able to help out at all because my brother did not carry any identifcation or phone number or cards. Also, please share with me some hope. I am totally in shackles as he is my only brother and I love him beyond anything. I just couldnt show him enough of that when he was with us. He always hated me and my father. My mother also has schizophrenia and she chose to be away from us when we were children as she did not want medication. My brother was telling me in Sept that he doesnt want to keep any connection with us because we make it negative for him but, we always tried to make it positive for him. Maybe we did not try enough. He also said that he felt like running away sometimes. Guys please share as much as advice and information as you can. I am in dire need"
    },
    {
        "name": "t3_asfh6n",
        "created": 1550639525.0,
        "ups": 16,
        "downs": 0,
        "title": "\"If someone calls you crazy, is it sane to agree with them?\" Food for thought",
        "selftext": "\"Ralph Ellison stated in his novel, The Invisible Man, that if one does not know where he is, then he does not know who he is. Our contexts define us to a great extent, and a lack of context has implications regarding how we do or do not define ourselves. For example, if a man does not know he is part of a circus, then his behavior will not make sense to him or to other people. Although this is a primitive and graphic example of how self-definition impacts one psychologically, it is nevertheless clear that if we do not know our contexts, we do not know ourselves. This reality has particular implications for those who endure schizophrenia.\"\"The fears that the paranoid schizophrenic experiences may be always mutating, therefore impacting negatively his sense of context, as this context mutates to accommodate new beliefs. Given this, he may inevitably have difficulty in defining who he is.\"\"The difficulties inherent in creating an identity as a mentally ill psychotic individual are daunting. Not only are the mental and the material worlds nebulous as a consequence of experienced delusions and hallucinations. The experience of auditory hallucinations is understood by the psychotic individual to be “entities” of some kind who are witnessing his thoughts. He may be said to experience psychological nudity in the mental realm. The paranoid schizophrenic may view his experience as life-threatening, and the confrontation with death, real or imagined, is both nebulous and engulfing.\"\"The experience of psychosis is ambiguous, nebulous, and it implicates a lack of an identifiable context. It should be understood that the *quest of the schizophrenic may be simply to find an ego-syntonic identity.*\"- Source: https://www.psychologytoday.com/us/blog/theory-and-psychopathology/201402/identity-in-the-context-schizophrenia?amp----\"Upon reading the statement in the preceding paragraph, “…people who have made full and lasting medication-free recoveries from schizophrenia…,” it’s likely that many readers did a double-take. Yes, you read this correctly. Contrary to this widespread myth about schizophrenia, the research is quite robust in showing us that *not only is full medication-free recovery from schizophrenia possible, it’s surprisingly common, and is actually the most common outcome in many situations*8—such as in many of the poorest countries of the world, such as India, Columbia, and Nigeria, and as the result of certain psychosocial interventions, such as the Open Dialogue Approach used in Lapland, Finland.\"\"And they all expressed having to overcome significant inhibition to this factor coming from the mainstream treatment they had received, which typically included *strong motivation-inhibiting drugs (antipsychotics in particular)* and the advice to generally lay low and avoid stress at all costs.\"\"So we find ourselves in quite a predicament. On one hand, it’s considered extremely dangerous to suggest that those diagnosed with schizophrenia should consider coming off these drugs, and even the mention of this possibility is considered one of the worst forms of taboo within the mental health field; but on the other hand, the research suggests that for many people, this is exactly what is called for. Of course, the research also shows that coming off these powerful drugs is very risky and should be done very slowly and under the careful guidance of a professional.\"- Source: http://www.brainblogger.com/2012/05/29/full-recovery-from-schizophrenia/----In dealing with my own psychosis, delusions, and hallucinations - completely undiagnosed and unmedicated, (I'm an American southerner and I quite like my southern priviledges) some things I've learned from my own life experiences, mindfulness, and, of course, reading, which I wanted to provide some literature here. I've often struggled with my own identity - coming from a miserable life at home with a quitely so broken family, where psychological abuse and neglect was part of every day life both when I was a toddler and a teenager - and I found via meditation, in my own madness, simply the possibility of unmet needs for many things such as the need to find out who I am, and having the support to do so. As a matter of fact, perhaps such statement resinates with many of you.That said, I know how much of you are; I can relate, which is why I've provided some text snippets for y'all to over-think and over-contemplate. I'm still on my own journey to establish harmony with both my self, my *lifestyle, my ego, and the world, and I cannot lay the path out for you guys - I'm neither licensed, nor have I even figured it out. *(How many of you have, perhaps, built toxic prisons for yourselves just out of familiarity with it, such as staying in abusive relationships, as opposed to seeking to free yourself just only as a means of building a more fulfilling lifestyle and system of beliefs? Challenge yourself, challenge your voices and preconceived notions - oh the relief of proving them wrong!) But I can say this: to get that resolve, have hope, and nurture your can-do attitude. Do what you need to do. Perhaps try to make sense of the voices; meditate. Observe yourself, perhaps as you've done before via dissassociation. Self-Improvement, including self-discovery, and meditation is perhaps one of the best medications for any mental illness. Don't give up; if poor blokes in more undeveloped countries can acheive resolve, why can't you?Just some food for though. "
    },
    {
        "name": "t3_9lwq3r",
        "created": 1538868124.0,
        "ups": 1,
        "downs": 0,
        "title": "My brother left home",
        "selftext": "My brother is diagnosed with Schizophrenia and wasn't taking his medication on time recently. He has struggled with the disorder for a long time now. He was properly being medicated since he was 13 till 17. Then he went to college in the different city and stopped his medication. Did some pot and other silly things with the boys in college and had his first psychotic episode. Post which he returned home and took medication from a different doctor for a short while and then went back to do his job. India being a shitty place of people who poorly understand disorders, doctors also never guided us properly on how to cope and help my brother. I was myself diagnosed with bipolar and have been having issues through my life as well. My parents are separated because my mother did not want to take medicine for her disorders and her family supported her and were against my father.&amp;#x200B;Sorry for blabbering. but, now my brother has left walked out of home last month without his cellphone and ATM cards. He just took some cash and no clothes. I am shit worried. Will he come back home? Will he be safe wherever he is right now?"
    },
    {
        "name": "t3_9ifptj",
        "created": 1537799962.0,
        "ups": 2,
        "downs": 0,
        "title": "Mom having delusional hallucinations",
        "selftext": "Hi Reddit,I live in SF and my parents live in India. Just today my mom has a delusional hallucination episode, where she claimed that she had to save someone from a negative attack from the astral world. And apparently, someone will be picking her up form her city and taking to LA, where she will help a certain spiritual organization to overcome the attack. 1. It only seemed today that she has some kind of mental issue. Because she wanted to leave today itself. (And there was no ticket/ or any communication in real life). I spoke to the spiritual organization and they said that it seems to be a mental issue, and there have been few cases where people claim to have a direct message from God. And asked me to take her to a psychiatrist.Though it became a bit extreme today, I do remember several incidents where she claimed certain spiritual experiences which seemed to be out of reality.2. My question to the community: How do I convince her to visit a psychiatrist? She is so much convinced that she is the divine incarnation, that it is very difficult to convince her anything. I am travelling to her asap. I told her that not to go anywhere until she gets the tickets in hand. And also How do I handle this situation ahead?Note: I just had got a call from my mom and this drama unfolded. I am shooting this to multiple reddit mental health communities in hope for some guidance. Please PM me or ask for any more details."
    },
    {
        "name": "t3_8hcnrb",
        "created": 1525606663.0,
        "ups": 10,
        "downs": 0,
        "title": "what is suitable work for the one whobhas been diagnosed with schizophrenia?",
        "selftext": "One of my close relative is diagnosed with schizophrenia long back. We are giving him medicines and he seems maintaining sobar state. But does not work at all. Just sits at home all the time doing nothing. Not even watching TV or browising. He wants to work and we also want him to work so that he becomes busy with work and that may improve his over all life. He has done one or two small jobs but he coudn't continue with them. He does not have any hoby etc and almost no interest.Can some one suggest some work that he can try without stressing much? We are even happy to invest and open small grocery shop, but not sure if he would be able to run that. I am from India, there is very little help available here from mental care area and in general people dont treat mental illness patient well. "
    },
    {
        "name": "t3_7pdnrx",
        "created": 1515593087.0,
        "ups": 5,
        "downs": 0,
        "title": "Summarized history of 15 years with Schizophrenia symptoms. Current problem - Can't seem to get proper sleep, no matter what.",
        "selftext": "**tl;dr** - Brother has long history of Schizophrenia/Bipolar/OCD/Psychosis symptoms (started around 19year of age, ~15 year ago). Have been taking various medicines (details below) regularly since then, and most original symptoms are under control. But the main problem in last few years has been lack of proper sleep (and sudden rage over seemingly trivial issues sometime). He has trouble falling asleep, and even after being in bed for 10+hrs feel like his sleep is not yet complete. Any suggestions, your story, medicines, anything else you can share is much appreciated.*Current medication:* Quetiapine (Seroquel) - 300mg/day, Clonazepam (Clonotril) - 0.25-0.5mg/day. Occasionally Melatonin. All medicines are taken during night.**More details**Posting this for my brother (with his permission), who was diagnosed with Schizophrenia arond 2003 (was ~19year old then). His original symptoms (during initial years) varied, and included (not a complete list):* Feel like someone was capturing his mind and laughing inside his brain.* Feels that \"negative energy\" was leaving his body via area around heart. He actually cut holes in his T-shirts around heart area so that \"energy\" can leave.* Stopped eating for almost 6 months, claiming he can survive on energy from Sun. He barely ate anything during this period.* Lack of emotions and general apathy One persistent theme of all his symptoms, in particular his own belief (which he holds till date) of why he has these symptoms is [Kundalini Psychosis](https://www.mentalhealthforum.net/forum/thread28047.html). I should note that we are from India (and Hindu), so believing in power of Kundalini/Yog/etc is part of the \"heritage\" and a very common deal. Unfortunately he takes this belief to extreme. He believes that he has \"awakened\" his Kundalini which control powers of the body and that's why has all these problems, and these are expected to last a few life-times (before he attains Moksha). If you are not aware of what \"Kundalini\" is (very likely), then just think of it as a culture specific thing he believe in, where one can tap into infinite power of one's own body at some cost (and he thinks he is paying these costs right now).**Medicinal history:**We have consulted several doctors over last 15 years, and tried all kind of medicines. **Different doctors diagnosed different diseases including Schizophrenia, OCD, Psychosis, Bipolar disorder, etc**. As a result we tried various medicines including: * Clozapine - had some pretty severe side effect. He remained very calm during the course, but became almost zombie like (couldn't even do most basic tasks).* Fluoxetine* Aripiprazole (Arip) - this lead to intense restlessness and he could barely sit still for 5-10minutes.* Luramax (40mg/day) - We tried this recently, and it made him little more alert, but had  the side effect of cultivating suicidal thoughts in him. We stopped it immediately.* Many others .. I can find out the whole list and paste here is someone is interested.**Current medication (going on for 4-5 years now):** Quetiapine (Seroquel) - 300mg/day, Clonazepam (Clonotril) - 0.25-0.5mg/day. Occasionally Melatonin during night. This current medication seem to work ok for him (at least better than alternatives) - in terms of balance between side effects vs impact. He is relatively alert during day, and can do basic tasks once he wakes up (which is usually around 1pm in the day).Almost all of his hallucination related symptoms are gone, but his biggest residual problem is sleep disorder. He can not fall asleep without taking the medicine, and never feels that he had a complete sleep. Almost always (despite being asleep for 10+ hours) he will complain that he didn't had a full night sleep and was either dreaming too much or just couldn't sleep. He usually goes to bed around 11-12pm and wakes up at 1pm in afternoon.This causes his entire day to be sluggish and he takes more than 3x time for every normal task (like taking a bath, getting ready, etc). Does anyone has experience with problems like these ? Happy to share more details if needed.*PS: He still has several behavioral disorders: mood swings, too much remorse of even small mistakes and sudden rage (sometime over really trivial things). And in general he has a general lack of emotions and apathy toward everyone in his life. It's manageable but definitely not ideal. But frankly at this point it is hard to really know what are his actual symptoms vs what is a side effect of medicines he is taking (and has been taking for past 15 years).***MORE INFO (added after comments started trickling in)***Sleep Apnea*: For those who have asked about Sleep apnea - We had the in-lab overnight sleeping test done around 4-5 years ago, and if I remember the answer that time was it isn't sleep apnea. However I will definitely persuade him to get tested again.An interesting piece of information is that he always gets up on time (around 7-8am) the day after he fasts. So my brother actually fasts every Monday (eats nothing entire day, but does still take his medication on empty stomach), and he always wakes up on time on Tuesday morning. Although he still occasionally complains that his sleep isn't yet complete, etc. But on average Tuesday's are his good day.**His day-to-day life**: He is married for 4 years now with a child, and runs a small business of his own. Although he has lots of trouble managing day-to-day affair of his business as he barely reach office by 4pm. He lives with my parents, and there is a lot of family support which help things get done and sometime absolve him of doing tasks which otherwise would've been necessary (has he been living on his own)."
    },
    {
        "name": "t3_79moke",
        "created": 1509385544.0,
        "ups": 5,
        "downs": 0,
        "title": "Phones can definitely read my mind",
        "selftext": "I've had a few different examples where I've been thinking of something and there's definitely been no conventional osmosis of information between what I've thought and the phone. Not even if there's some kind of cookie system in which I could have Googled the exact video or subject in my mind at work and Google linking the 2 systems to a user which is myself. Or the highly coincidental scenario of me telling someone about a particular old skateboarding video or video about Brian of Aragon from forever ago. Then cookies attributed to someone in my immediate vicinity Googling something from what I've told them. I never watch x games anymore and I've not had an interest in skateboarding or inline skating for a number of years. Yet considering I only use YouTube to watch music now, I was driving home and thought \"Those ramps they use on a skateboard must be pretty scary. I remember that time Danny Way jumped the Great Wall of China on one, that's some height involved\". What video is recommended for me on my phone when I walk in. An old video from like 2008 with Danny Way jumping the Great Wall of China. Obviously this is very hyperthetical, but the ways they can do this are able to be Googled!! D-D-darr, Google the news story where they showed a guy a picture and then they were able to use thought reading electro-sensors to recreate the image he'd just seen to the accuracy which he could have remembered an image he just glanced at. There's a kid in India who invented an assisted speech machine through using the way your sinuses unconsciously dialate. Thought reading is highly possible. Your phone runs on microwave/radiowaves similar to the ones emitted by your mind. Like the electricity generated by your body is emitted in static and I highly encourage you to Google this if you don't believe me. All biological organisms do this, that was the center of the plot in the matrix, like instead of a potato clock they were just using human hearts as generators. Obviously it's a movie but you can take my point about organisms generating an electric current is not make believe. The other way your phone could read your mind is through the microphone picking up the pitch of your exhales, and your throat/sinus muscles contract subconsciously when you talk to yourself in your mind. Something I've genuinely considered since being a 6 year old. Seriously though Google this stuff and tell me what you think. Please don't just type crazy or think \"sounds like something more complex than I the center of the universe have ever considered so it must be false\". Like please fault my logic lol I genuinely enjoy hearing what peoples' thoughts are on this and if you poke a hole in my theory I will be grateful and genuinely sleep easier at night :D. I'm not one of these hey I'm never wrong people because I genuinely think they're the biggest problem with man/woman kind. So guys/girls is this plausible?"
    },
    {
        "name": "t3_89ordx",
        "created": 1522871501.0,
        "ups": 5,
        "downs": 0,
        "title": "My friend thinks his room is bugged and that shadow people are following him what can I do to help him?",
        "selftext": "My friend has been experiencing symptoms of schizophrenia. I am no doctor but it seems like pretty common things you hear about the condition. Shadow figures following him around campus, strange voices, the FBI listening to him. He just went back to school so I think he may be stressed which is bringing the symptoms back out. He has been previously diagnosed with bipolar disorder by a doctor after he withdrew from classes for having a pretty bad episode. Family is heavily religious (from India) so I'm not sure how helpful they are with the situation even though they know about it. What kinds of things can I say to him to help him? Should I tell him outright that these things aren't real? I have asked him how his medication is working and if he sees a doctor at school. He says the meds don't work and he has spoken to a counselor and doctor. I'm just worried he will backslide and if there's anything I can do to help I would want to know the right way to approach it. He seems pretty functional too, he's been getting homework done by the sound of it but I don't know if he has a lot of friends on campus or extra curricular things to do. Thank you for any advice!"
    },
    {
        "name": "t3_8g3dsz",
        "created": 1525154916.0,
        "ups": 5,
        "downs": 0,
        "title": "Child of paranoid schizophrenic.",
        "selftext": "My father was dignosed of Schizophrenia in 1998.He tried to commit suicide this led to his subsequent treatment and further diagnosis of this.I was 6 years old then I to this day remember that day of his attemted suicide and have mental baggage of that. He is on Olenzapine 10mg for years and takes one pill daily. All these years he gets ECT every 12 months and he somehow managed to survive this disease. But now he's 61 years old and showing signs of relapse. He recently had minor surgery which was really stressful for him. He had fear of going under knife and was denying this hernietic surgery for years. After that surgery he complained about feeling  dizzy at first we thought (mother and I) it is his physical condition we ran all sorts of test and found nothing. This condition is now gone but now his mental disease seems to take over. He joined social media as to pass time as he's retired now from his job. He commented on one of  anti government dissent post on social media which is normal for normal person but he somehow thinks police are trying to catch him he has this irrational fear of police I tried to reason with him but he can't. He naively argues he wants to meet SP of police to plead with him of his innocence. But he's done nothing I can't explain it to him. I'm in touch with doctor of his we've appointment tomorrow with his doctor. But I don't know how to handle him how in the hell reason with him. If you guys can advise me how to do that it would be of great help. And all in this I've lost my ability to sleep at night I sleep at 10 pm and wake up at 2 am and feel sleepy all day. I myself going through a career resurgence of sorts and need to focus on it in order to get somewhere respectable in life. What could I do to better this situation?I'm sorry for my bad English I'm not good with the language. I'm  poor middle class Indian boy and all this stuff is overwhelming for me additionally situation of mental disease awareness in India is as such we can't express as much what is happening with us in society."
    },
    {
        "name": "t3_a4t2t5",
        "created": 1544451131.0,
        "ups": 2,
        "downs": 0,
        "title": "Over the course of the last week, I made three songs. I think they're good.",
        "selftext": "you can hear them here: https://www.youtube.com/watch?v=J2-Pb1HP8Ts The first one starts at 1:40. If you enjoy it I'd adore if you gave the whole video a shot! :D. It's pretty motivational and I really like it. I've been thinking. Another thing - I'd like to write another diary entry on here. For those that aren't new to this subreddit (that have been browsing for a while), you may be aware of the diary entries I used to occasionally do on this subreddit. Well, here's another one. As I am writing this I have just finished watching a Pewdiepie video. In this video, he spoke upon the phenomenon of youtubers asking people to subscribe to him, and shared an idea where his viewers could potentially, if they can and are willing, donate to the country india, the country who's channel he's \"fighting\" against for more subscribers resides. He made very valid points and painted a sad picture. As I watched this, it made me realise that, while I am a good person, I have a long long way to go before being at a baseline that I am comfortable with morally. I am too self-centered, and I need to work on that. Pewdiepie took his platform and made something genuinely good happen out of it, and that is heartwarming. So far, my videos have solely been for me. But the fact that I am gaining subscribers (currently at 320!) warms my heart and tells me that maybe there is the potential for more here.I want to make a difference, guys. I don't quite have success figured out yet, but I think I'm on the right path! What I've found out over anything else during these last few months is that I should be myself above everything else. That seems to work best. I run a blog called PointBlank. Its name is pretty clever - http://pointblank.blog/ . Get it!? It's literal. Haha. In all seriousness, I do, and it's on video games and music. I love doing these articles (I am planning to turn some of them into youtube videos, actually), but I like my diary style youtube videos much more. They're incredibly enjoyable to make, and just the fact that even one person out there seems to enjoy them absolutely warms my heart. Your support is what keeps me going. Really. I used to think I was a piece of trash, now I don't, and there's no doubt in my mind that expressing myself and receiving positive feedback on my expression was a major player in my eventual recovery.  I don't know what else to say. Just know that I am fighting for you. All of you are a huge motivator in me continuing youtube and trying new things in order to bring about awareness. yay!!!"
    },
    {
        "name": "t3_5tykbk",
        "created": 1487081762.0,
        "ups": 5,
        "downs": 0,
        "title": "How to manage life in college?",
        "selftext": "In fall this year, I'm going to a very reputable university (that's also challenging) in the US. I'm originally from India.I'm 19 and was diagnosed with schizophrenia 2 and a half years back. I am currently on Clozapine and Aripiprazole and have managed to control most of my symptoms.The problem is, I've already dropped out of college twice, albeit in India, and I fear the same thing will happen to me in abroad. I can't drop out again, as my parents and extended family are really digging deep into their pockets to fund my education, and I can't see them suffer anymore.Why am I going to the US? - well, the answer is simple - I have an immense dislike for India, and no matter how much counseling I get, I can't get rid of this deep-seated hatred, therefore, I am hoping I'll be able to live a less troubled life in the US.I, therefore, would like some advice on how to manage life in a university in a foreign country. I am naturally very academically talented and am hardworking, though I have trouble with extroverted people and social events in general. To those people who have gone to college with schizophrenia, I would be grateful for any advice."
    },
    {
        "name": "t3_8fm410",
        "created": 1524972240.0,
        "ups": 2,
        "downs": 0,
        "title": "Malassezia as a causative agent in paranoid schizophrenia",
        "selftext": "**Malassezia as a causative agent in paranoid schizophrenia**Trigger warningI believe my paranoid schizophrenia was caused by a common fungus known as Malassezia, most likely M. furfur, which may manifest itself in Tinea versicolor \\(self\\-diagnosed\\).What’s written in here has two parts to it. The first is based on personal stuff/knowledge mixed with some unreferenced information; this part may be seen as delusional crap given that am a schizophrenic. The other part contains passages from quality articles/case reports which may help me put forward an argument regarding my case. If you feel there is too much schizophrenia in the first part then please skip through till the first referenced title below.This was posted on an online schizophrenia forum and I post here without making any changes to it.I think Malassezia fungus began a colonization process a long time ago slowly spreading to my organs so it can end up with a body perfect for optimal, sustained growth. I suspect it manipulates the hypothalamus and the endocrine system. In nature, there are many examples of germs manipulating hosts’ behaviour like in zombie ants while certain infections in humans can lead to psychoses.Schizophrenia is a whole\\-body illness and this fungus covers humans from head to toe and is also found in the GI tract. It doesn’t normally provoke immune system reactions and little is known about it because it’s not easily isolated and grown in laps.I believe it’s also behind many health issues because it causes chronic swelling around the body. This fungus is highly responsive to \\(based on personal observations\\):§ Diet. For example: loves dairy/fats and hates coffee/citrus fruits/water.§ Hormones; like sex and stress hormones.§ Air; grows in humid and germy atmosphere such as the bathroom especially closer to a floor drain \\(gases coming out of the sewage system\\). This factor along with diet seem to produce the biggest impact on Malassezia in my body.§ Smoking.§ Immune system weakness.Some research findings about schizophrenia may be explained while considering Malassezia as a cause:§ Schizophrenia is more common in the city. This may be the result of having an extensive sewage network and much more sewer gases compared to a rural area.§ Schizophrenics in developed countries are less likely to get better. Developing countries lack sewer infrastructures which is good for schizophrenics given that this hinders the growth of Malassezia.§ Countries in Southeast Asia have the highest rate of schizophrenia. It’s hot and humid in these countries in addition to the type of toilet used in the region.§ Seasonality of birth in schizophrenia may be attributed to humidity in the months before or during giving birth when the fungus colonization increases and is more easily transmitted to newborns before their immune system fully develop.Simple personal observations about Malassezia \\(many bizarre stuff; I believe it’s very capable of doing things\\):§ When it gets into a favorable atmosphere for it to grow; it will induce a feeling of sleep in the host. For example; opening the window when its humid outside or using the toilet. I could literally hear abdominal sounds by simply walking into the bathroom just to wash my hands. It should be the fungus changing the endocrine system so that I stay longer in there by making me feel relaxed. It does it maybe by squeezing on the glands or through the hypothalamus or just because of rapid growth. I think it has the ability to make muscles and tissues contract and relax maybe by using tissue fat/lipids or by collective binding/adhesion. The human brain in 60&amp;#37; fat.§ If I eat something it likes like eggs then it will immediately narrow my GI tract so it can feed better and keep it for longer. This lead to bacterial overgrowth which weakens the host. A study found that schizophrenics have different throat bacteria while lactic acid bacteria was at least 400 times higher than in control subjects. On the other hand, drinking black coffee will widen the digestive system because the fungus is aversive to it and will try to eliminate it quickly. This is similar to IBS. Fasting alleviate my negative symptoms.§ Lime has been my greatest weapon against this fungus and I aim to convince others like me to at least consider Malassezia as the cause of their schizophrenia by performing the following experiment. At least 15 kg of fresh whole lime will be needed \\(I used 40 kg\\). Spread the lime on the floor according to your body so you can lie down on them, with your head, all the way down till the thighs, is touching the lime. Try to do this for few hours and change between laying on stomach and back; try to listen to any abdominal sounds. Ideally, you should be without clothes and use a blanket to cover yourself. Doing this will make you lose internal fats rapidly and drive a lot of the fungus out of your system \\(taking antifungal medications will do the same but this is quicker and more effective\\). Fat is what Malassezia feeds on. It will also halt what the fungus is doing to your body and you should be able to feel much better afterwards. You can also ingest lime peel; cut into small pieces. People drink lemon water to flush their digestive tract; I think this happens because Malassezia doesn’t like lemon and will try to avoid it. After your finish, keep the lime near the bed for no longer than a couple of days before it begins to grow fungus. Having the lime around you will still have an impact on the fungus even you aren’t physically touching the lime. Think of lime as a kryptonite to Malassezia \\(lime peel contains phytochemicals which are released by plants to thwart pathogens; maybe this is why it works\\). Another way to manipulate the fungus is to pour thick black coffee into a number of buckets and keep them close to you \\(I surround myself with 8 small buckets; 200 g of black coffee with minimal water in each; coffee will last longer than lime\\).§ If your schizophrenia is caused by this fungus and you want to observe how its impacting your body then it’s important that you make enough recovery first so that you become capable of noticing the things it does as it attempts to regain control of the body.§ It targets the immune system. I successfully got rid of a tinea versicolor patch at the base of my lumbar spine and immediately it felt as if some sort connection was reestablished within the spinal cord \\(I make the patches burst by applying heat using a metal; they release some kind of odorous gas as they burst; feeling the applied heat on the skin is instantly regained as these patches burst; I wonder if Malassezia produce and hold such gas inside the body\\). After a short while I can tell my immune system is more active in attacking the fungus throughout the body. These fungal patches have an adverse impact on internal organs including the brain and I suspect they greatly lower blood supply by constricting blood vessels/arteries. All of these fungal spots work within connected networks, so if you rub a lime against a particular spot for long enough, other spots will also be irritated somewhere else in the body. I believe a master patch which forms under the skin around the nasal bone, where there is increased sebum production, is what controls these fungal networks because it’s the most established and active of all. Fungal networking is known in mycorrhiza.§ It is careful not to expose what it does. It causes sickness very slowly over the years so the host remains unsuspecting and when the immune system becomes weak enough it begins a process that lead to psychoses. It won’t attempt to take over the host unless it has developed the necessary networks throughout the body. The first episode is when it takes control and risk exposing its pathogenesis but at the same time it desensitizes the host. We become numb, hardly itch, sneeze or cough; the mouth and eyes become dry while blood and fluids have a hard time circulating the body and it never allows the immune system to make a proper recovery.§ The way this fungus reclaims my brain after stopping the treatment feels like it constricts or tightens the sides and back of my neck area and the scalp feels as if it’s being pulled upwards. It feels as if the fungus forms an invisible circle around the head then I become oblivious again. In this way, my schizophrenia has its basis outside the brain; in the skin which is the largest body organ and has a role in both nonspecific and specific immune responses.§ It undertakes a process to make the host psychotic. The few weeks after my positive symptoms disappear is a time during which I feel most friendly and calm. I think this is due to having overall less of Malassezia formations in the body because inducing psychoses requires the master patch \\(the fungus in its developed form\\) to release many of these formations so that a number of selected processes, functions and secretions within the body resume while it retains other formations just to initiate a state of bodily chaos. As time passes my health, immunity and anxiety deteriorate gradually as the lost formations are built again. Hours before my psychoses begin it causes sepsis\\-like symptoms until I become paranoid and this happens after many patches appear at once for a short time throughout my body. Maybe this large release or activation of these fungal formations is what causes the mild sepsis or some kind of systemic inflammatory response.§ It becomes very active/pathogenic in the days before psychoses start and this is the time when I can feel it the most as my immune system is compromised. I can literary feel the fungus being active in my ears and when it comes into contact with my body during, for example, getting closer to another person or a floor drain in the bathroom. Things like passing by the sewer pipes in the building car space or being near the sea will wear me down. A member of the forum said that schizophrenia is “a yeast infection that grows in your ear”. I believe this is very true in my case but it also goes beyond the ear and deeper into the body.§ This fungus manipulates the hypothalamus to allow for better growth throughout the body. My body temperature remains elevated for a long time which is good for the fungus. It also causes fluids retention in the midsection and face as well as dehydration without making me feel thirsty. There is also insomnia. These functions are supposedly regulated by the hypothalamus. Moreover, sometimes it deliberately sends troops through the nose to the lungs so that they spread there without causing an overt infection; it just causes a slight occasional pain in the lungs. This happens before my psychoses or after taking a course of fluconazole.§ It will make new formations in any cuts in the skin or inside the body like in a tooth extraction. I get a rapid recovery due to antifungals but at the same time I get itchy knees; this happened twice. During the second time, I thought I could apply an antiseptic salve on the knees so I made 4 small cuts in the skin around each knee. The next day I can see new Malassezia formation on each of these cuts. With the use of antifungal cream, Malassezia formations became visible on and around previous surgical cuts around the body particularly in the abdominal area. In addition, increased Malassezia growth worsens pain associated with a herniated disc in my lumbar spine; I don’t know if Malassezia is already there or this happens because of reduced circulation due to its overgrowth. Moreover, my diabetes mellitus worsened before schizophrenia started; this could be a factor in fungal overgrowth.§ I think it causes the organs to be saturated with sebum, thus the swelling. My Fordyce spots dissipate as Malassezia decreases. During the lime and antifungal treatment, there was increased urination and expulsion of both hard and soft sebum through the skin from different sites of the body while the GI tract was getting rid of some sort of a substance.§ Skin sensory receptors where the major fungal formation sets near the nasal bone were almost inactive. There were two white strips hardly visible under the skin and nothing seemed to help against them. I used something a bit invasive to get rid of them; hardly any pain was felt and there was no blood flow to the surface of the formation site. It was common to have a clear fluid coming down from the nose after my first psychotic episode.§ Supplements helps the immune system against this fungus. In particular, selenium, vitamins E/D/C, and omega 3 are most useful. Any vitamins/minerals that play a role in immunity seem to help.§ I have had always noticed a change in the alignment of my eyes after my first psychotic episode; most likely because of inflammation behind the eye and in the brain. During a course of antifungals, I experienced a feeling of readjustment in my right eyes followed by tears. At one point I also felt blood rushing to my head from the chest area. I don’t know if I was delusional but I also felt a connection being reestablished between the heart and the parietal lobe. I tend to lie down for hours when I try any treatment; it helps me feel any changes in the body.§ It targets the thyroid gland. I remember having slight pain in the thyroid area during the two weeks before my first psychotic episode. I noticed a single fungal spot where the thyroid is after the first time my positive symptoms ended; this spot became more established with each psychotic episode. Before schizophrenia, I never gave much thought to what I assumed to be eczema on my scalp for years. The appearance of a lone fungal spot so close to the thyroid coinciding with my first psychoses made me a bit suspicious of it.It may sound crazy likening what happens to zombie ants to some schizophrenics. Nevertheless, it happens in nature and we are part of nature while schizophrenia remains a mystery. What gave me the courage to write and post this is the fact that I’ve been making a great recovery from the brink of having psychoses and I do it by simply considering Malassezia as the culprit and subsequently doing whatever I could to fight it off. Please keep in mind that tinea versicolor may not be visible. I thought it was only on my scalp but with the treatment I found out it was all over my body specially the back while Malassezia is also associated with a number of different skin conditions like dandruff. Am hoping those who suspect their illness is caused by some sort of microorganism will experiment with a pile of lime and report what happens to the forum.A lot of what is mentioned in this informal writing may be irrelevant details but it’s an effort to first find schizophrenic patients who can relate to anything mentioned here and then to entice relevant professionals to become suspicious of Malassezia as a causative agent in the illness. As to why I believe such a common fungus is causing my schizophrenia, I simply think it developed into an advanced form which puts my immune system in a constant jeopardy; I can think of some unique subtle ways I helped it get there. Nevertheless, I find it easy after my initial recovery to manipulate Malassezia due to its overgrowth while I understand it cannot be totally eradicated from the body. For me, there is nothing more encompassing than this fungus in trying to explain my schizophrenia as it affects the whole body and is responsive to many factors both external and internal. Furthermore, it feels tempting to start hypothesizing how Malassezia could impact the brain. For example, given it has the ability to manipulate lipids and fluids, it could have an impact on blood\\-brain barrier integrity or find pathways to absorb gray matter elements, thus causing structural changes in the brain.**The following is from the internet with some elaborations; it may be relevant to what is mentioned above.**Title: Seborrheic dermatitis flare in a Dutch male due to commensal Malassezia furfur overgrowth \\(Oxford University Press; 2008\\).“A 57\\-year\\- old male from the Netherlands… was hospitalized for bilateral weakness of his extremities and irregular fever. These symptoms were suspected to be the result of a brain embolism. Brain CT and MRI showed multiple, low\\-density lacunae in bilateral basal nuclei, thalami and frontal lobes denoting a brain embolism. Chest X\\-ray, abdominal ultrasound check, blood cultures, and serum HIV antibody were negative... Cerebrospinal fluid \\(CSF\\) examination included culture and smear for bacteria \\(Gram stain\\) and fungi \\(India ink examination\\) and Mycobacterium tuberculosis antibody. All tests were negative. Since the reasons for fever were not clear, the patient was not given any antibiotics. A dermatology consultant was requested since he presented with bilateral erythema and desquamation that was distributed on his cheeks and submaxilla area. Although the erythema was present for 10 years, the patient did not experience any discomfort and thus he had ignored it. However, the erythema had become more severe within recent weeks, extending to the post aurems, temples and the hair line with increased numbers of greasy scales…. These results indicated Malassezia furfur... Since a clinical and mycological diagnosis of Seborrheic Dermatitis \\(SD\\) was made…. The condition was treated with itraconazole capsules... Moreover, the patient was instructed to wash his face with 2&amp;#37; ketoconazole shampoo and to topically apply a cream containing 1&amp;#37; naftifine hydrochloride and 0.25&amp;#37; ketoconazole. His temperature almost immediately returned to normal within one day of treatment and the erythema was lighter with less scaling after 7 days. Direct microscopy and culture were performed once a week for 3 weeks during therapy and one week after discontinuation of systemic and topical therapy. All examinations were negative and no\\-side effects were noticed with a total of 5.8 gram of itraconazole…. It is accepted that there are three interrelated factors in SD: Malassezia overgrowth, sebaceous glands over secretion, and abnormal host response to Malassezia yeasts on the skin…. The case described herein shows that M. furfur is involved in SD because this patient had a large number of yeast cells in the scales… Additionally, the patient was cured with a combination of antifungal agents. Direct microscopic examination and culture after antifungal treatment were negative, which further implicates M. furfur as the etiologic agent of SD in this case… It is difficult to demonstrate a relationship between the flare of SD and the fever, but the patient's fever was unexpectedly alleviated through the use of itraconazole, without receiving any other antibiotics. This may indicate an undetected Malassezia fungemia as blood and CSF cultures were negative for bacteria and neutrophil count was within normal limits”.§ This case report above is very relevant in terms of making an association between brain abnormalities and Malassezia.§  The basal ganglia/nuclei “are the site of most of the dopamine neurons in the brain” \\(Basal ganglia pathology in schizophrenia: dopamine connections and anomalies; Journal of neurochemistry\\).Title: Research Sheds Light on the Risks and Causes of Schizophrenia \\(WKSU org; 2018\\).“Still, Messamore acknowledges that our explanations for schizophrenia remain vague, its mysteries only deepened by bizarre clues, beginning with our skin…. Messamore is among a handful of researchers who have looked in the unique response people with schizophrenia have to what's called the niacin flush…. Messamore has a theory. He says it has something to do with the way our body signals inflammation, both in the skin and in the brain…”.§ Dr. Erik Messamore runs the Best Practices in Schizophrenia at Northeast Ohio Medical university.§ A study involving 163 patients with schizophrenia found a third of them displayed a blunted response to niacin skin flushing test \\(Simple Skin Test May Help Identify Schizophrenia; Medscape; 2017\\).Title: Schizophrenia as a membrane lipid disorder which is expressed throughout the body \\(NCBI; US National Library of Medicine; 1996\\).“Clinical, biochemical and genetic evidence now indicates that schizophrenia is a disorder of membrane phospholipid metabolism associated with increased loss of highly polyunsaturated fatty acids from membranes owing to enhanced activity of a phospholipase A2. This changes the properties of membranes throughout the body and is responsible for such physical abnormalities as reduced vasodilator responses to niacin and histamine and altered immunological functions. A modest membrane abnormality is likely to produce its most serious consequences in the brain….”.§ Phospholipase is necessary for the growth and pathogenicity of Malassezia \\(The lipolytic enzymes activities of Malassezia species; NCBI; US National Library of Medicine; 2009\\).§ “Malassezia furfur is a lipophilic yeast that has been related to inflammatory skin conditions such as seborrhoeic dermatitis and psoriasis. We have previously reported that this yeast secretes enzymes capable of metabolizing complex lipids. This lipolytic system is critical for M. furfur growth, since the yeast has a strict dependence on an exogenous source of fatty acids…. M. furfur secretes enzymes having phospholipase A2 activity…. This enzyme liberates arachidonic acid from Hep\\-2 cells…. Arachidonic acid metabolites are well\\-known mediators of skin inflammation… we established that M. furfur can trigger an inflammatory response per se by releasing metabolic products” \\(Arachidonic acid released from epithelial cells by Malassezia furfur phospholipase A2: A potential pathophysiologic mechanism; Indiana University; 1998\\).§ Arachidonic acid has been also implicated in schizophrenia \\(Arachidonic Acid: A Common Link in the Biology of Schizophrenia; JAMA Psychiatry; 1994\\)Title: Brain’s immune cells hyperactive in schizophrenia \\(The Guardian; 2015\\).“Although the causes of schizophrenia are unknown, inflammatory processes have already been implicated in it. Patients with schizophrenia exhibit elevated levels of small, pro\\-inflammatory proteins called cytokines…. Microglia are the brain’s resident immune cells, which form its first line of defense against infection and injury. In any such event, damaged neurons emit a distress signal, which activates microglial cells and attracts them to the damaged or infected site, where they proceed to engulf and neutralize pathogens…. This occurs by a process called phagocytosis…. We now know that microglia eliminate unwanted synaptic connections in the same way that they remove pathogens and damaged cells, engulfing them by phagocytosis. This process, called synaptic pruning…”.§ Malassezia causes the production of cytokines; this is mentioned in the following article.Title: The Malassezia Genus in Skin and Systemic Diseases \\(American Society for Microbiology; 2012\\).“Malassezia yeasts demonstrate a species\\-specific ability to interact with cells that are constitutive members of the skin… or cell lineages that are involved in immune functions, including antigen\\-presenting dendritic cells, macrophages, eosinophils, and neutrophils. The exposure of the above\\-mentioned cells to Malassezia yeasts or their products has been shown to induce the production of a variety of cytokines... Interestingly, the contact of Malassezia cells with serum and subsequent opsonization increased their ability to induce IL\\-8 expression in a macrophage cell line and a granulocytic cell line… The involvement of Malassezia yeasts in the development of pityriasis versicolor illustrates the excellent adaptive mechanisms which this yeast possesses... In the two most common clinical forms of this disease, the hyperpigmented and hypopigmented forms, there is a significant fungal load on the skin but without any inflammatory alterations being observed. This has been partly attributed to the production of an array of indolic compounds produced by Malassezia species, in particular M. furfur, that have the ability to downregulate aspects of the inflammatory cascade. Thus, indoles like pityriarubins impede the respiratory burst of human neutrophils, while indirubin and indolo carbazole inhibit the phenotypic maturation of human dendritic cells. Additionally, malassezin was proposed to induce apoptosis in human melanocytes… Other metabolites that have been linked to the clinical presentation of pityriasis versicolor include melanin, azelaic acid, and other products of skin lipid peroxidation… The aberrant production of Malassezia phospholipases on the skin could result in the removal of epidermal lipids, disruption of the epidermal barrier function, and the development of seborrheic dermatitis when sebum production is constitutionally decreased. Phospholipase production is a well\\-established virulence factor in Candida albicans”.Title: Fungal meningitis caused by a Malassezia species masquerading as painful ophthalmoplegia \\(NCBI; US National Library of Medicine; 1993\\).“The patient, an otherwise healthy 42\\-year\\-old woman, developed non\\-throbbing periorbital pain and abducens nerve palsy of the right side two weeks prior to the present admission… On admission, neurologic examination revealed bilateral abducens nerve palsy, incomplete bilateral oculomotor paresis, and hypalgesia in the first and the second branch of the left trigeminal nerve. On CSF examination there were 742/mm3 white blood cells of which about 80&amp;#37; of the cells were neutrophils…. Although repeated cultures for bacteria or fungi were negative, PAS stains for CSF sediments showed a large number of yeasts morphologically consistent with a Malassezia species. Anti\\-fungal treatment with fluconazole and flucytosine resulted in dramatic improvement both in neurologic signs and laboratory findings. According to morphological criteria, the yeasts found in CSF sediments from this patient differed from those described previously as being pathogenetic in the CNS fungal infection. By contrast, these yeasts were similar to a Malassezia species in all aspects. Because some Malassezia requires oil for its growth in culture, it is possible that it failed to grow in the standard media and thus escaped recognition”.Title: Immunology of Diseases Associated with Malassezia Species \\(NCBI; US National Library of Medicine; 2002\\).“The density of Malassezia species on the skin decreased with increasing age, which was probably due to a reduction in the level of lipid on the skin. Therefore, 30\\-year\\-old subjects had significantly greater numbers of Malassezia species than did any other age group from 40 to 80 years old…. In general, carriage of Malassezia appears to increase around puberty, correlating with the increase in sebaceous gland activity seen at this time”.§ This may be related to why schizophrenia takes hold after puberty but becomes rare after 40 \\(When Do Schizophrenia Symptoms Usually Start; WebMD\\).Title: Malassezia furfur, Disseminated Infection in premature infants \\(Department of pathology; Georgetown University; 1988\\).“Three infants, born prematurely, died after clinical illnesses of 67, 65, and 60 days from infection by Malassezia furfur. Each infant had been nourished with lipid emulsions delivered through deep\\-line catheters. The infections, all discovered at autopsy, were characterized by massive involvement of lungs. Two of the three had endocardial vegetations containing M. furfur; all three had lesions in liver, kidney, and spleen, and two had lesions in adrenal, pancreas, and colon. In addition, one of the infants had acute meningoencephalitis caused by M. furfur. In some of the distant organs, yeast cells of M. furfur were growing in the lumina of small vessels, filling the lumina, but causing no vasculitis or infarction. In addition to these benign collections of yeasts within vessels, there were acute inflammatory lesions as well. These were consolidation, vasculitis, granulomatous inflammation, septic thrombosis, and septic infarction of lung and foci of necrosis and inflammation in kidney and liver. Two previously reported autopsies described neonates with lesions in lung and heart. The authors' three cases for which autopsies were performed had lesions in lung and heart too but, in addition, had dissemination with acute lesions in kidney and liver. Finally, one patient had a severe meningoencephalitis caused by M. furfur”.§ Although this article reports cases of three infants in very poor state of health and dependence on lipids from catheters; it says clearly that Malassezia infections were discovered upon autopsy examination. Such pervasive infections for a considerable length of time and in a hospital setting without implicating Malassezia as the cause.Title: Research finds new mechanism that can cause the spread of deadly infection \\(Medicalxpress; 2018\\).“Cryptococcus gattii… affects the lungs first, because it is acquired by inhaling fungal spores. In the absence of therapy, and sometimes despite it, the infection quickly spreads to the brain and other organs… University of Birmingham carried out research which demonstrated that the high virulence of this Cryptococcosis gattii strain results from its remarkable ability to grow rapidly within human white blood cells which relies on a unique 'division of labour' mechanism within the infection. To achieve this, individual fungal cells must work together to coordinate their behaviour, but how they do this has, up until now, been unknown… Now the University of Birmingham's latest research… has discovered that this 'division of labour' can be triggered over large cellular distances and is mediated through the release of microscopic fluid\\-filled \"bags\" called extracellular vesicles… Professor Robin May, Director of the University of Birmingham's Institute of Microbiology and Infection, said: These vesicles act like 'carrier pigeons', transferring messages between the fungi and helping them to coordinate their attack on the host cell. This is a previously unknown phenomenon in infectious disease… Professor May said that the latest findings were unexpected. He added: Our initial expectation was that the fungus would only be able to communicate within a single host cell, but in fact we discovered that it can communicate over very large \\- in microbiology terms \\- distances and across multiple host cell barriers… The fact that this long\\-distance communication turns out to be driven by extracellular vesicles' is even more intriguing”.§ This article obviously isn’t about Malassezia but it tells how it’s possible for a fungus to coordinate its infection from separate locations.Title: Psoriasis, Schizophrenia and Disorders with Psychotic Features: Are They Linked? \\(Journal of Schizophrenia Research; 2015\\).“Psoriasis is a chronic inflammatory skin disease with a high impact on quality of life. It is a psychophysiological skin disorder with several psychiatric comorbidities... A possible connection between psoriasis and schizophrenia, or other disorders with psychotic features, has been suggested... Psoriasis, schizophrenia and disorders with psychotic features seem to share genetic, immune and inflammatory processes which would explain why they could be linked. Cytokine activity may modulate the Hypothalamo\\-PituitaryAdrenal \\(HPA\\) and Sympathetic Adrenomedullary \\(SAM\\) axes in both cases... Both brain and skin are embryologically derived from the neural plate in the ectoderm and this may be relevant in understanding if they also share biochemical mechanisms. The neuro\\-immuno\\-cutaneous\\-endocrine model was suggested by O’Sullivan et al. to explain the mind and body connection. This model explains how many inflammatory cutaneous dermatoses, such as psoriasis, are triggered or exacerbated by stress factors, including psychological stress... some studies found a possible connection between psoriasis and psychosis, including schizophrenia… Psoriasis is considered a state of chronic systemic inflammation…. One explanation for the positive association between schizophrenia and psoriasis is related to inflammatory processes… Moreover, those authors focused the elevation of phospholipase A2 activity in both psoriasis and schizophrenia too… according to the results of this systematic review, there is some evidence of a relationship between schizophrenia and/or disorders with psychotic features and psoriasis… Several studies have shown that a dysregulation of the Hypothalamic– Pituitary–Adrenal \\(HPA\\) axis is assumed to be involved in the stress induced exacerbation of chronic inflammatory diseases by leading to an upregulation of proinflammatory cytokines. This dysregulation includes both central and peripheral skin HPA axes activity…. we may say that infection and inflammation may trigger pathological mechanisms that result in proneness to psychosis and psychophysiological cutaneous diseases such as psoriasis”.§ “Studies in recent years indicated that Malassezia plays an important role in occurrence and development of psoriasis”. \\(Review of Research on the Relationship between Malassezia Infection and Psoriasis; De Gruyter; 2017\\).Title: Pityrosporum Isolate from the Upper Respiratory Tract \\(American Journal of Clinical Pathology; 1981\\).“A 49\\-year\\-old white man was seen at another facility for left cervical lymphadenopathy accompanied by weakness and malaise. The symptoms were at first attributed to a left upper molar that had recently been filled, and later to a left lower molar on which a root canal had been done. Both molars were, in turn, extracted, but the root tips of the upper one were broken off and remained embedded in the maxillary sinus wall. The patient experienced maxillary sinusitis after extraction of the upper molar and edema of the left cheek and episcleritis in the left eye soon after the lower molar was extracted. Both infections were, in turn, treated with antibiotics. After the initial courses of treatment, antibiotic therapy could not be discontinued for more than a few days at a time without a recurrence of all symptoms. Surgical removal of the portion of bone containing the root tips of the upper molar resulted in an abnormally large opening to the maxillary sinus. Approximately six weeks postoperatively, the patient experienced osteitis of the sinus wall and cellulitis over the left maxillary sinus with episcleritis and orbital edema. Cultures reportedly yielded a mixed bacterial flora consisting of Klebsiella sp., Enterobacter sp., and Staphylococcus aureus. He was treated with courses of erythromycin, cephalexin, and doxycycline in heavy dosages but not concurrently. Although the cellulitis resolved in approximately seven days, treatment was continued because of the osteitis, and the patient continued to receive antibiotic therapy for approximately one year with never more than a few days' cessation. After approximately ten months of antibiotic therapy, a yeast\\-like organism was reported on the patient's nasal smears and has been observed on all subsequent smears. Attempts to isolate the organism on culture were unsuccessful. Bacterial cultures subsequent to the antibiotic therapy have yielded only Staphylococcus aureus... The patient was seen in the clinical microbiology laboratory of the Louisiana State University Medical Center, Shreveport approximately nine months after the fungus was first observed. Material then collected from the left nasal passage yielded smears that revealed numerous yeast\\-like organisms. An organism morphologically similar to those observed on the smears was isolated from the material on culture and was identified as a Pityrosporum isolate. The cultures yielded no other yeast\\-like organism. After the fungus was isolated, the patient was treated for three weeks with miconazole intravenous solution used as nose drops, but without success. Except for the microbiology of the involved areas, all laboratory findings have been within normal limits. Symptoms currently reported by the patient consist of a persistent nasal drainage on the left and compromised physical endurance… The consistent interconversion of morphologic characteristics and corresponding physiologic changes among the strains studied by those workers led them to suggest that P. orbiculare and P. ovale are developmental stages of a single species, Malassezia furfur…”.Title: The Malassezia Genus in Skin and Systemic Diseases \\(American Society for Microbiology; 2012\\).“M. sympodialis was isolated from the ear lesion of a 53\\-year\\-old non\\-insulin\\-dependent diabetic man who was receiving intravenous antipseudomonal therapy and was eventually subjected to surgical debridement. His condition did not improve but rather deteriorated, with the development of cranial nerve paralysis. Histological examination of tissue specimens obtained from the nasopharynx demonstrated budding yeast cells, and findings suggested a chronic inflammatory reaction. The isolation and identification of M. sympodialis with the subsequent administration of intravenous amphotericin B therapy led to a rapid recovery. The patient was subsequently given fluconazole prophylaxis and was free of clinical and radiological signs of infection 6 months later, although the resulting nerve paralysis did not improve”.Title: Keratitis caused by a rare fungus, Malassezia restricta \\(NCBI; US National Library of Medicine; 2007\\).We report the clinical findings in a 70\\-year\\-old woman who complained of pain in her left eye. Slit\\-lamp biomicroscopy showed a corneal ulcer with irregular infiltration, which resembled keratitis caused by filamentous fungi... Treatment with antibacterial agents failed… Antifungal agents, topical 5&amp;#37; pimaricin ointment and 0.2&amp;#37; miconazole, and oral itraconazole 150 mg/day, were applied, and the corneal ulcer disappeared within 5 weeks”.Title: Identification of Fungal Species in Brain Tissue from Alzheimer's Disease by Next\\-Generation Sequencing \\(NCBI; US National Library of Medicine; 2017\\).“The possibility that patients diagnosed with Alzheimer's disease \\(AD\\) have disseminated fungal infection has been recently advanced by the demonstration of fungal proteins and DNA in nervous tissue from AD patients. In the present study, next\\-generation sequencing \\(NGS\\) was used to identify fungal species present in the central nervous system \\(CNS\\) of AD patients…. Further analysis of entorhinal/cortex hippocampus samples from an additional eight AD patients revealed a variety of fungal species, although some were more prominent than others. Five genera were common to all nine patients: Alternaria, Botrytis, Candida, Cladosporium, and Malassezia”.§ “About 36 per cent of people with Alzheimer's are thought to have delusions and 18 per cent have hallucinations” \\(Alzheimer's disease patients with psychosis more likely to be misdiagnosed, study suggests; ScienceDaily; 2017\\).Title: Schizophrenia as a prostaglandin deficiency disease \\(NCBI; US National Library of Medicine; 1977\\).“Evidence that schizophrenia may be a prostaglandin deficiency disease comes from three main sources: \\(1\\) all effective antischizophrenic drugs stimulate prolactin secretion and prolactin is a potent stimulator of prostaglandin synthesis; \\(2\\) schizophrenics are resistant to pain and inflammation and are free of rheumatoid arthritis and there is increasing evidence that prostaglandins play important roles in pain, inflammation, and rheumatoid arthritis; \\(3\\) high doses of drugs recently shown to be prostaglandin antagonists cause schizophrenia\\-like syndromes. The hypothesis is not necessarily inconsistent with current transmitter theories of schizophrenia since prostaglandins modify transmitter secretion and action”.§ “we reevaluated the M. furfur culture extracts…. By chromatographic separations we isolated and identified by NMR and mass spectroscopy three additional indolic compounds known to be potent AhR activators, namely indirubin, FICZ and tryptanthrin” \\(Malassezia yeasts produce a collection of exceptionally potent activators of the Ah \\(dioxin\\) receptor detected in diseased human skin; NCBI; US National Library of Medicine; 2014\\). “Tryptanthrin is an alkaloid found in a number of plants, most of them also producing indigo and indirubin. It is a potent inhibitor of prostaglandin and leukotriene synthases in various cell lines”. \\(The Malassezia Genus in Skin and Systemic Diseases \\(American Society for Microbiology; 2012\\).Title: Skin disorders in Parkinson’s disease: potential biomarkers and risk factors \\(NCBI; US National Library of Medicine; 2017\\).“Seborrheic dermatitis is considered to occur as a premotor feature of PD referable to dysregulation of the autonomic nervous system…. The increased production of host sebum as well as the presence and increased reproduction of Malassezia yeasts are the two major factors believed to contribute to the development of SD. Seborrhea has been associated with PD, with a prevalence as high as 52&amp;#37;–59&amp;#37;... seborrheic dermatitis could serve as an early disease marker of PD. Appropriate anti\\-fungal treatment, such as ketoconazole can be useful for PD patients, as such agents may reduce Malassezia growth and enzyme production”."
    },
    {
        "name": "t3_5q56kr",
        "created": 1485400436.0,
        "ups": 2,
        "downs": 0,
        "title": "Suggestions Needed..... Wanna make something helpful",
        "selftext": "Hi,I am a design student and am researching on Schizophrenia currently with a goal to create an experience design project to help \"sane\" people grasp the complexities, challenges and surreality of surviving schizophrenia. However, I am doing this project in India, and though I love my country, on a specific and delicate topic like this, a neutral insight is, let's say, pretty rare.Which is why here in r/schizophrenia I wish to take insights and suggestions for me when I move forward with designing and creating the experience.I hope people not yet bored with my long request will open up  with their thoughts :)"
    },
    {
        "name": "t3_7sk5ko",
        "created": 1516791818.0,
        "ups": 3,
        "downs": 0,
        "title": "Strange changes",
        "selftext": "Just yesterday I was talking with a good friend/coworker and we were discussing the different experiences people have with schizophrenia based on there geographical location. Like people in India and Africa hear their ancestors and spirit guides (both of which I've heard before but that was before I started on medication). And then in the U.S. you have people paranoid over people trying to kill them and being watched and persecuted all day long. I myself have a constant, and I mean constant, voice telling me to kill myself and a few other things. But today my voices changed. They split into two voices, one being the hateful voice constantly in the background, but the new one is much softer and says the want to be my companion. They told me I was doing a good job while I was working today and we chatted a little bit. I think this is a good change and I hope it stays around for a while. You can never be sure with these things. Sorry for the long post but I thought this was an interesting development and I'm wondering if any of you have multiple voices like this. Peace and love - BacaEdit: words"
    },
    {
        "name": "t3_5ut3sd",
        "created": 1487463030.0,
        "ups": 2,
        "downs": 0,
        "title": "How can I help my mom? who is sufferring from past 15 years.",
        "selftext": "I am from india 22 year old and my mother has Schizophrenia. The early symptoms started when I was around 8-10 years old my mother said that she is hearing the voices and seeing the dead people. My mother and father both are educated but also religious and other relatives said some one has done black magic on her so to cure that they started going to all the fake saint and giving moeny to cure her. But nothing changed her mental illness kept getting worse. My parents started fighting every week and it affected my sister and me both on physical and mental level. My father also hed to move to another town due to his job. When he first move to the town my mother thought he had another wife and child from his second wife. At the age of 12 hearing this has affected me but the reallity was that there was no other women. When ever my dad visited us they fight with each other my father tired to help her but it was getting worse day by day. Me and my sister wher alway crying and not knowing what she will do next. My mother would beat us for no reason. She thinks that some people are sucking our soul and making us do things aginst our will and our neighbours are using me to have sex with there dauthers and wife(remeber I said I stay in india and I was 14 year old). This traum was so deep that for some time I hated my father for beating my mother and ruining the family at that point I did not know that my mother has Schizophrenia. And then I started hating my mother for doing this to us. I did not understood any thing about psychology so I was just angry teenager. During my adulthood when I got some sense and had intenet I figure it out about her illness. But it was too late now she is in the state that she think there is nothing wrong with her and problem is with the other people. My father had tried to convice her to get mdical tritment but she doesn't want to. My father does not stay with us anymore we haven't seen each other in 1 year. And I feel angry at my self for not able to help my family and seeing my family breaking apart. Right now all I can think of is giving my mom sleeping pill and taking to hospital but I dont know how to do that I am scared that if somthing will happen to her I will never forget my self. Please help me if someone specially from India."
    },
    {
        "name": "t3_2hczye",
        "created": 1411617024.0,
        "ups": 3,
        "downs": 0,
        "title": "Does anyone believe its an external force manipulating you? What I've seen in other countries",
        "selftext": "How they do it in japan they get a hello kitty doll or pikachu doll and say thats you - you are so pretty - you are so nice; you can make them pure with your energy if its real.  Japan also has very nice parades, temples, and traditionsAsian countries: Leave your favorite food as an offering outside for your ancestorsJewish culture: sacrifice one goat per year as an offering to godIndia:  Indians worship a temple with rats, and leave them gifts daily, feed and clean them alsoBeen there myself - I was a macho a**hole and when they were watching me I threatened them and said I would fight them. Finally getting better but not fixed all the way. Native american: Dancing, Shamans, PeacePipe (my favorite), body artMy advice is to tell you to do your favorite things, music or whatever as much as he can. Always have the attitude of \"I love everything\". Dont fight them - just talk like a man to a woman (shes a girl!); be calm and assertive; you can try \"I'm the boss, you can't have my brain\" (he can also touch it and say that). Also try \"you are pretty\".if they lie to you just say like \"thats not real\" and ignore it.I'm not saying that I'm 100% right here- I thought it was the govt - but you could talk to a priest or a father in confessional they have seen this before.good luck!I personally believe that alzheimers / schizophrenia / demensia / bipolar / autism are all caused by the same thing - im not sure what that is yet - but if this silly paragraph i typed helps you please help someone else. Thanks!"
    }
]