[
    {
        "name": "t3_k0a802",
        "created": 1606270024.0,
        "ups": 2,
        "downs": 0,
        "title": "Addiction and manic episode",
        "selftext": "Hi.. I'm married to someone with BP. I'm from India and I had an arranged marriage.  My in laws did not tell me before marriage.  So over the past 10 years he has had a manic episode and been admitted to a  rehab. This time, the first year kg our marriage he smoked weed and drank and I gave him company too,  without knowing about his condition.  I thought his parents were worried only because they are conservative.But after a year of marriage when he got a new job he went through a manic episode and it was the first experience for me.  After getting sober he hasn't drank or smoked.  But he doesn't believe it harms him.  He has agreed to remain sober to save the marriage. When I talk to his doctor he is not honest with me.  He doesn't even mention the word bipolar and calls it an addiction issue,  whereas the prescription is of mood stabilizers.  I tried reaching out to a few orher doctors too but of no avail.My husband is a very good person and we have a good relationship  I would like to know  is for someone who is sober,  are there chances of such episodes in future. I. E. Every 3 years. To me it appears that he had the episode because of the changes he was anticipating from the change of job and city rather than the weed, because I know he had been drinking and smoking over the last two years and did not face any changes. How do you identify if episodes are due to substance or otherwise?"
    },
    {
        "name": "t3_i1gprf",
        "created": 1596262263.0,
        "ups": 5,
        "downs": 0,
        "title": "Alcohol induced mania like behaviour",
        "selftext": "Does anyone show non-lasting manic like behaviour when drinking?It also happens mildly after drinking coffee and maybe eating glutenhere is an article about it observed in india[https://www.jscimedcentral.com/Psychiatry/psychiatry-3-1046.pdf](https://www.jscimedcentral.com/Psychiatry/psychiatry-3-1046.pdf)"
    },
    {
        "name": "t3_hycbb4",
        "created": 1595818112.0,
        "ups": 2,
        "downs": 0,
        "title": "I DONT KNOW WHO TO CONTACT FOR A PROPER DIAGNOSIS",
        "selftext": "I'm from India and I'm clueless and i have absolutely zero clue about who to ask for help. Can someone please tell me anything. i dont even know what questions to ask"
    },
    {
        "name": "t3_hj6tz3",
        "created": 1593623589.0,
        "ups": 21,
        "downs": 0,
        "title": "Managing Expectations at Work",
        "selftext": "I am self-employed but in some ways it is like a regular job when I have a client or contract work. Because I have lags and bad days (or an entire week or two), I try to be on my toes whenever I am able to work at all. So, at times when I'd get an email or message requesting something, I'd stop whatever I was doing, get on it like my life depended on it, and delivered in a few hours what could've taken a week. And received thanks and compliments for it, which felt good.It's only now that I realise how this was setting a bad precedent. What my clients/colleagues were grateful for then soon became a normal expectation and now an obligation. Not only could I have submitted that job in a few days, but some of the work I did was just as favours and not even my responsibility. I was also undermining the complexity of my own work in the process. And most importantly, the days when I would not be able to perform made me look even more irresponsible and \"lazy\".But I can't ignore doing a job if I am in a state when I could, because without a stated deadline I would never do it later. So, this Monday, I drafted a couple of documents as needed, and then put them on Scheduled Email, so they weren't sent out until today (Wednesday at about 11 am). The person is grateful just the same, and now he's not under the impression that this is a two-hour job. It's about 3 pm now, and I have some other docs set to go out on Friday afternoon. And hopefully they won't disturb me until then too.I am yet to see how my screwed-up bipolar brain comes up with a loophole, but so far I feel positive about it because this isn't about managing my own mental state, but also about someone else's biases and office politics.&amp;#x200B;Edit: Should probably have mentioned in my post that I was diagnosed with Bipolar 2 some 5 years ago and have been much better with medication. A few people I work with know about it, but that's probably not ideal in a conservative society like India's where mental health issues are not taken seriously."
    },
    {
        "name": "t3_hia7ga",
        "created": 1593497830.0,
        "ups": 1,
        "downs": 0,
        "title": "traveling outside the country",
        "selftext": "hello friends,&amp;#x200B;i live in the US and have always wanted to travel, but I feel deeply deterred from doing so because of all the medications I take. what happens if im in switzerland or india and i lose my meds? i havent talked to my doctor about this since its such a hypothetical still, but I wanted to know if any of you have traveled outside your home country and how that looked for you and med management.&amp;#x200B;thanks :)"
    },
    {
        "name": "t3_f7xmf9",
        "created": 1582429402.0,
        "ups": 2,
        "downs": 0,
        "title": "Homeopathy for Anxiety and Depression",
        "selftext": " Hello FolksI am just curious if any of the members have had success in using homeopathy for psychiatric illness.I have heard of many cases in India where patients were able to stop their medication or reduce it substantially using [homeopathy.](https://homeopathy.one/)One of the successful psychiatrist is Dr.Mahesh Gandhi,who left allopathy and became homeopath as he felt the medications were drugging his patients.It would be great to know about the experiences in the west."
    },
    {
        "name": "t3_dq4mpb",
        "created": 1572645699.0,
        "ups": 6,
        "downs": 0,
        "title": "Globetrotting fears",
        "selftext": "Got back from Europe for vacation on Monday. Going to London for work this Tuesday for work. I used to live for this kind of travel - I have 'global' in my job title and I've had times where I hit 3 continents in a month for work. But, that has been destabilizing. Last time I was asked to travel for work was a year ago, and I cancelled a last minute trip to India because I was suicidal and didn't think I could handle the time zones or stress or any of it.Last time I had international trips back to back within a week of each other triggered a 6 month depressive episode. Lots changed since then - I'm sober now, that's a big one - but I'm kinda worried about destabilizing myself. I tend to get jet-lag-hypomania (like Tues - wed this week) followed by depressive swings and I just don't know if I want to try and handle the stressful long haul stuff anymore.I recognize that I'm very lucky to have these problems. Got my dream job and have kept it 5+ years (not quite dream job anymore, but it's been good to me)Thoughts any fellow beepers?"
    },
    {
        "name": "t3_a3jyo4",
        "created": 1544095119.0,
        "ups": 7,
        "downs": 0,
        "title": "WARNING: This post could be VERY triggering for anyone dealing with suicide idiation (sp?!).",
        "selftext": "Didn't even want to put my question in the title because I know it could be rediculously triggering, and if mods end up wanting to take this down, I won't be upset.Question:  What are your thoughts on assisted suicide for mental illness?  I just saw an economist post on Facebook about a young woman who was planning on getting assisted suicide due to severe depression in Belgium.(if you look at it DON'T read the comments, they're horrific, apparently debilitating depression can be cured if you pull an \"eat, pray, love\" move and visit India or... something?)  I'm having a really hard time sorting my feelings on this so I'd like some input from people who actually get where she's comming from as opposed to the 1000 idiots commenting and saying she \"just needs love\"  \"needs to get laid\" or \"should visit a third world country and see how good she has it!\"   or my personal favorite \"if she was in Saudi Arabia we'd just smack it out of her\"."
    },
    {
        "name": "t3_8u51l7",
        "created": 1530087062.0,
        "ups": 4,
        "downs": 0,
        "title": "Bad review for Q1/Q2 at work- I can hardly breathe and I want to quit",
        "selftext": "I just read my appraisal for the first half of the year and I got a bad score. My boss said because I worked with a knowledgeable vendor I wasn’t tested technically. I wasn’t the project manager so I don’t get credit for the success of the project. As technical lead I need to be there more for my team including going to in person meetings - which there was never an in person meeting I missed because 1/3 were in the office, 1/3 were in India, and 1/3 were in Croatia. I feel like I’m going to throw up and cry at the same time. The project was a huge success and getting a bad grade on it is such a huge hit to me.I want to stop eating to punish myself for screwing up at work. Now I am looking at my current projects and trying to see where I could be docked points. I’ve had a hard time at work lately which doesn’t help at all. I want to just say fuck it and quit. I can’t because I make 75% of our income. I just want to throw up. I don’t even know what to do. This really sucks. "
    },
    {
        "name": "t3_8ag5o3",
        "created": 1523108815.0,
        "ups": 5,
        "downs": 0,
        "title": "Are these reliable generics?",
        "selftext": "Now I have had terrible generics that are basically just sugar pills, and I have had great generics that work like an absolute charm. For example, I was on Mylan diazepam and it didn't do anything at all to relieve my anxiety, then when I got Teva diazepam I felt calm and way less on edge.I just switched from a Walgreens to a Jewel Osco pharmacy, due to bad service at Walgreens. They were given specific instructions to order certain brands of medicine and they never followed through or cared. They were confronted many times by me, my doctor, and my family and they still never ordered the right brands. I mainly switched due to them having the sugar pill diazepam and a defective Wellbutrin XL generic made by Actavis. Gabapentin was the only thing that was working and that was made by Amneal. I take all these to help stabilize Bipolar Disorder and GAD.With that out of the way, Osco said they had Doctor Reddy for the bupropion and Northstar for gabapentin. Are they well-made and dependable versions of the medicines or should I ask them for something different? I have been told Sandoz and Watson are both great for Wellbutrin XL/bupropion XL generics. I am happy with the Teva diazepam, miles better than Mylan. I have no idea about what are good and bad gabapentin generics. All I know is that Doctor Reddy is from India and Northstar did have some recalls.If Doctor Reddy for bupropion and Northstar for gabapentin are bad choices, then what are some recommended brands I can request? And before I get people ranting on about how all generics are of the same quality, no, they are not. Some have too much filler and don't release properly or are poorly formulated. I have experienced bad generics and they have only made things worse.  I have had poorly made buproion XL make me manic and shitty valium that did absolutely nothing.  Mylan bupropion is decent, ironically, although their benzos are crap.  The doses for better reference: bupropion XL 150mg, gabapentin 100mg, and diazepam 10mg."
    },
    {
        "name": "t3_75aa6o",
        "created": 1507595846.0,
        "ups": 2,
        "downs": 0,
        "title": "Generic Pristiq in Canada?",
        "selftext": "I keep hearing that there's a generic version of Pristiq out in Canada, but no pharmacies seem to know what I'm talking about. Am I wrong here?"
    },
    {
        "name": "t3_2qky1u",
        "created": 1419760753.0,
        "ups": 14,
        "downs": 0,
        "title": "For how many of you guys is this a familial disease?",
        "selftext": "I come from a family where my mother is bipolar and I have strong suspicions my grandfather was as well, but it wasn't commonly diagnosed in his day, especially in rural India.How many of you guys come from bipolar families? Any stories?"
    },
    {
        "name": "t3_53gp1s",
        "created": 1474304427.0,
        "ups": 4,
        "downs": 0,
        "title": "Chose the addiction. Beat the addiction. Beat Bipolar along the way",
        "selftext": "Cocaine is an illegal substance that can cause great harm and should not be used under any circumstance. Those diagnosed with bipolar are especially drawn to cocaine and treatment for them to overcome their drug addiction and find a self expressed balance in their life has so far been unsuccessful in terms of utilizing a specific program developed for such persons diagnosed with bipolar disorder. One such person who was diagnosed with bipolar I disorder decided to undertake the process of becoming drug addicted to cocaine in order to understand what another goes through and then chose to break the addiction to see why it is so difficult for other bipolar's to let it go.after overcoming the addiction to cocaine that lasted 1 year and in the process aiding another individual diagnosed with bipolar to also overcome the addiction that they fought over 6 years and continued to risk their freedom while using on probation much learning was gained. In order to understand relapse 1 year later this individual who became addicted and broke addiction by choice decided to revisit what exactly was so possessing and rewarding from cocaine consumption and their account is as follows.\"At the time of using in the past IV'ing was most preffered. A feeling overcame me in a way i never thought was possible, or could have even predicted. a taste enters the mouth and a tightness in the chest is accompanied by a feeling in the brain as though an angel wrapped a blanket from heaven around it. Thoughts that are verbal become much more pronounced and clear as one mindedness instead of scattered in different directions. A calmness and simple refreshed alertness shows itself and a desire to express oneself in a way that feels safe with understanding that ones expressions, however they be, of behavioral movement, verbally or written or drawn will make sense to those who take part in receiving whichever information is expressed. Feelings of worry, anger, being let down, mistrust, suicide leave without a trace of really being noticed. they are so far gone unless one is self reflecting the transition might not even be noticed. They are replaced instead by feelings of inspiration, peace, unity, passion that life will work out, motivation that contains within itself an understanding that what is created from taking action has a sense of importance. The bodies finite motor skills become improved, so much so that awareness of their lack of refinement before administration of such substance brings into question the wonderment of how lack of awareness of such lack refinement of the motor skills existed. This is however accompanied by a slight paranoia that i am doing something \"wrong\" and this feeling of \"wrong\" did not exist before use. this brings to question something in the brain being activated that allows for an understanding of \"good\" and \"bad\" that was previously not being felt. The overall happiness score alteration however is very different than use in the past. I was previously on 15mg abilify, 1200mg lithium and 50-100mg trazadone while initiating the addiction and is now currently on 20mg Lexipro. I also initiated a methamphetamine addiction that lasted 9 months and broke that as well and have been clean of all substances for 3 months before administering cocaine. I am quite amazed to say that AFTER COCAINE IS INJECTED there is NO LONGER ANY CHANGE IN MY HAPPINESS, despite the shifts in emotion taking place. I feel the ache of the brain and the slowing and disorginization of thoughts that follows the 30-45 minutes buzz accompanied with a slight craving for readministration but the slowness that follows the fastness no longer carries with it a depression or sadness as equal to the speediness and thought refinement directly following use no longer carries with it a sense of happiness. This was quite confusing and unpredictable for me.In the past the craving after use would have me what i learned was called \"fiending\" where my mind desired the substance so much it produced desire and motivation to aquire more of the substance and through the motivation to intake more provided my brain with thought plans that would allow for me to get more. it occupied much space of thought my mind, so much so that it even interfered with concentration on other matters that I knew were of most importance and priority, such as taking care of my mother and my father like role modeling my struggling suicidal younger sister for whom I love very much. The desire for more drove me to have sex with people that were unattractive and of a gender that does not stimulate me, it ruled my life.Now, there was a question of what makes it so important as to be something different from all other things. The petting of my favorite dog i feel love for brings to me a great reward of happiness that is much greater and preferred than further administration of the   substance. A mind boggling reflective thought that was.  I was so curious I allowed 1.5 grams of Uncut Cocaine to enter my veins over 6 hours with one utilization totaling a quarter gram. I am well aware of the dangers and risks involved and am being monitered for the saftey of myself and have also learned strategies of breathing, hydration, supplementation that protect me in a way that adds to my confidence of using, taking a risk to improve knowledge in a way that i cant find. I am not sure what totally is responsible for such a vastly different experience than I had just one year ago, however the differences I notice are extreme and were unpredictable.I theorize the following may have led to the changes they currently experienced from such a strong intake of cocaine producing an effect that carried with it freedom from using more and no added happiness. 1. becoming addicted to and overcoming previous cocaine addiction(strict singular use 1 year  / complete abstinence for 1 year allowing for 3 relapses within days of each other while quiting) 2. creating and overcoming methamphetamine addiction (9 months of use, IV primarily, 3 months non consumption)3. Intense practice of multiple forms of self awareness meditation4. Initiation of choosing to discover love through devotion by choosing someone interested in them that they found physically repulsive of same sex while being purely heterosexual and committing everything of themselves to them for 9 months.5. allowing oneself to become homeless twice for days and then weeks at a time6. choosing new psychiatrist and going on 6 medications at one time with a few being completely new to their physiology and then all at once removing those medications and replacing with a single antidepressant. 7. Introducing oneself as a drug addict and appearing lost in the world to a side of the family that was previously purposefully ignored for 3 years. Continuing to hold role for 4 months, even going to rehab to appease family though drug cessation was complete prior.8. The object of times effect on the ever changing tissue of brain and bodyThese are the things that come to mind for why I may have experienced such a vastly different experience upon re experimenting with cocaine. I am in shock how different my basal emotional core of self is in reaction to the chemicals interacting that i am assured of is cocaine due to the physiological responses that it produces. I am quite curious how such a substance that speeds up the heart rate and increases blood pressure, allowing for a forced use of energy that mismatches itself with overall physiology, and no doubt a overall energy deficit upon the total metabolization of the substance from simple muscle fatigue could even be of interest. I realized in the moment of intense reuse after such time off that I must have altered my self awareness so much so that such a powerful substance as cocaine IV in a quarter gram dose holds no bearing over my feelings of self-worth, value, goals, thought space and especially happiness. I remember reading once that Timothy Leary gave 100 hits of acid to a yogi him and his team of researchers encountered in India and this yogi exemplified their power of awareness and control by showing no signs of consumption. There is something to be said of owning one self to overcome such a diagnosis as bipolar disorder and drug addiction. Learning to love oneself in a way that is undescribable overcomes all negativity. Bipolar is no longer thought of as an illness by me but as a power. The power to feel intensity when desired, the power to generate vast amounts of concentration and directed thoughts that the creative imagination becomes servant to the aware mind and not the master of the self. The ability to recognize patterns, notice the unseeable and gather followings even while spewing so called \"nonsense\" is remarkable. One of the most powerful transitions I had was when depression no longer felt negative. I learned to love my depression as a time of total body rest where an immense amount of thoughts and ideas were being generated so fast that the conscious mind, the cerebral cortex internal auditory thought generator decides to just let it take place, interfering with such speed of thought is like taking a step into a fast river and ones leg being swept out in front of them. Once the process of rest was embraced as a state of hibernation some remarkable things happened. During one 6 day depressive episode consisting of a lack of desire to eat, shower, move or express myself a vivid dream happened that awoke me with an amazing amount of ideas and excitement. A dream that when I investigated from google found its details to be accurate even though I had no prior knowledge in such a field that the dream was pertaining to. I believe that bipolar individuals like cocaine not because of the speed it gives them but because of the clarity of thought and consistency of feeling it allows them to have. It gives them the control of their emotions based on when and how much they use. The refinement of the thought process is incredibly distinct as compared to MDMA, Methamphetamine,Ketamine,Heroin and other opiates and Marijuana. It can easily be much preffered over any other medication that i have ever been prescribed by psychiatrists in treating my bipolar. I know this because all of these illegal substances that are extremely dangerous to consume I underwent the same addiction creation destruction cycle. HERE ARE SIDE NOTES OF EXPERIENCE THAT MAY HAVE LED TO THE EIn the practicing of devotion to another individual so strong that it is as though that individual is ones God, I learned that no matter what was happening around me, no matter how I felt, because of this love I were practicing blindly continually i gained a stronger ability to focus my emotions and thus channel my thoughts. Imagine being able to create a feeling of admiration and love no matter what is happening at any point; this is what I learned through intensive practice. This is one way in which being bipolar is a power. I was able to use the total intensity I would feel to focus on love in a way that was equal to the intensity I previously felt towards suicide. When I were clinically in a depressive phase of bipolar I learned that through such devotional love I were able to move my body to accomplish a goal. The idea of moving my body to accomplish a goal was foreign to me, I previously never considered initiating a process of making my body do something that seemed like it had no reason to. This allowed for goal based decision making. Despite how I felt, how my energy was, if I was not dead and I had a goal I  could make my body accomplish that goal so that I was one step closer to the realization of that goal. On the days that I felt spectactular, the high of bipolar I were greatly appreciative of myself for taking action even though I felt like a different person. I then also learned to write out the steps and make the importance clear to my depressive self of something being a timely goal that represented aquiring immense reward that it could not comprehend but that it needed to take that step in order for it to happen or it will never happen. Significant importance combined with true complete loss unless action is taken.It was also discovered that the depressive phase of bipolar seemed nonexistent when survival of the total being was being challenged, as such when being homeless. It is amazing how being homeless stimulated ideas and communication and a stableness in a new way that had never been experienced. Homelessness had been an end result in the past of a \"manic\" episode, however being initiated by the self was such an evolving experience. I wonder if being homeless on purpose and drug addicted by choice could be two ways to integrate the bipolar mind into ones own self power. "
    },
    {
        "name": "t3_1k9o2j",
        "created": 1376413815.0,
        "ups": 2,
        "downs": 0,
        "title": "Father is BiPolar - How to deal with it ?",
        "selftext": "Some background - I'm from India, where only recently is the subject of mental illnesses being dealt with scientifically. We discovered about 6 years back that my dad is and has been a BiPolar for over 20 years. We've observed an dreaded the swings that would occur. He had a stroke 6 years ago and that's when as part of a regular psychiatric examination he was diagnosed as BiPolar.We didn't pay enough attention to his medication then and at some pointed he stopped and lapsed back into hyper manic state a year back and had to be admitted into a specialized mental hospital to get him back on medications and to some sort of normalcy. The last year was all right with himbing calm but borderline depressed and constantly anxious. He stopped medication again a 3 months back and seems to be slipping back into the manic state. Luckily we were able to identify the symptoms in enough time that we are able to put him back on medication. However, because of the long years of his behavior, the entire family has lost the will and empathy to deal with him simply as a patient. There are endless recriminations and I personally bear a lot of resentment as his behavior meant an extremely stressful and unhappy childhood for me and my brother. It also meant a very trying marriage for my mother. I feel that it has become us versus him especially in the manic state. But even in the depressed state we end up blaming him for being lazy, and uncooperative. At an intellectual level i understand that this is an illness, but emotionally it is impossible to separate this from his real personality.Is there even a \"normal\" state for a person who has been suffering from bipolar for the majority of his adult life ?How should we deal with this ? Please understand that it is hard to look at things objectively and I'm not expecting years of resentment on both sides to get washed away, but some practical patterns that will alleviate the experience for both my father and the family.During his manic phase he absolutely deplores of anyone in the family and is a great conversationalist with anyone outside of the family. He also spends extravagantly on himself and his interests.During the depressed phase, he is very clingy and needy for the family. He becomes extremely stingy and gets anxious when anyone in the family incurs any expense.Also - the availability of money makes him swing into manic mode.It is frustrating to define his personality in the family. Almost seems like an opportunistic mindset.tldr : dad has been suffering from bipolar for 20 years, only discovered 6 years back. don't know how to deal with it."
    },
    {
        "name": "t3_kub9c",
        "created": 1317262016.0,
        "ups": 6,
        "downs": 0,
        "title": "Healing journeys",
        "selftext": "Has anyone ever tried to get help by travelling abroad to find help in eastern cultures? I've been thinking about going to India to see what I might find.Anyway... what do you think of doing something like this?"
    }
]