[
    {
        "name": "t3_icub73",
        "created": 1597893485.0,
        "ups": 10,
        "downs": 0,
        "title": "Concept proposal for meltdowns",
        "selftext": "Hello. Hope you all are doing well :) I'm a young design student from India.   One of my cousins has autism which inspired me to work in this field.   This is a user journey of an app - BOLDBAND which can be connected to any smartwatch or fitness tracker and be used with any earphones. I know it's a little long but your views on it will be very helpful!1. Were you able to understand it?2. Do you think it is useful?3. What do you like or not like about it?4. What additional feature are you looking for?5. Was I able to understand the problem? Is there anything I have missed?6. Other commentsThis will be very helpful for the future of the project!Rohan is a 15 year old boy falling in the autism spectrum. He is being **homeschooled** and has **frequent meltdowns** due to sensory overload and unexpected events. Every time he has a  meltdown, his mother rushes to his side, hugs him and softly speaks in his ear to help him calm down. Due to his unexpected meltdowns and dependency on his mother, both he and his parents are **afraid to let him go out alone.**INTRODUCING BOLDBANDOne day, his mother comes across the boldband app on the app on the internet and downloads it. She **connects her phone to her Fitbit** and gives it to Rohan. Through the Boldband app on her phone, she **sets a custom vibration pattern and intensity** for the band to vibrate in. Now, every time Rohan has a meltdown, she alerts the app and rushes to his side as the band vibrates simultaneously. Through the reading of the physiological sensors in the  fit bit band, **the app is able to predict** at what readings Rohan is likely having a meltdown. Over the course of a few months, **Rohan gets conditioned to associate the vibration pattern with familiarity** and his mother calming him down. The next time he is alone and the app predicts through his physiological readings that a meltdown is about to happen, it **starts the vibration pattern automatically** in order to relax him. If he has his earphones, a soothing voice clip/ **music of his choice starts playing** while slowly increasing in volume. In case he still has a meltdown, his mother (**emergency contact) is alerted.**After the meltdown is over, he or his mother can crosscheck the duration and enter the cause of the meltdown. This way, he can keep **track of the triggers.**If he connects his earphones to his own phone when he is out, the earphones continuously **measure the noise level outside**.  When the noise level starts becoming too high, he gets an alert notification. If he chooses to stay and the voice keeps increasing, his **earphones slowly start cancelling the noise** or start playing a calm tune of his choice set earlier. He can choose to turn this off if required.This way, Rohan and his parents felt more confident about Rohan’s ability to deal with meltdowns. As Rohan grows up and this conditioning becomes stronger, he is able to live a more independent and confident life.  FOR PDF VERSION AND MORE DETAILS: [Boldband process](https://drive.google.com/file/d/19DaD81UpF4oPJwYiD5gk_Lea2-iYZFgR/view?usp=sharing)"
    },
    {
        "name": "t3_hzxyga",
        "created": 1596045204.0,
        "ups": 4,
        "downs": 0,
        "title": "Concept idea for meltdowns in autism",
        "selftext": "Hello. Hope you all are doing well :)I'm a young design student from India. One of my cousins has autism which inspired me to work in this field. Here is a link to a project that I've been working on and would love to know your views on it. [Boldband wearable - autism meltdowns ](https://priyalshri.myportfolio.com/bold-band)1. Were you able to understand it? 2. Do you think it can be helpful? 3. What do you like or not like about it? 4. What additional feature are you looking for?5. Was I able to understand the problem? Is there anything I have missed?6. Other commentsThis will be very helpful for the future of the project!"
    },
    {
        "name": "t3_bpv9ht",
        "created": 1558148512.0,
        "ups": 17,
        "downs": 0,
        "title": "Women in my work fundraising to take her autistic daughter to India for stem cell therapy",
        "selftext": "Hey guys! So a women in my work is doing a  fundraiser for her daughter we all have to bring in something  baked and wear black to raise money for the therapy.I am totally against being part of it I think it's wrong in the message board about the fundraiser it talks about how  her daughter needs to be \"cured\" and it's very backwards thinking.I'm not autistic but I was annoyed and i dont want to be rude and not take part but it goes against my morals.What do you guys think?).( I never post on reddit so go easy hope this is the right sub)"
    },
    {
        "name": "t3_eoroy9",
        "created": 1579065557.0,
        "ups": 2,
        "downs": 0,
        "title": "This boy is probably first autistic from Nagpur to complete engineering | Nagpur News - Times of India",
        "selftext": ""
    },
    {
        "name": "t3_cmv54a",
        "created": 1565148491.0,
        "ups": 1,
        "downs": 0,
        "title": "Is anyone here in South America or Africa or India?",
        "selftext": ""
    },
    {
        "name": "t3_gitymr",
        "created": 1589382321.0,
        "ups": 2,
        "downs": 0,
        "title": "My 12 year old brother only repeats what we say to him",
        "selftext": "Hi I am a brother of a 12 year autistic kid in India. My brother only repeats the things we say to him. He only speaks when he needs the things he needs (I.e water). He only speaks few words by himself. We want to know whether it is possible for him to improve and how we can help him or talk. Or is it too late for us."
    },
    {
        "name": "t3_8t29tw",
        "created": 1529710506.0,
        "ups": 11,
        "downs": 0,
        "title": "I am from India and my Dr. says autism is hearing defect please take tretment from ENT Dr.",
        "selftext": "Hello I am from India and when I ask my Dr. about my 3 year old son condition my Dr. says autism is hearing defect please take tretment from ENT Dr.and there is no therapist for autism specialist what we all have is physiotherapy and occupational therapist.update.. visited neurologist and he suggest me place few mile away from my home where they gave free ocupesnal therapy, sensory therapy and physicological therapy free of cost thanks to shrimad rajchandra mission dharampur. they going to do ear and eye test as well.. plus dr. tild me to give him CALIBRAIN SYRUP as well.. thank you for help"
    },
    {
        "name": "t3_dy4bb6",
        "created": 1574118253.0,
        "ups": 6,
        "downs": 0,
        "title": "Do I have autism?",
        "selftext": "I am 13 years old. I was born in India, but moved to the US at 8 months old. I had trouble learning stuff, but the doctors said that it was due to bilingual issues, as I started learning just fine afterwards. I even had an autism test twice, and they said I didn't have it. But I really do feel like I have autism. I do make eye contact and I can interpret someone's mood, I don't have terrible difficulty speaking, though I do stutter a lot. I walk a bit weird apparently, with my left foot walking a bit outward. It's not like I can't walk normally, I just don't. I had \"organization issues\" as a kid, and was given IEP services. I found a paper saying I had autism, though my mom said I was categorized as autism because I had bilingual problems and I don't have autism. When ever I'm at home I like to jump around alot, with me commonly jumping around like a maniac when I'm excited(when I'm alone). I feel like a freak doing it. I even stare at the ground most time, with my friends saying I look depressed. When I asked them if I have autism, they said no, with one saying I might be on the spectrum if I think I have the symptoms. So reddit, do I have autism? Please help. I want to take an autism screening."
    },
    {
        "name": "t3_eoa3zs",
        "created": 1578977440.0,
        "ups": 2,
        "downs": 0,
        "title": "Anybody Indian here?",
        "selftext": "I am from India and I just want to know if there are any Indian autistics here"
    },
    {
        "name": "t3_djuu1w",
        "created": 1571466074.0,
        "ups": 7,
        "downs": 0,
        "title": "Mainstream stims: e.g. Shaka",
        "selftext": "Hi everyone. Ive been noticing that a lot of my stims are cleverly socially acceptable. Who can think of some? Here are the ones i thought:-Finger clicks-Shaka hand-Booyakasha (look it up, its where you flick your wrist and your fingers slap together, ali G does it) https://i.imgur.com/eLNnt04.gifv-Unsure hand (flat palm, outstretched fingers, rocking side to side)-Rubbing the back of your neck-Stronking your chin-Nodding (or in india: head wobble) -Literally any hand movement no matter how intense it is as long as you live in ItalyThanks!GabrielXxxx"
    },
    {
        "name": "t3_9323va",
        "created": 1532965330.0,
        "ups": 2,
        "downs": 0,
        "title": "Google Glass Can Empower Autistic People in India: Brain Power",
        "selftext": ""
    },
    {
        "name": "t3_4rjs6a",
        "created": 1467856224.0,
        "ups": 6,
        "downs": 0,
        "title": "Have an opportunity to move to Canada from India, how expensive are therapies in Canada, have a 4 y.o. autistic boy currently undergoing ABA, OT, and RDI, would like to continue the same.",
        "selftext": ""
    },
    {
        "name": "t3_8nsby2",
        "created": 1527892582.0,
        "ups": 2,
        "downs": 0,
        "title": "Have an opportunity to move to New Zealand from India, how expensive are therapies in New Zealand have a 3 y.o. mild autistic boy currently undergoing occupational therapy and speech therapy would like to continue the same.",
        "selftext": "As above and My son is 3 year and 1 month old and according to doctor he have ADHD and mild autism. Me and my wife was away from him for last one year he use to live with grand parents but when we come to know his condition we come back from New Zealand . As I am from India’s small town we don’t have much facility for therapy, every day i go to physiotherapist for one hour where they repeat same exercises of putting stuff on right box or something like that. About my son. He knows 1 to 20, colours, animal names , shapes, and few words . he love to play with cars. But he don’t do conversation or ask for any thing. Or know his name or say mom dad Please suggest me some exercise by which i can improve his communication skills and specally make him play with me ."
    },
    {
        "name": "t3_cdkajx",
        "created": 1563239820.0,
        "ups": 3,
        "downs": 0,
        "title": "Asperger’s syndrome or high functioning autism",
        "selftext": "My name is Christine and I’m 27 years old. In the  9th grade at 15 I was diagnosed with attention deficit disorder and was given medication but it caused me to loose weight and weigh under 100lbs. But, then 3 years later I was diagnosed with depression; but for many years I’ve always had a hard time in social situations and talking to people and making eye contact especially when there are a lot around is really hard for me. I also need a ton of personal space and a certain amount when people are distributing next to me and I hate when people even my sisters or family hugs me. I also hate loud noises with a passion and when I hear anyone starting to argue or fight I will go up and put my headphones on and put up the volume of my music so I don’t have to hear the arguing; and even at a young age I had this issue with arguing or fighting and would go up to my closet and close the door and put my hands over my ears so I didn’t have to hear it. I’ve also had lots of obsessions yuh as Disney movies or Barney when I was little and I have this issue with having to did and refold my clothes if I didn’t do it the exact same way or if they aren’t even enough. In addition I can multiply two by two or two by three digits in my head without using a calculator at all. And I am not good with change and when I had to fly to India for my sisters wedding since her fiancées family lives there and because of the time change, weather change, and lots of people the day before the wedding I started crying and just saying I want to go home. And I can also get really snappy or irritable really fast. Does this sound like high functioning autism or Asperger’s syndrome?"
    },
    {
        "name": "t3_ce2z5d",
        "created": 1563339631.0,
        "ups": 14,
        "downs": 0,
        "title": "50 years since mankind's greatest achievement gave me hope again.",
        "selftext": "Today I've cried almost all day long. Listening to the recordings of Capcom in time to the Apollo 11 launch 50 years ago today. I have scrapped through my last year at University which luckily doesn't count towards my degree classification. I have had major breakdowns, severe anxiety, massive social issues and every day wondering if I can do this. It's days like this that make me think I will do it. I don't know if I can but I will because I won't stop trying till I do. People say this but since I was 5 or 6 I have been fascinated with Space and NASA. This moved onto me loving every space program and being fascinated with everything that occurs. I still do a couple of decades on. This is what drove me to start university, to start learning languages I know would help me if I had a chance. As Chris Hadfield says in his book, I want to know I did everything I could that if I got the chance. I want to make a contribution to physics, maths or space and I will. I will do that. I will live my life to do that. It won't be easy and I will struggle so often and quit but it's days like this that make me realise why I try so hard. How can you not think it's incredible, the shear effort, work, and determination from such a great set of men. Not just the US, everyone that has ever been involved in getting us to where we are today. I will never go to space, the chance of that wasn't ever there at birth so I don't feel bitter or upset, I will have to make a contribution in another way. I am writing this as I need to get it out somewhere, to hopefully someone that understands. I love that we have been to the moon and I love that we have a permanent base in space and I will contribute to that. China, Japan, India, Israel, US, whoever makes the progress doesn't matter, it matters that it is made."
    },
    {
        "name": "t3_7rgvup",
        "created": 1516377917.0,
        "ups": 2,
        "downs": 0,
        "title": "Participants required! Parents of Children with ASD aged 3-11 residing in AU, UK, US or India",
        "selftext": "Hi Everyone, my name is Kim and I’m currently working on my Psychology thesis at Monash University.I am seeking participants who have a child aged 3-11 diagnosed with ASD residing in Australia, America, the UK or India to complete an online survey. The study looks into the association between child behaviour, parenting practices and parental stress.After completion, you will have the opportunity to go into the draw to win 1 of 4 $25 Universal VISA gift vouchers. If you would like to participate please click on the following link: https://monash.az1.qualtrics.com/jfe/form/SV_bsJDpmNjX3iQDvnThanks so much!!  "
    },
    {
        "name": "t3_4gowoo",
        "created": 1461798634.0,
        "ups": 21,
        "downs": 0,
        "title": "The music and arrangements of this song were done by a child on the autism spectrum in India",
        "selftext": ""
    },
    {
        "name": "t3_558092",
        "created": 1475272607.0,
        "ups": 7,
        "downs": 0,
        "title": "A renowned chef in India loved what our students cooked. They practiced it only twice.",
        "selftext": ""
    },
    {
        "name": "t3_4wugjn",
        "created": 1470747471.0,
        "ups": 1,
        "downs": 0,
        "title": "Autism School in Delhi NCR, India | Sashakt-ican",
        "selftext": ""
    },
    {
        "name": "t3_rhygq",
        "created": 1332990450.0,
        "ups": 13,
        "downs": 0,
        "title": "Outsourcing to the autistic rather than to India",
        "selftext": ""
    },
    {
        "name": "t3_6w61qe",
        "created": 1503789092.0,
        "ups": 4,
        "downs": 0,
        "title": "Living in a hot country",
        "selftext": "I'm moving to India from the UK for a few months. The area I'll be moving to is actually cooler (13c / 55f) than the UK, but humidity is much higher. If I want to travel more than two miles in any direction, the temperature goes up to over 22c (71f). The journey from the airport takes about four hours on foot and by bus. For those of you with experience, maybe from AZ or TX, what advice can you give me to help deal with the heat? Anything above 17c is pretty difficult for me, so I really need some methods for dealing with it. Thanks :)"
    },
    {
        "name": "t3_cdgmdb",
        "created": 1563221122.0,
        "ups": 0,
        "downs": 0,
        "title": "Transpact Enterprise",
        "selftext": "It was an enriching experience for the team of Transpact Enterprises to be a part of the 37th edition of India’s largest integrated Trade fair i.e India International Trade Fair 2017 inaugurated at the hands of Honourable President of India, Shri Ram Nath Kovind. Managed by India Trade Promotion Organisation the format weaved together the Business, Social, Cultural and Educational dimensions with B2B and B2C components.The fair Commenced from November 14 and lasted up to November 2017. The theme of the fair for 2017 was \"Startup India Stand-up India\". Vietnam was partner country, while Kyrgyzstan was the focus country, the fair was the showcase of India on the global stage. There were 7,000 exhibitors, including 222 companies from 22 countries along with thirty-two Indian states and union territories. Transpact was privileged to be a part of such a Mega event of the country.After a strenuous scrutiny conducted by the Government of Maharashtra of about more than 200 start-ups, Transpact was selected amongst 60 others to represent the State of Maharashtra at IITF and be a part of Maharashtra Pavilion.We showcased our award winning &amp; forerunner product “The Vestibulator “to more than 6,00,000 visitors which included Overseas Trade Delegations, Foreign Emissaries, Business Leaders, Decision Makers, Policy Makers, State Ministries, Government Departments, Private sector players and Public also. Designed in joint research with The Industrial Research and Consultancy Centre, IIT B to stimulate the vestibular system of the user especially for children suffering from Cerebral Palsy &amp; Autism;The Vestibulator is an unique, innovative, mechanized, digital healthcare solution (device) to achieve   maximum Vestibular Stimulation for vestibular, neuro-developmental and sensory integration therapy.  I am happy to share that We received a tremendous response from the visitors including the queries about where the Vestibulator could be brought from, when will it be in the market for sale and so on. The concept, design, technology and the extent of Vestibulators’ socio-economic impact &amp; relevance received an optimistic feedback technology experts, policy makers, academicians, general public and visitors such as Shri Ramdas Athawale -Minister of State for Social Justice, Shri Shivaji Daund-Managing Director MSSIDC, Shri Harshadeep Kamble -State Development Commissioner  (Industries) , Mr. Kush Kesari -CS MSSIDC and many more.Maharashtra Pavilion received a special appreciation from the Government of India for its excellent display of start-ups.  "
    },
    {
        "name": "t3_arj5tz",
        "created": 1550425478.0,
        "ups": 1,
        "downs": 0,
        "title": "A book to learn about the spectrum",
        "selftext": "What would you suggest a self diagnosed aspie, who wants to begin learning about the spectrum. I am from India, and Amazon suggestions really turn me off. They are books about \"curing\" autism in kids. "
    },
    {
        "name": "t3_qa26e",
        "created": 1330485815.0,
        "ups": 2,
        "downs": 0,
        "title": "Volunteer Group Traveling to India and Nepal to Provide Autism Training. Are You Interested in Following A Video Blog? [x-post from /r/rwb]",
        "selftext": "My name is Christopher Flint, President and Founder of AACTION Autism (www.aactionautism.org). We are committed to providing autism training and support to vulnerable areas across the globe. In places where autism is mostly unrecognized and undiagnosed, the consequences for families and children with autism are severe. Mothers are routinely blamed for their children's autism. Families are shunned by their community. In worst case scenarios, children with autism are hacked, drowned, and maimed - losing the potential to lead productive, happy lives.We raise money through donations and small fundraisers. Because we are working with areas that have very little financial resources, we raise all the funds so they do not have to pay a penny for our training. Our team members take vacation time from their jobs in the states to volunteer their time and expertise.We are returning to India and Nepal from March 8th to March 25th. We would be happy to take video of our work, testimonials from parents, life in India, and whatever else you would like to know if there is interest. Sometimes internet access can be spotty so putting a video blog like this together can be tricky, but it is an important story to share. Please let me know and thank you for taking the time to read this post!Edit 1: Thank you all for your support and suggestions! We are definitely going to do our best to get the blog going - we will update you when we are on the ground and ready to go! If you are interested in supporting our work you can donate securely here:www.aactionautism.org and click \"Donate\" in the upper left hand corner!"
    },
    {
        "name": "t3_89aufp",
        "created": 1522766871.0,
        "ups": 0,
        "downs": 0,
        "title": "(Controversial) . FDA - Vaccines - Autism .",
        "selftext": ""
    },
    {
        "name": "t3_3ze13t",
        "created": 1451926338.0,
        "ups": 10,
        "downs": 0,
        "title": "My technologically illiterate father-in-law wants to read up on Autism",
        "selftext": "Can someone suggest a good book or article. I really liked the way [this article](http://thechimericalcapuchin.com/why-youre-probably-thinking-of-autism-wrong/) describes it. Thanks [/u/zvardin](https://www.reddit.com/user/zvardin) for suggesting it.Any other similar articles or books that might help him understand would be great!!! Please understand, he is old, and will probably read this on a printed sheet.Thanks,H"
    },
    {
        "name": "t3_8saol4",
        "created": 1529457806.0,
        "ups": 5,
        "downs": 0,
        "title": "Missing opportunities while on autism",
        "selftext": "I had planned to go meet friends this past Saturday as we/they get together on occasion to play D&amp;D usually on Saturday nights. It boosts my mood. And because I've been pretty depressed, and like I'm getting over a major autism burnout from this past year, I really wanted to go, especially after I visited with a friend earlier in the week(and felt better after). But, I completely forgot about it--the time just passed. I'm diagnosed with PDD-NOS  I feel like just sharing this is like good for me. I can't help feel they'll be someone out there who can relate, and Thank you for reading/ interest.  So, when I was 7 I got this picture developed in my mind. I say that was when I started realizing the structure of our society, and saw many possible paths of opportunities to live the kind of life I wanted to live just go dark in my mind. I say this because I feel  the lack of involvement by the community at large, in so much as the lifestyle and mindset don't seem to give much care to things I care/ cared about.I don't like living here in the southern bible and cajun country.  I am sad to report, although I'm intelligent and creative, I am not getting out shinning my light so to speak.but on the other side, I'm an adult now and certainly capable of change.  I more easily shrug off what people express. Although, I still sort of feel I take on -empathically\" a certain unfulfilling mindset-the interaction that leads to inaction.when I went to india, the auryvedic doctor said \"i'm too much in other peoples minds\" and he perscribed herbs which I beiieve would have helped, but I was on autism. ..missed my best friends wedding...... ... can you relate"
    },
    {
        "name": "t3_6fezes",
        "created": 1496706391.0,
        "ups": 6,
        "downs": 0,
        "title": "Burnt out Caregivers",
        "selftext": "So background first: my brother is a low-functioning non-verbal autistic person.  He's fifteen years old now and increasingly aggressive. We live in India so there aren't many opportunities for speech and behaviour therapy.  Reuel still doesn't have a way to communicate.When something triggers him badly, he bites, scratches, headbutts, pinches and pulls the hair of the people beside him. It's very painful, especially because as he gets older it's difficult to control him. While the pain makes me angry, I feel like it's a justified punishment for not doing more to help him when he was younger or not paying enough attention to him. Feeling sad and anxious. Comfort welcome."
    },
    {
        "name": "t3_5uxjxu",
        "created": 1487525428.0,
        "ups": 2,
        "downs": 0,
        "title": "Need evaluation for my baby",
        "selftext": "HelloWith the help of this thread I want to make myself aware if my son has autism.My son has completed 21 months today. However he still does not turn back by calling of his name. He does not play with all the toys like other kids, he is not very possessive about his toys, still we have to feed him with help of kids rhymes on YouTube on my TV; does not eat on his own; doesn't know to ask for milk or water and just cries for it with fingers in his mouth; he is not comfortable like other kids in play area and just keeps with myself or my wife and does not play independently; wants to be lifted; sometimes feels lost and cries when I am sitting/standing very near by. His hearing is perfectly fine and has some blabbering words. Based on all these symptoms he has been referred to Kindering for an evaluation which we got an appointment for 4 weeks from now.Some important background:His first year has gone in lot of pain and he has only seen hospital, nurses, doctors, catheter, needles that will be put on his veins. At an early age of 3 months it was found that he has urinary reflux because of which he used to get sick with urinary tract infection. The fever would be detected at the last moment when the infection is at peak and it would not be possible to treat him orally and would have to be injected. After his first occurrence of UTI at 3 months we decided to move to our country India and get this sorted out because we had reference of a very good robotic surgeon that can do the surgery if necessary. So from month 5 to month 12 he was in India and now we are back to US. Most of the he time spent in India has only been at the hospitals as he got UTI 4 times and after that we did Deflux procedure on him. Since then he hasn't had any UTI repeat. This background was important here to convey that my son went through lot of stress and hasn't been to any play area and could not get social. He also feels scared if he doesn't recognize a person and thinks probably that person will poke him with needles like the nurses/doctors. His ultrasounds will go too bad !!!When we came back to US on his 13th month he had to learn car seats, play area, socializing, grocery store etc. He is OK in places he is comfortable with like at home and play area but he definitely doesn't play like other kids. Like never sits for story time etc. Only game he wants to play is hide and thinks we are coming to catch him and has a hearty laugh. We are also not able to stop his habit of watching rhymes on our TV. We have to take assistance of those videos if we want to feed him(doesn't chew the food but has teeth), give medicine etc.Can someone based on their experience with Autism tell me if what he has sounds like it? Or is he just a shocked/tensed kid that is just late to socializing.Thanks in advance for your patience to go over this and respond."
    },
    {
        "name": "t3_274pzq",
        "created": 1401762046.0,
        "ups": 3,
        "downs": 0,
        "title": "need help teaching a child on the spectrum",
        "selftext": "I was recently hired to care for an 11 year old boy who is clearly on the spectrum. The parents are in a bit of denial. They want someone to teach him to talk. I've encouraged them to take him for therapy, given them a card of who to call, any way, I 'd like to do my best, does anyone know web sites or advice on how I can work with him over the summer. My son is ASD so I am familiar. Also they are from India if that matters."
    },
    {
        "name": "t3_80bpe9",
        "created": 1519664607.0,
        "ups": 0,
        "downs": 0,
        "title": "Parents of children with ASD - Participate in study",
        "selftext": "Hi Everyone, my name is Kim and I'm a student at Monash University, Melbourne currently completing my thesis for Psychology. I am looking into the relationship between behaviour, parenting and stress amongst parents of children with ASD. To be eligible, you need to have a child aged 3-11 diagnosed with ASD and living in Australia, America, the UK or India. You will also be in the draw to win 1 of 4 $25 VISA vouchers. To participate please follow this link: https://monash.az1.qualtrics.com/jfe/form/SV_bsJDpmNjX3iQDvn Your help is greatly appreciated! "
    },
    {
        "name": "t3_3yings",
        "created": 1451335377.0,
        "ups": 5,
        "downs": 0,
        "title": "Occupational Therapy: Can anyone suggest a good youtube channel, or a good tutorial for parents?",
        "selftext": "Please note I am based out New Delhi, India. I may not have access to the facilities that US based people might take for granted. If you are also from New Delhi, then please do suggest possible local facilities.I have a 3 and a half year old non-verbal son who was diagnosed at 2 years (a day after his birthday). Our first clue was he wouldn't respond to his name in the play-school. We enrolled him into an Early Intervention program and were not happy with the results. Four months ago, we found a place that uses ABA for Speech Therapy. For a few months, we did the Early Intervention in the morning, and ABA Speech in the afternoon. AJ responded very well to the ABA therapy. The ABA people asked for him to be sent in the morning for maximum effectiveness, hence we decided to pull him out of the Early Intervention Program.However it seems that the absence of the daily Occupational Therapy we were getting in the Early Intervention program has led to his attention span reducing significantly, and has made him more aggressive. As per his ABA therapist the following behaviours can be corrected through OT:* He has started biting people in fits of anger. * He has developed a fascination with the ceiling (not just fans, but lights as well). * He runs while making an \"aaaaaa\" sound * He lies on his stomach and tries to hump his hands while holding his private parts* He touches and fondles his private parts a lotWe are particularly interested in doing some part of the OT ourselves. Right now we are only doing some balancing and deep pressure rolling on an exercise ball. Any online resources, that help us identify what activity to do, and how to do it correctly would be really appreciated.Please note, we are getting professional OT help 3 times a week for 45 minutes each, but it seems to be very insufficient and that is why we are seeking your help.Thanks H"
    },
    {
        "name": "t3_30c53i",
        "created": 1427371092.0,
        "ups": 1,
        "downs": 0,
        "title": "What is a good gift for a severely autistic person?",
        "selftext": "I don't know exactly the details but she has the mental age of 3-4 years old. (She is actually 23 though) what kind of gift should I buy her? I'm in india so I want to buy something local as a souvenirs. I was thinking jewellery... Eg pretty bangles etc."
    },
    {
        "name": "t3_3ltt86",
        "created": 1442884728.0,
        "ups": 1,
        "downs": 0,
        "title": "About careers in autism",
        "selftext": "Hello All,I am a sophomore Arts undergrad from India, planning to do majors in Psychology. A nephew of mine was diagnosed with autism a few years back, and I have been reading up about the condition for quite some time. I want to pursue a Master's degree in the study of this condition.I need some career advice. Do you guys know any good courses that might suit my qualifications (Non-medical, psych student)? I know a career in this field should come out of passion, but how are the opportunities for this domain? What kind of work am I looking at?I know thats a lot of questions, but any help is appreciated :-). Thanks!"
    },
    {
        "name": "t3_gw6v8",
        "created": 1303657048.0,
        "ups": 5,
        "downs": 0,
        "title": "Someone here could help me",
        "selftext": "I have a little brother who is restless all the time. He is now 4 years old. I  am from India and the knowledge about autism is not that much as in western field. After some googling i found it could be a sign of autism. Doctors here says are unclear about this. When he was born he was underweight. What I found about him is that he is trying to release his energy. Someone could help me"
    },
    {
        "name": "t3_we4l5",
        "created": 1342054165.0,
        "ups": 3,
        "downs": 0,
        "title": "Does my daughter fall under Autistic spectrum?",
        "selftext": "Hello All,My daughter is 26 months old. Amazing kid , very active, smiling, throwing things around but does not talk. We started getting a little worried after her second birthday. So, we took her to our pediatrician who did an initial analysis and said she might have PDD. I have a follow up appointment for the coming week with a specialist. But i am anxious. I also want to be prepared for next sessions and what is coming my way. Please help me understand this. Also, please note that i am in India where the awareness for Autism is not very prevalent. I myself started to learn about Autistic spectrum only after the session for my daughter.Here are her general behaviour:1)  Walking    - Yes2)  Running    - Yes3)  Climbing Stairs  - Yes4)  Climbing Down Stairs  - Yes5)  Eye Contact  - Yes6)  Pointing with finger - No7)  Words   - Very few (about 5 to 10)8)  Sensitive to Voice - No9)  Plays Peek A Boo - Yes10) Imitating Voices - Yes11) Pays attention  - No.However i was not able to understand a few questions the doctor asked.1) Repetitive Behavior      What kind of behavior is repetitive. She likes to play in water for hours. Does this count?2) Communication.      She understands when we say 'No',when we say we are going out or time far bath. Is this a good enough measure?3) Playing with toys properly.       What does this mean? How do i define measure this properly? 4) Staring at nothing.        She does stare out the window while driving or while i am holding her in Balcony. Not sure if this is what the doctor looking for."
    }
]