[
    {
        "name": "t3_jtwbyh",
        "created": 1605359372.0,
        "ups": 220,
        "downs": 0,
        "title": "DAE stare at other peoples SH scars",
        "selftext": "But obviously not in a mean way they just grab my attention and by the time I realize I'm staring its look late and its obvious I was looking and now they think I'm judging them but I'm not but I also cant say like \"hey I'm not judging you I do that too\" because that would be even more weird so you say nothing and move on?Me too"
    },
    {
        "name": "t3_i4yrrz",
        "created": 1596772062.0,
        "ups": 9,
        "downs": 0,
        "title": "Anyone from India?",
        "selftext": "SH in India is literally hitched to only one thing — lOvE fAiLuRe (or relationship problems). Like, are you actually serious? I haven’t truly loved anyone in my 21 years of existence. I just can’t ’cause of my screwed up mental health. I have turned down a great deal of love proposals, and I have done it hard. You shall as well go ahead and call me a misanthrope, idc. People around me know that well. But the rest? sHe mUsT hAvE gOt DumPeD. sHe mUsT bE cRaZy. Really? REALLY? I’m not saying that going through a breakup is a thing to be ashamed of or anything of the sort but... Imagine being judged for something you literally have NO ties with just ‘cause you SH to feel something. This is why I always wear hoodies and sweatshirts even at 37°C. Man, this is bad. So bad. PS: Sure, there are people that SH over the said but just not everyone. I wish boomers understand that."
    },
    {
        "name": "t3_jui8fy",
        "created": 1605454662.0,
        "ups": 10,
        "downs": 0,
        "title": "There was no reason.",
        "selftext": "So I was dancing in my room with music blasting through my headphones like any normal day and then I hit my lamp and it proceeded to fall and break.  I found the entire situation very humorous for some weird reason, and I was laughing and talking to my friend about my stupidity, she told me to be careful while cleaning it up and there's that. But here's the thing, I saw the pieces of glass, got an idea and just simply....started cutting? It's been a month or so since the last time, I've never cut with glass before, probably shouldn't use this word but I was genuinely just curious. Is it a form of establishing self control...? That I can do whatever I want whenever I want? A little bit of backstory, I come from a highlyyyyyyyyy religious cultural sexist homophobic etc suburb in india, I'm not even allowed to take walks outside because I'm a \"girl\". Its something I'm used to. Anyways, has anyone else every done this? I used to regularly cut because of mental breakdowns. But that wasn't the case this time.  I'm too scared to tell my friends knowing how they'd react, I don't really know who else to go to, so. Also, I'm still not sad, I cleaned it up and I'm just sitting here chilling. Maybe a bit confused. Maybe this entire thing would hit me later and I'd break? I have no idea."
    },
    {
        "name": "t3_hnc72m",
        "created": 1594219600.0,
        "ups": 3,
        "downs": 0,
        "title": "Hey is there any indian here who self harms and has depression and shit?",
        "selftext": "because i just kinda want to know how you opened up to your parents,and if there are any psych wards stuff in india and how helpfull were they  because well idk,because indian parents are generally more stricter and harder to talk to(and i mean that's my fault as im not able to open up about my feelings)"
    },
    {
        "name": "t3_glvesy",
        "created": 1589808753.0,
        "ups": 19,
        "downs": 0,
        "title": "I made a self harm sleeve out of a fluffy sock to cover up the scars on my arms",
        "selftext": "The sight of the scars was triggering me. I relapsed and tried to kill myself about 3 days ago, but I'm much better now. Looking at my scars was making me very uncomfortable and scared so I took a fuzzy sock and cut off the part from the heel to the toes, hemmed the cut portion and now I wear it on my arm to cover up the scars. I could wear jackets but it's extremely hot right now in India so this is a more comfortable alternative. I thought it could be helpful to someone else too."
    },
    {
        "name": "t3_fi43en",
        "created": 1584152204.0,
        "ups": 1,
        "downs": 0,
        "title": "I wanna die",
        "selftext": "I wanna die but can’t kill myself, so I’ve started slowing down and being more reckless while crossing roads so that a car/truck and deal with this for me, plus I live in India so this is very likely. All my friends are assholes and I don’t have a very good family. I don’t understand the point of life, cause Aristotle said it is happiness but nothing makes me happy anymore. So the thing that my life looks at is death, why prolong it?"
    },
    {
        "name": "t3_eqfb8o",
        "created": 1579375613.0,
        "ups": 4,
        "downs": 0,
        "title": "The limbo",
        "selftext": "I was given valpouric acid as my medication and it helped me stop cutting and having suicidal urges. I was 4 months clean. Then I went to India to see the doctors there and they recommended I be put on lithium. They're started lithium now but the dosage is too low to have much affect, I've started cutting again. This is the limbo. I love the feeling too much to stop. My parents found out that I've been doing it and my dad cried. I feel shitty for hurting them like this. But the pain I feel inside is so excruciating and only self harming helps making it go away temporarily.I needed to be upset before to do it, now I don't really need a reason. It's like a daily ritual."
    },
    {
        "name": "t3_881wx6",
        "created": 1522364140.0,
        "ups": 25,
        "downs": 0,
        "title": "Will my psychiatrist institutionalise me if I tell them I self harm?",
        "selftext": "I want to start therapy to stop SH but I live in a third world country and mental institutions are seriously hell here. I cut on my upper thigh so no one can see it and not tissue deep yet. Has anyone else had an experience with this?Edit: also I just turned 18 so will they still tell my parents?"
    },
    {
        "name": "t3_8pn183",
        "created": 1528516649.0,
        "ups": 0,
        "downs": 0,
        "title": "I've been feeling really lost lately.",
        "selftext": "This post is probably a little irrelevant for this community. But it here it goes. Since recent times, I've been feeling really lost. I don't feel like doing anything. I've been an intelligent kid and I still am. I have ambitions and goals in life, short and long term. I love Physics and want to pursue my career in Quantum Mechanics. As passionate I am about this, I know if things go as planned, I will achieve something in life. But at times, all of it seems worthless. I feel like nothing matters at all. No matter how much I study and work hard, in the end it's not gonna matter. I'm still gonna be this lonely nerd who no one likes to be around. And I'm still gonna have this miserable feeling like I'm not worthy. And this feeling is so deeply ridden in me, that now I question myself on every decision I make. I tend to blame myself in every situation.Which just makes me feel like nothing's ever gonna change. This part of me tells me, I can't accept mediocrity from myself, hence I don't have a choice, all I can do is kill myself. I also sometimes feel like this is just the immature part of me and I shouldn't pay any attention to this. But I really someone mature to talk me through this. This is my first post on Reddit, pardon me if I've violated any rules/guidelines.  "
    },
    {
        "name": "t3_7uvkaz",
        "created": 1517643155.0,
        "ups": 2,
        "downs": 0,
        "title": "one of you cool cats should message me",
        "selftext": "kinda' buzzed and trying to not cut, anyone wanna chat with a depressive self-loather?"
    },
    {
        "name": "t3_2ohb94",
        "created": 1417921793.0,
        "ups": 6,
        "downs": 0,
        "title": "Shit.",
        "selftext": "I'm trying to stay clean for more than a day, but I'm twitching so badly I can barely type. We've been evicted twice in the past four months (let's just say my sisters can't keep their mouths shut) and it's getting really hard to keep from cutting deep. The stress is unbearable, and I've been getting hell in middle school. The bullies, the unwanted attention, the fucking counselors and teachers pulling me out of class to ask empty questions of my health and stability that I know they don't really care about. Nobody knows about my suffering, only you beautiful strangers who I've only just begun to talk to. This shit is deep, and my mother has started drinking.. Again. It's getting horrid.. I just need someone to talk to. There is a lot more, but I can't bear to type much longer.. Can any of you pull me away from cutting or please can you just talk to me, distract me from the razor blades? EDIT: Thank you for responding and keeping me distracted, I couldn't be more grateful! 12/7/14"
    },
    {
        "name": "t3_4fkyv6",
        "created": 1461144951.0,
        "ups": 7,
        "downs": 0,
        "title": "Today I cut myself in school. Here is my experience. What are your thoughts? Am I justified in being mad at the person described below?",
        "selftext": "Today is Tuesday, the nineteenth of April, 2016. Last night, my friend Kelly texted in our group chat of 7 people that her computer was not working. The screen was blue, and it said your PC needs to be repaired. She was asking for our help. One person just laughed at her problems and told her to buy a new computer. I advised her to contact the Microsoft Answer Desk, and to be very friendly to the tech support and butter them up in order for them to not charge you, by asking them about themselves and India. I speak from experience, as I was able to get Microsoft to give me free copy of Windows 10 using this method, although I did not explain that to Kelly, so her initial response I believe is somewhat understandable, because I can see how it could be interpreted as if I was just making fun of tech support and her problem. So anyway, Kelly responded angrily that we were just being sarcastic and making jokes about her problem. I told her that I was trying to help, to which she replied, “It’s whatever, I’m just fucking over it”. I then said that I was serious and told her to not give me that attitude when i was offering legitimate advice. She never responded for the rest of the night. I could not understand why she would still be mad at me if I was trying to help. I wish that she had responded so that we could talk it out, but she did not. I had tried to help her, and she had yelled at me so I felt very sad (I would become even sadder the next day, when I tried to discuss this incident with Kelly, and she ended up just yelling at me again).Later that night, I got into bed and decided to cut myself for the first time in about two weeks. My cuts were not severe, more like scratches to be honest. I did it on my legs for the first time.I have no classes with Kelly, so the only time I see her is at lunch. So today when she came and sat down, I said, “Kelly, what the heck? I was just trying to help you.” And she instantly got mad and said very irritably how she was not going to talk about this, that she is over it, and that she did not want an argument. First, if she did not want an argument then she should not have raised her voice. I was perfectly civil when I spoke to her. And second, just because she was over it does not mean I was also over it. As a matter of fact, Kelly’s angry response towards me, when I just wanted to have a discussion about something that really bothered me, added further insult to injury. However, I kept my head, and I told her calmly and firmly that I was not trying to start an argument and that I just wanted to talk, because she had really hurt me last night. I again emphasized how all of my advice had been 100% serious. She did say sorry, but I felt as if it was insincere, as if she was just saying it to get me to be quiet. After she apologized I did not press any further, because she was quite irritated. Again, I don't understand why she would get so annoyed when all I wanted to do was talk to her about how she treated me last night. But having Kelly get mad at me once again made me very upset. I honestly felt like crying. I did not say much to her for the rest of lunch, and when it was time to go to class, she got up and left, instead of walking with all of us as she normally does.After Kelly and I finished our brief interaction, I felt awful, so I grabbed my blade (which I keep on me at all times in my backpack, although I had never used it at school before) and went to an obscure stairwell that is very rarely used by anyone. I made one cut on my arm, and then moved onto my legs. On my left thigh I made a star type drawing. On my right thigh I made about 12 cuts. The cuts on my legs were quite deep, far deeper than I had ever gone before on my arm. I think I cut so severely because I was more distraught in that moment than I had ever been before when cutting. Not to mention, being in school forced me to be quick so it is possible that I just went all out while cutting instead of just experimenting and seeing how much I feel like cutting at that particular moment, which is what I typically do. I went back to lunch after my quick session of self-harm, but did not say much to anyone. A friend asked me where I went when I returned without food from the lunch line, but I told him nowhere.If you have read this far, thank you for your time. Sorry for the long post.Regards,A Wounded Soldier"
    },
    {
        "name": "t3_4yxfg6",
        "created": 1471846360.0,
        "ups": 32,
        "downs": 0,
        "title": "She now feels joy.",
        "selftext": "My apartment complex had a 'summer party' today. I went to see the sights and just be around people. For reasons I don't fully understand, I don't strike up conversations with strangers, ever, but I enjoy being around other people. But then I saw this one girl, one of the workers for the inflatable ~stuff~ present, her primary role: overseeing safety on the inflatable water slide.The first thing I noticed about her was that her arms were burned to a crisp. She was about as white as white people get, but her job keeps her in the sun so much that she had the skin color of someone from India. It was impressive in its own way, how adaptable our bodies are.After about 10 minutes, as she turned, I saw it. Lines. Dozens of lines on her entire bicep. I looked closer, both arms, and forearms. She wasn't just a cutter, she cut deep and often. But the wounds were all fairly subtle, only made aparent as the sunlight bounced off them just right. They were deep at the time they were made, that was obvious because of how they had healed, but they were also older.I watched her for the next few hours. She loved her co-workers, she danced to the music, she wanted little more than for someone to give her a hug (she got several, but she had to initiate all of them. I wonder if her co-workers realized what it would mean if they'd just hug her for once?). She'd get tired and sad, but then she's remember the water slide wasn't busy and she'd run down and slide on it and be back to smiling. She'd go down a different slide with a co-worker and they'd use their hats to soak each other.At one point she stepped on a twig and limped around for a bit, but I never saw blood, so I think it just hurt (she was barefoot). I should have seen if she needed anything, but...I recognize my failing and will work to correct it.For all the pain she had in her life at one point in time, she now was much happier. She loved her job. She loved her co-workers, and she didn't feel the need to hide her scars anymore. I believe she had healed from whatever held its power over her in her younger years.I never spoke to her, my observation was not overly subtle. *shrug* we all have our flaws. I left in silence as not to make her even more uneasy. But why do I write this? Well, partly because I'm so sorry I couldn't find a way to strike up a conversation with her and make sure she was ok. Partly to tell everyone here that it can get better. Finally, partly because sometimes, that creepy guy standing around just watching actually would love to give your soaking wet body a hug if he thought it'd make you happy, or get you a snowcone. I totally guessed right, by the way, she wanted blueberry (I opted for Cherry myself).Context: I had a former girlfriend who self-harmed prior to us meeting. She never talked much about it, by I knew the difference in scar tissue because she did tell me rough ages and levels of damage (we both knew biology, we knew skin layers). That is the information I used to evaluate this new person. I am an engineer IRL, hence my desire to quantify everything.I'm so sorry stranger. I wish all the best for you, and I hope that guy you're friends with either dates you, or invites you over to snuggle up and watch TV sometime. I kinda doubt her realizes just how much you love his positive energy and spirit. Shine on bright star, your past doesn't hold down your future. :)"
    }
]