[
    {
        "name": "t3_jyp5gb",
        "created": 1606046460.0,
        "ups": 1,
        "downs": 0,
        "title": "Is it possible to get effective treatment for ADHD in India?",
        "selftext": "I have been diagnosed with ADHD three years ago but have had little to no follow up treatment. I am 21 now and have dropped out of two colleges. I'm finally pursuing a course that I like but almost had to drop out of this one too due to lack of attendance and inability to complete my assignments. Atomoxetine (Strattera/Attentrol whatever you call it) just made it worse for me but that is the only widely prescribed drug for ADHD in India. Methylphenidate is next to impossible to obtain and every psychiatrist I have consulted since has recommended therapy over using Ritalin.  As I get older, life just seems to get worse. Seeing my peers on their way to settle down in life while I'm here disoriented and generally unmotivated to do anything. I hoped that if I pursue my creative calling things would start to get more organized but that has turned out to be wishful thinking."
    },
    {
        "name": "t3_hbzlql",
        "created": 1592597575.0,
        "ups": 4,
        "downs": 0,
        "title": "18M from India, here a lot of importance is given to exams. Specifically JEE to get into the most prestigious uni. I have been preparing for it from past year. I have truly worked hard but i keep forgetting everything. There are some chapters i have studied from scratch over 7 times. (Below)",
        "selftext": "I think that I have ADHD I show almost all symptoms, when I searched online. Recently I have been struggling a lot. Results will be revealed in a few weeks. It's too stressful. Will getting some validation help me out? I don't know how I will face my parents and relatives who are more eager than me for my results."
    },
    {
        "name": "t3_jv29il",
        "created": 1605538002.0,
        "ups": 4,
        "downs": 0,
        "title": "exams coming up need suggestions",
        "selftext": "hello i am a 15 yr old (m) from India and have a big exam coming up known as the Boards. Was recently diagnosed with ADHD and cant seem to concentrate .  meds not prescribed ,moderate adhd . pls help with tips to concentrate . boards define which career path i take and are really important to the future of an indian student so pls do help."
    },
    {
        "name": "t3_hkgjxi",
        "created": 1593800079.0,
        "ups": 8,
        "downs": 0,
        "title": "Lack of awareness of ADHD in India and other developing and underdeveloped countries.",
        "selftext": "I got my ADHD diagnosis almost an year back (at age 25). It was hard to explain my condition which had been a part of my personality to my parents and friends even when my dad is a practicing pediatrician. Like him, most other doctors and psychiatrist here associate ADHD with intense hyperactivity and childhood. The emotional and attention part is almost sidelined. 2 doctors I visited assured me that the condition goes away with adulthood and is present in only children and almost laughed me away. The way one of them took my Conners test was tragic to say the least. I was fortunate enough to have access to better mental health professionals in Mumbai while doing my masters, but recently coming back to my town during lockdown I have realised more how pathetic the condition in smaller cities is regarding ADHD awareness even among practicing psychiatrists. After researching a bit I am taking an educated guess that it must be similar in other such countries. The people even willing and aware enough to get help cannot avail it. During my master's, on the advice of my counselor I told my research guide that I had ADHD and sometime I may need a little push to meet my research targets. His behaviour with me changed completely after that. He treated me as if I was depressed or schizophrenic. It was sad to see a natural science academician behaving so ignorant. I am not sure how things are in the global north but things here are gloomy and mental health practitioners and educators need a lot of training to say the least."
    },
    {
        "name": "t3_j4ygkd",
        "created": 1601844771.0,
        "ups": 67,
        "downs": 0,
        "title": "Finally Diagnosed!!!",
        "selftext": "I'm so so happy right now! I'm ecstatic. Such a huge portion of my life finally makes sense now! I almost can't belive it.Getting diagnosed in India is such a difficult thing.I've been lurking in the sub for almost a year now, and I can finally stop feeling like an impostor (insert all the Among Us jokes here.)I can finally feel free.Not totally though, my family is still unaware of it and I don't know how they will take the news. Typical Asian parents smh.Fingers crossed for my medication though.Thanks for listening!"
    },
    {
        "name": "t3_jtcvma",
        "created": 1605281251.0,
        "ups": 2,
        "downs": 0,
        "title": "I need help",
        "selftext": "I feel weird while reading or doing anything. I feel like I can feel my heart beating while doing it. I believe it becomes more pronounced after I go out of my house for sometime or walk around talking to someone on the phone. I usually come back home and lie under my blanket in my room alone. I knew it was something. I described it to my psychologist as something that happens after some “movement” happens. She brushed it aside saying it doesn't make sense. I knew it happened. Since then I've been diagnosed with Adhd and I'm on 75 mg Strattera(I'm from India so the name here for atomoxetine is different though). It's helped with my attention. I've been taking it for a little over a month. But I can't focus after going out or having some, you know, “ movement”.Is it something like sensory overload or something else?? Can anyone help me with it??"
    },
    {
        "name": "t3_hv6zta",
        "created": 1595365526.0,
        "ups": 242,
        "downs": 0,
        "title": "Just a reminder you still have to LEARN HOW TO STUDY",
        "selftext": "I started taking meds about 3 months ago, and  the change was instant. I'm able to focus on a task when I want to, I can put away distractions, and when they pop up I can restart whatever I was focused on before which is insane; however, at first because I started taking my meds during my exam season I was basically trying to study 8 hours a day, and I wasn't doing well. Even on days where I managed to do like 6 hours I still wasn't working efficiently. I think I forgot that studying in itself is a skill too, and I was way behind my peers in terms of knowing how to study, how to make a proper planning etc. After 3 months I finally feel like I've made some progress, so lemme tell y'all what I've learned.&amp;#x200B;How to study STEM courses by me: (Idk if this is super applicable to every major, but I hope I help some people) Basically what you want to do is start doing your theory, and as soon as you have enough formulas to start doing even very basic problems do them, if your book or professor says to do some problem, even if you're looking at it like I can do that in my head, just do it on paper. I figured out that those basic problems aren't there to challenge you, it's just to make you remember the workflow or the concept. If you just do this as you go through your chapters you'll already improve a lot. I also found that \\*suprised pikatchu face\\* doing practice problems/ homework helps a crap ton in getting you to remember things. It also really helps to find someone you can discuss this stuff too, for example before I went back home I was doing daily walks with my dad where I would explain to him what I learned in electronics, these talks where super helpful in getting me to figure out if I actually fully knew something, and they also helped me remember information a ton.I also found that ADHD can be your friend in studying, (not applicable if your exam is literally tomorrow) when you\\]re studying if you read anything and your mind latches on to it 100% jump into the rabit hole, for all the STEM subjects this will greatly improve your understanding of the material and will make you better in the courses as a whole. Like if you read something and you're like why is that like that actually just let your adhd do it's thing and just hyperfixate on that thing for a while, go look up a khanAcadamy deriving the formula, go watch some proffesor in India explain it amazingly, read some article on purple math, all of these things will increase your understanding and you should just go with the flow on them. Also in my experience doing this tends to be fun as well, so it's only a positive, it's not a waste of time. I've also found that keeping my laptop open with schoolwork on it also helps me out because sometimes it'll just catch my eye and I'll end up just randomly learning when I planned to do something entirely difference.EDIT: tried to ad TLDR, but it's p longTLDR; figure out how you study because meds don't teach that and you're behind. Go down rabbitholes (related to what your studying) when you study, it builds understanding. Actually do the easy problems, don't say I can do this in my head and then skip them. Keep tab with stuff related to studies open, you can also get distracted from non-productive things by seeing productive stuff and it grabbing your attention.&amp;#x200B;"
    },
    {
        "name": "t3_jop2sf",
        "created": 1604632786.0,
        "ups": 3,
        "downs": 0,
        "title": "22M/Indian/Diagnosed with ADHD/ Struggles with generalized tests and esteem issues, please read ahead.",
        "selftext": "Okay so this might be a bit long so apologies in advance.Background: I grew up to stories of my childhood where I did crazy hyperactive shit and everyone just passed it off as a phase. Always had issues focusing and studying, did decently in 10th, got a 9.8(on 10) Cgpa, for people who don't know what happens after that, you're sent off to a JEE(Joint Entrance Examination for the prestigious IITs, some 16-17,00,000 candidates appear for some 8-9k seats)Coaching institute. I left my school and joined a dummy one where I just went to attend the exams and slogged for JEE all day long. As expected, I failed spectacularly (got 82% in 12th)and even missed the cutoff  by a small margin. Managed to get a government engineering college and started my life there. I still had no idea about my condition and decided not to repeat these mistakes again. I ended up as the gold medalist from my batch and even secured an AIR(All India Rank) of under 55 in GATE(Graduate Aptitude Test in Engineering). I couldn't get a college of my liking so joined a Fortune 500 company I had gotten placed at. Life seemed good until my job turned out to be utter shit, I prepared for IELTS (8.5) and applied to a few unis, got in them and quit my shit job. Then the corona pandemic hit and I couldn't get my Visa so had to defer. Now I decided to pick up another job (shittier than the one before) and try my hand at CAT (an entrance test you have to take for getting an MBA program in India, 2,50,000 candidates appear for some 4k seats for the best unis) .Now here's where my issues begin, my personal life is in shatters ever since college, I just can't seem to focus at all in studies, I was initially doing well but now I have hit a new low, my leg keeps tapping constantly, I can't focus for 10 mins straight, can't read long Reading Comprehension passages even though English is my stronger suit as compared to other subjects, I lose interest like anything, I literally stare at the timer during mock tests and phase out and can't solve elementary questions which a high school kid can do, all this comes along with crippling anxiety and esteem issues.I'm scared of taking medication, please please help/advise anyone if possible My life is hell and I just can't function like this anymore. I've managed to force my way through by sheer brute Force earlier but now it just doesn't work that way. I've only recently told my parents and haven't told anyone in my friends who think I'm just a crybaby who even though studies and performs decently keeps cribbing for no reason.Kindly help."
    },
    {
        "name": "t3_irznxa",
        "created": 1600037782.0,
        "ups": 27,
        "downs": 0,
        "title": "It can happen to anyone, doesn't matter how smart you are.",
        "selftext": "TL;DR: Did great in school, did absolutely bad in college, doing bad in job, finally diagnosed and would soon start the medications.* I had the best academic performance in final year of my high school in the history of my school (12th Standard, I live in India). 96.6% was my score. * Then I took an year off to study my ass off and got one of the best colleges in the whole country, not to mention I had multiple breakdowns in the period and only with the help of my mom's support I was able to keep it together and finally make it. * But then, in college, I couldn't do it, my gpa took a downward curve and I just couldn't understand what the hell happened. Anyways, I dragged myself through 4 years of college barely managing to keep my shit together, constantly struggling with even the easiest of subjects. I felt I am stupid. I just couldn't understand it. I suspected it's ADHD but where I come from, awareness is next to nothing.* Four years of college and I didn't do any meaningful internships, I didn't do any meaningful projects, I barely managed to stay sane.* I tried a lot, but I just couldn't focus. I tried running (I run fairly regularly now, keeps my mood somewhat stable), I tried meditation (Vipassana), I tried a lot of other things, thinking it might solve my problem but to no avail.* Because I was in one of the best colleges in my country, I managed to get a great job. But, not soon after starting the job, I again started having severe anxiety, mental breakdowns and the offcourse my constant inability to concentrate despite how hard I try (6 years untreated since high school). * I soon started seeing a Psychiatrist and I have been trying to figure my shit out for last 9 months. And finally got diagnosed!* Right now I am on a month long leave at my job for depresssion, anxiety and lack of focus and yes I am contemplating quitting my job. * And in a week from now I will finally start ADHD medications and I am optimistic, I am hopeful that things will work out this time and If they do, I would be able to save my job. And that makes me happy. * This subreddit has been a great pillar of support guys, It really has been. Thanks to all the amazing peeps out there. Your struggles have made me relate like no where else. * I know It's just a diagnosis, but trust me it's a big deal for me. To quote Jessica here, after almost 6 years of \"failing at normal,\" this might be it. I know the struggle doen't end here. But It's a great step forward :)."
    },
    {
        "name": "t3_izjc7f",
        "created": 1601069022.0,
        "ups": 5,
        "downs": 0,
        "title": "Starting on meds to focus on medical school",
        "selftext": "So I just got diagnosed with ADHD 3 months ago . I'm from India and I'm a medstudent. I have no idea how I got into Medschool or how I passed untill now I think it's mostly luck. But today I just took methamphetamine 20 mg. U kow the clarity when I had in studying was awesome. I used to be bored even with the subjects I love but now I was able to study them. I used to study stuff by deeply analysisig them and understanding them so it used to help me with remembering as well. But this used  to take a lot of time. Now it all happens in seconds my brains in hyperclarity mode I was always good at understanding stuff but now it's amazing. Now I feel sad thinking about what I could do with my brian if it were normal and I'm scared about the fact that these drugs are abusive. I don't wanna be dependent on them. I don't wanna be an addict. So anyone who has been using meds for a long time please tell me . Can we get addicted to methamphetamine when we are using it as an adhd medication and do people in India suffering with adhd take methamphetamine"
    },
    {
        "name": "t3_f4b754",
        "created": 1581810839.0,
        "ups": 5,
        "downs": 0,
        "title": "ADHD is not considered a disorder in India.",
        "selftext": "So few years back my sister came to know about her disorder through her teacher at the age of 22. She came home on vacation and told mom about it as if she's discovered a family's greatest disorder... It so happened the disorder was from my father's side and has passed on to me and my sister.We also came to know ADHd is not considered a disorder in India.We were advised alternatives like social therapy and meditation. These therapies have helped a lot but haven't solved our main symptoms of adhd. We finally came to know that medication is necessary in like 70 percent of the cases. How more disappointing can it get?"
    },
    {
        "name": "t3_jchccz",
        "created": 1602908000.0,
        "ups": 2,
        "downs": 0,
        "title": "\"Thanks a lot.\"",
        "selftext": "I work with some people in India (I'm US) and I just emailed this guy telling him that I ordered something for him. He responded with \"Thanks a lot Katie.\" And I hear this in my head in this sarcastic tone of voice meaning gee thanks for screwing that up - again. I know he doesn't mean that, there is no context or reason to believe that. It's just one of those phrases I heard over and over again growing up that triggers shame and guilt."
    },
    {
        "name": "t3_ihf0it",
        "created": 1598533562.0,
        "ups": 5,
        "downs": 0,
        "title": "I got diagnosed two days ago",
        "selftext": "I am a 25 year old guy from India always had trouble focusing and doing tasks and was decent in studies till highschool , but ever since High school my grades drastically went down as smartphones and internet became more prevalent. After I took my first pill I was able to complete task which was lagging for three weeks and then I cried because it felt like I was living a new life. Everything is good except I will have to adjust dosage with my doctor because it feels too high at 18mg right now. Also not be cynic but this feels to good to be true, what are the cons if anyone could help me?"
    },
    {
        "name": "t3_iwbrxc",
        "created": 1600627839.0,
        "ups": 10,
        "downs": 0,
        "title": "I am done fighting with adhd",
        "selftext": "I am not able to get the stimulant medication for adhd. previously I was getting it because I work at a metro city in india(Bangalore).because of lock down I moved back to my native village in kerala india where its very  hard to get those medication.i tried using non stimulants but nothing is working."
    },
    {
        "name": "t3_f0dy02",
        "created": 1581126222.0,
        "ups": 2,
        "downs": 0,
        "title": "The Brooding in the Shadows? | Will this never end? | Unsolicited Mood Changes | The Peace of Death | India",
        "selftext": "Edit: TL;DR - A lot of things happening at once. They overwhelmed me. So, I just let it out. The post contains my struggle with managing ADHD with other earthly pressures like stress from job, the loneliness of white-knuckling though stuff day after day etc. If someone can relate with this, please reach out.Hello. I was diagnosed with ADHD around 1st September 2019. I started medication on 17th September 2019. I remember the date because I had been trying for so long to know what was wrong with me. It has been a troublesome journey, and it has weighed down on me for long ago. I'm going to try and share it in the hope that I will feel better today.I'm 27 right now. Life from 16 years of age till 17th September 2019 feels like a complicated mess of confusion, frustration, and tears. I didn't achieve anything substantial. It was a period of repeated failures, broken promises after promises, and indulging in the highs and lows of my fluctuating and unstable inner life. Life is okay right now, but I am still struggling.I was coming back from a friend's place today. On my way, tears started rolling down my eyes. Even as I write this, I'm trying not to shed any more tears. As I was saying good-bye to my friend, I realized and the feeling sunk in that, no matter how much I try, the loneliness and detachment I live with every single day, will never end. The pain will never end, as well. I don't know why, and no matter what I try, I find myself alone, and there's this another feeling that is always lurking around the corner, which makes me crazy. I cannot accurately describe this feeling. Sometimes it feels like loneliness; sometimes, it feels that I'm just too overwhelmed. At other times this same feeling takes the form of anxiousness. A lot of the times, I'm utterly detached. There are also moments when I'm entirely in the moment and sharing a laugh with others. But when the laughter subsides, and I need to go back home, this feeling comes creeping back and starts morphing into one form or the other.This same feeling led to the crying. Because deep down, I will always feel like a sinking ship, I will still have to come to grips with the dysphoria that perpetually haunts me. I think I am going to be pretty lonely at the end when I die. I've been trying to collect some memories that I might savor, but it has been hard to do so. Half the time, I'm inadvertently trying to rush through things, and another half of life seems to be spent on acquiring the means for basic needs - my job.I recently met someone from Reddit. We have been talking for a few days. All the while I was writing the last paragraph, I was incessantly crying because I fear that I will do something to fuck it up, or she will eventually find someone who's a better fit. Of course, I could be wrong, and I might make it work, but I have never experienced stable relationships in my life. Even the relationships with my parents keep fluctuating from meagerly unstable to utterly unstable. My belief that this too shall pass and she will one day go away makes me sad. I know that this might altogether be an irrational fear. I think I feel this way because that's what has repeatedly happened with me, time and again.Also, this girl I am talking to and the friend I mentioned earlier are the most helpful and coolest human beings I've ever met. I'm lucky to have met them. I will try to make it work as long as I can. I think I will be able to have some memories that will help me survive when nothing else remains. I don't know where this belief that I'll ultimately lose it all is coming from, but its force is so strong that I can't help but believe it more and more. Despite everything, I'll try to make things work. Either I will lose, or I will make.I'll never have it all, and with what I have, it keeps hurting me for more.I visit my psychiatrist regularly. But I never explain these things to her because I keep hoping that one day I will learn to manage it well. Today, I broke down. I think I've finally accepted that I'll have to live a life that has more bad parts than the good ones, more darkness than there will be light.I hope there's a better tomorrow. Or, it might be the case that I've developed other emotional disorders due to years of suppression. I will keep visiting my psychiatrist and hope for better things to come.Despite how I feel, and how meaningless life seems, I will go to work and try to make it for yet another day. A few days later, I will be on my knees again. And I'll repeat the process. Again and again. It feels like a curse. I'll try to accept it."
    },
    {
        "name": "t3_hohckq",
        "created": 1594379284.0,
        "ups": 17,
        "downs": 0,
        "title": "I got bored and did a ton of math regarding overpopulation and covid 19",
        "selftext": "Starting off with covid 19. Worldwide roughly 556k people have died, (exactly 556,174). 31,646 people dying has the same effect of oxygen as 20 million trees. 20 million trees produces 260 million tons of oxygen. Going off of all of that, roughly 4,569,240,000 (4.6b) tons of oxygen was saved solely from covid-19 deaths. And then i started talking to my friend and we started talking about overpopulation. India has 1,326,093,247 (1.3b) people, and has the square mileage of 1.269m. That’s roughly 26,678 square miles per person. The united states has 332,639,102 people. It has the square mileage of 3.797 million. That’s roughly 318,247 square miles per person. That’s a 91.7% increase from india. This literally all stemmed from an instagram post talking about trees"
    },
    {
        "name": "t3_ioaq08",
        "created": 1599525100.0,
        "ups": 3,
        "downs": 0,
        "title": "Hi everyone, I (16M) am going through a really difficult time right now. (Please read)",
        "selftext": "Title. (Sorry for the long read)I'm 16M, been diagnosed with ADHD since I was maybe 8. With the coronavirus pandemic, we've switched to online classes, and it's literally impossible to pay any attention in class. In a matter of seconds I lose my focus and I find myself playing a game, or browsing Reddit. I just can't study or pay attention online. All I do is quickly switch the tabs when my parents enter the room. And even when I had tests I couldn't study, I just ended up looking up answers online during the test. I'm scared that this will be bad for me in the long run as I'll start applying to college soon, and in India where I'm from the tests I'll take next March (full syllabus) are really hard, and really important. I need some advice or tips on how I can retain my focus. If I can bring it up from mere seconds to around 25 minutes I know it'll be enough for me, but nothing I tried has worked (ADHD isn't seen as a disability in India so no doctors prescribed me anything). I'm sorry for the long read, but I'm truly desperate, and not even my parents will support me. Anything is welcome, thank you in advance."
    },
    {
        "name": "t3_iuz77y",
        "created": 1600431180.0,
        "ups": 2,
        "downs": 0,
        "title": "Need advice on how to get proper help",
        "selftext": "A doctor one told me I have ADHD and ADD or at least just ADD. Then I moved back to India. I have struggled all my life and taken a lot of shot from my family for being below average. What is the testing process and is there a way to fast track it given that I have midterms I am already struggling for and take 6 hours for a 1 hour job anyway."
    },
    {
        "name": "t3_gtbxvu",
        "created": 1590862162.0,
        "ups": 67,
        "downs": 0,
        "title": "Family thinks ADHD is a phase that can be corrected by patience",
        "selftext": "Got diagnosed while doing my masters at 24. The course I was doing was much more theoretical than my undergrad and I couldn't cope well. Went to a counselor and after that came the diagnosis which I somewhat always knew. My family although supported me through the process but have always been sceptical about ADHD and say that it's something I can overcome with putting my \"mind into it\" and being \"more focused\". I had to live at my parents place during the lockdown as the place I was living in got shut down (campus accommodation) and couldn't get my prescription because of lockdown reasons. (India) I have been going through mental hell. Graduated and now looking for research jobs but can't even focus for 15 minutes in this situation. Any advice?"
    },
    {
        "name": "t3_itlnk6",
        "created": 1600246970.0,
        "ups": 1,
        "downs": 0,
        "title": "Severely struggling with university - seeking advice, tips, suggestions, anything at this point.",
        "selftext": "I've never been an invested student, even in highschool I did well enough because somehow I managed to soak in enough while paying no attention to pass. I've been out of school for 6 years with 2 failed attempts at uni within that time. 1 I dropped out of before semester started, another mid way through my first semester 2 years later. I hit a dead end in my job, didn't want to move up further because the company and culture is horrible, and felt lost and stuck so went to give it another crack - what else was I going to do? I deferred first semester as I had to travel to India for a close friends wedding, I dont regret that as it was the trip of a lifetime, but upon returning and getting into second semester, I found that even 2 units with a lecture each a week, online, was too much for me to keep up with, it stressed me to no end thinking about it, and I deferred that semester too.The next year, I hit the same struggle, fell 6 weeks behind and somehow found the motivation in 2 days to grind and catch up, do the first round of assignments and did quite well - but I didnt feel proud or accomplished, I just dreaded the next round, the next lectures, because of the stress they produce.Again I fell behind, managed to finish after a spark of motivation for a couple days, and finished my first semester ever - but I felt only mild relief, I didnt feel accomplished or perceive any tangible results from all the work and stress. Now I'm in a similar situation, weeks behind, stressed and almost paralysed by anxiety, depressed, and I dont know if I can keep going. I can do it, I know that, but It honestly doesn't feel worth it. My parents and girlfriend are adamant that I should finish my degree, but 4 more years of this seems like more than I can mentally cope with, and whatever the end result is, it doesnt seem worth the crushing weight that I feel. I really dont know what to do. Its worth mentioning that co founded a company recently, and as much as I love working at it, the stress of uni (I think its uni) has gotten me to a place of inability to act or work on anything at all. I spend my days in bed staring at my roof or gaming and I can't bring myself to act on everything. In my gut I feel I should apply myself fully to my company and get it up and running, but my head is all messed up, and I worry that ill fail at that too, that I'd be making the wrong choice.Has anyone been in a similar place? Felt the same about something? What did you do, how did you cope, was it worth it in the end or do you wish you found another pathway, committed yourself to another opportunity instead of staying the course?Thank you in advance for any help, sorry for the rant."
    },
    {
        "name": "t3_i5jqbe",
        "created": 1596855424.0,
        "ups": 3,
        "downs": 0,
        "title": "I don't know what to do",
        "selftext": "I live in India, i was diagnosed with ADD when i was in 6th grade but obviously didn't get prescribed because my parents thought it was all in my head and if i wanted i could just put my head to it and focus, i made it to really prestigious college but failed the first year, my friends used to sit me down to study but i never could focus for more than 5 minutes and moved on to other things even before tests, i don't want to leave this college and i have one more shot as we are allowed to repeat a year once throughout the course, i know to my gut i'm a smart guy and if i had meds i would be able to do much better in life but most doctors i go to just tell me to do exercises and to otherwise deal with it. i don't have money to go to more doctors without my parents knowing and i know for a fact that they wont agree to take me. What should i do?"
    },
    {
        "name": "t3_ilfw8u",
        "created": 1599110454.0,
        "ups": 2,
        "downs": 0,
        "title": "Might have ADHD, need psychiatrist. What are the criteria I need to be looking for?",
        "selftext": "I'm pretty sure I have ADHD; My concentration span strongly points in that direction; I flip through a million things while not really paying attention to them; I'm hyper-aware of my emotions and hyper-conscious about how I'm being perceived, and no I'm not a teenager. I'm 22, woman, and have been good at studies, and am looking at a career in academia. Have known that I need therapy for quite a while, but as I am starting graduate studies, it is time I take real steps to manage my head. I live in Mumbai, one of India's largest metropolises, and I have a list of psychiatrists and counsellors, and I have no clue as to how I should go about shortlisting them, or which criterias to look atI'm having a lot of trouble starting, and will welcome any help in this regard, about how to take that first step towards therapy. Many thanks! P.S: posting from my mobile phone, excuse the editing"
    },
    {
        "name": "t3_hzbgfw",
        "created": 1595956652.0,
        "ups": 8,
        "downs": 0,
        "title": "Need help",
        "selftext": "Need helpHi im from India and diagnosed with ADHD, and im only 20yr old.the thing is that in my society having adhd is like having some sorta big disease. The thing is iam good at understanding and learning a part of a code and i just only know a little about almost all the programming languages.I cant concentrate on a specific language.if i try to learn a specific one and if it has a reference then i will go after that thing and i so on.so that i cant learn a specific language and get good at that.i completed all the courses on the freecode camp, still i think im not good at anything.i cant write a full script by myself.As a typical indian family my mom and dad hates me sitting in front of pc all-day long. When I'm at 19, i tried hackerone and bugcrowd and got some bounties amd swags .then i zoned out from that too.i dont know what to do.if i tell my parents that i need to consult a psychiatrist to seek out help,they are shamed of the society.And im 2nd year college student and i only passed 3 out of 18 subjects and have no friends at allI know this post is weird but it took me almost 2hrs to finish this thing"
    },
    {
        "name": "t3_ho2xre",
        "created": 1594329584.0,
        "ups": 8,
        "downs": 0,
        "title": "I asked for an extension with some lame excuse while in reality I couldn't bring myself to work even in the last moment.",
        "selftext": "This is regarding my master's thesis. I've asked for an extension. I couldn't bring myself to tell them about my adhd. Even if I did tell them, maybe they wouldn't take it seriously enough here in India as mental health is not considered a serious enough reason. I feel bad about lying. And that's making me question my worth and capabilities. I don't know how to accept myself completely. And I'm also scared I may not finish the thesis even with an extension."
    },
    {
        "name": "t3_i6f62j",
        "created": 1596985616.0,
        "ups": 2,
        "downs": 0,
        "title": "Guy with ADHD (need help)",
        "selftext": "One of my dear friends who is getting mental help for something else actually told me I could have ADHD. I am from India where it's highly stigmatized to even go to a mental health professional forget actually being diagnosed with a condition. I started reading this sub reddit and I found so many stories that resonated with me that I giggled and cried so many times looking at all the people who behave somewhat like me. I am not asking for a diagnosis from you people, I just need to know how did being diagnosed with ADHD help you in your life.I am a person who finds it extremely hard to organize things and people just used to call me lazy but I just couldn't remember that I need to put everything back in its place before I made a mess out of my room. I have poor time management skills, I sometimes spend hours on a few things that I never planned on doing and spend not even 5 mins on doing things I actually know I need to finish off as a priority. I have always been quick to lose temper when people used to remind me about my forgetfulness, thinking it's not my fault and everyone is forgetful at some point so why am I being hounded for it. I also have a problem with impulsivity, I take so many impulsive decisions that I regretted over the course of many days, months and even years in some cases. I constantly fidget subconsciously when I doing an activity I find boring, and there are too many activities I find extremely boring. I switch between songs on Spotify every 3 seconds because I cannot make up my mind on a particular song. I am so obsessed about a few things I get into a whole different zone when I am doing those things, like playing guitar or reading about history or playing online games like Counter Strike. I like listening to the same songs for years, I like watching the same movies for years and I love doing that and I had no idea why I was so unusual in this regard. I remembered all the lines from some movies by heart, I could actually narrate you the whole movie. I am surprisingly good enough in academics, my family think of me as some kind of an eccentric smart guy. But I have always had trouble maintaining relationships with people. There are some people I love to death and some who I don't want to talk to at all. Moderation is a word I never understood in my life. There are so many things I want to share about this, but it's never going to end. Just some things I wanted to get off my chest.How do you guys cope with this? Like I said I haven't been diagnosed yet, getting diagnosed would be a huge step and I doubt how supportive my family would be of that."
    },
    {
        "name": "t3_i6wqce",
        "created": 1597056435.0,
        "ups": 1,
        "downs": 0,
        "title": "Co-worker would like some resources for her ADHD nephew, bonus points for Indian sources or information.",
        "selftext": "Hey there,I'm pretty open about my ADHD with workmates but I'm in my twenties and I wasn't diagnosed until I had left school. A co-worker has asked me for some resources to send to her brother as her nephew, he's 11, has been diagnosed with ADHD. Her brother and nephew live in India, any resources specific to there could be helpful."
    },
    {
        "name": "t3_i6gfw5",
        "created": 1596993227.0,
        "ups": 1,
        "downs": 0,
        "title": "Need help dealing with academics (any help/advice would be really appreciated)",
        "selftext": "Hey, So I'm currently 20 and studying law at Uni. I was diagnosed with ADHD back when I was 17, I tried some meds for a bit but had to leave taking them because of the excessive weight loss (I'm an athlete so it was a bummer for me). I never really re started my meds because idk, I just never thought about it besides I live in India and as much as my parents have been supportive and understanding, mental health issues continue to be  bit of a stigma around and the resources aren't too good. Throughout my school life, I was always told that I was quite smart, I had a good grasp when it came to learning stuff but that kinda stuff never really translated to good grades. I always got average grades. If I'm being honest I don't even know how I managed to graduate my high school, I barely touched my books and somehow ended up doing fairly well. Currently I'm in a good uni in England on a scholarship studying International law, I am almost done with my first year and yet again, feel that I haven't achieved anything academically this year. I am really interested in the field but somehow can't get myself to study. I was hoping if there is anyone else who can relate to my situation and have some advice for me. Anything would help, honestly.Side note : it's been three days since I have been back on my meds, (methylphenidate) I was also hoping if someone had any suggestions for making the most of the meds and how to go about managing increased heart rate."
    },
    {
        "name": "t3_cg2ovq",
        "created": 1563764706.0,
        "ups": 4,
        "downs": 0,
        "title": "Anyone from india? I. NEED. HELP!",
        "selftext": "HiI think i have adhd. And i am seriously considering therapy.I am happy as a being. I am content in myself and my work is well appreciated.I was in heavy depression for sometime. It took everything to overcome it but i can safely say i am not depressed anymore.Or at least i am depressed about right things now.I like the way i function. If i am into something nothing else matters till i am either bored with it or i am super saturated with it and get exhausted.I am happy in general but daily life is slow af. Its mundane and that makes me depressed.I paint. I write *wrote about 10 pages for a book idea* lot of prose writing. I love to write.I read a lot about anything and everything that catches my interest. I travel a lot, like a wolf. I feel invincible when i am travelling.I flick random things from random places *usually from institutions. NOT FROM INDIVIDUALS.I like designing its my field of work, i love the hours i put in, the whole process and the final product makes me feel happy. its like a zap.I can't get myself to stick to one thing.I'll want to paint one day and the other day il go to the other side of the town to see the sunset. I will write for 2 days and then not pick it up from a month or more.I have so many things in my head that i can't decide on what to do hence the productive work done is less to none.For most things i won't decide untill the last minute and then il just ace it with ease.I work amazing with deadlines and chaos. When i have to do everything in a month or so.Indecision is a huge problem.Sorry for this being so long. I really need help i might drop out of college for the third time.I am sincerely considering therapy if it will help.I am going to pay for myself, and therapy is really expensive here.Any advice is appreciated"
    },
    {
        "name": "t3_g28x6n",
        "created": 1587044025.0,
        "ups": 8,
        "downs": 0,
        "title": "Useful heads up for prospective college students— just bc it’s a good school doesn’t mean the faculty are good at teaching",
        "selftext": ""
    },
    {
        "name": "t3_hhbos1",
        "created": 1593366137.0,
        "ups": 1,
        "downs": 0,
        "title": "I have this cloud around my head, which sort of feels like a barrier to everything good that can happen to me.",
        "selftext": "!! Very long post (atleast for me. Myself, I'm not someone who'd read such a long post on reddit. ***Lol***!)- not recommended if you're not *brave* enough to be *patient* and go through.Sometimes (most of the time) you know .. I have this ***cloud*** over my head. or some kind of a ***block***. which feels like a ***barrier*** to all my happiness, ***barrier*** to do things i want to do, ***barrier*** to feel and talk to people, ***barrier*** to feel real. it is some sort of an  ***exhaustion*** *,* ***headache.***I have a ***secret***  med for fixing this. This was something precious I picked up along the  way in my sophomore year at college. Friends and people around me  thought that I'm a *fitness freak*.  But, only I myself know that whatever workout I'm doing is to get rid  of this cloud over my head. And, this was the only way I found to *cope* with. Some *moderate* exercise (it's important to take only moderate stress) has always helped me to sit, relax, *confront* my problems. Yes ! *Headspace*. ( of course this writing also came out as a result of such a mindfulness session !!)I remember, I've been a ***melancholic*** always since I was a kid (did I make it sound like alcoholic!?). I have always wondered - still wonder now in my early *twenties* \\- how people are managing to get this *socialization game* right so naturally.It  was precisely only 3 years back I discovered this antidote to my  problems. Before that - this guy - me - used to always find something  exciting to brain to do in such situations. Some new ambitious coding  project often. This guy's life is a *shipwreck* of ***unfinished projects***  and ideas which were abandoned at early stages. This guy would watch  something exciting, try to learn syntax of some trending programming  language, or figure out exciting tech tools, open source software out  there. This guy definitely had a vast and diverse knowledge about 'tech'  stuff everything at the surface which his peers rarely had, but nothing  beyond that, no real expertise. Of course you'll never be really good  at anything if you lose interest and abandon it at early stages.This  guy had good grades in school, managed to get admission in some top  rated college - but never excelled there much - managed to be just  average. Given this condition of his, I think he took the dumbest  decision of taking a major which he've never dreamt of doing in life.  While there was something else - about computers he'd have loved to do.  Well, this is *India* man. We  don't mind taking such decisions for getting admission in a reputed  college. Anyways, along the way he've managed to find some good *people* there, went for many *treks* \\- this guy gets orgasm seeing *hills* and *forests*, *cycled*  lot -long distances too, also, happened to learn some 'tech' he  actually liked. Good that the academic program was flexible where where  he could learn some courses that in the domain he wanted to. And this  guy also managed to get some work done in the final project. Got hired  in a reputed company too. That's not all, he've gone through lots and  lots of ***depression*** during this time.He actually felt like an *extrovert* to most people, maybe because of his *dynamic* nature, but people who looker closer must have seen how deep an *introvert* he is.Yeah,  finally, now - He is at a dead end. This guy have consciously taken the  to decision not to hop on to new projects everytime, he quit social  media long back, he's on his toes, facing his life problem, trying to  workout &amp; get mindfullness every time he's having this cloud. But,  this is really difficult man!He need ***answers***  to why exactly this is happening to him. Fixing it with so much effort  everytime is so tiring.! If sometime ever he gets bit lazy to fix - then  there is depression *waiting at the corner.*  ( But, no *suicidal* thoughts so far. ! Still in the hope that things will get better.)SO, I would like to know, hoping to get lucky here, ***if you are someone who've made it so far***   (literally! ). Please let me know if are going through something  similar, or you know someone else who is going through something  similar, or if you've gone through this and have managed to get a ***fix***.  I'd be really thankful to know! I want *fixes*.Thanks a lot for listening !"
    },
    {
        "name": "t3_gdqcvy",
        "created": 1588678315.0,
        "ups": 4,
        "downs": 0,
        "title": "ADHD/bipolar type 2 comorbidity",
        "selftext": "Hi,I was diagnosed with adhd back in 2016. Recently, I have been diagnosed with bipolar disorder type 2. I am sure there are a lot of people like that around the world. I come from India where mental health awareness is.... disappointing. I am very confused about my conditions (this might be because I have been put on oxcarbazepine which, I have read here and some other places, causes confusion). If there are people here with adhd/bipolar disorder comorbidity, I would appreciate if they could share there experiences and how they handle both the conditions, as often the symptoms overlap as well as interfere with each other. Mostly I would like to know about individual experiences. This would help me gain some perspective about my own experiences."
    },
    {
        "name": "t3_gzqeci",
        "created": 1591748619.0,
        "ups": 2,
        "downs": 0,
        "title": "Confused, vent",
        "selftext": "Hi everyone, I just stumbled across this community while searching for some answers. This is probably more of a vent in what feels like a safe space. Most of my life I've struggled with what I think is primarily anxiety, but I've always found ways to live with it and take care of myself. I'm a 2nd year in my undergrad and I love what I'm studying, but it's just been a lot harder for me to keep my grades up. Initially, I just thought it must be a case of transitioning from highschool --&gt; uni but the more I've thought about it I think it may be more. I think my self-esteem is largely built on grades- which I know is unhealthy, but I think it's because this has been the only part of my life I have ever been able to control. I grew up in an abusive and  controlling family, and in combination with many other issues- I never got help on my situation or my mental health. My way out was my grades- something that is valued in my family and probably due to culture (I'm originally from India), because it was the only reason I would ever be allowed to leave home so I could seek higher education in another country. In a way, grades are still the only way out for me- unless I have a good GPA I will have to go back (because I'm an international student) and I don't want that. I've never been the one to ask for help from anyone, I don't mean to come off as rude I just mean that I don't even know where to begin with getting help and I don't want to do anything that will just backfire. Because of my situation, I did as much research as I could since as early as I knew how to and obviously I'm not a doctor and I'm not trying to say that I am but I learned a lot from the internet and people on the internet. Again, I don't want to say that I'm diagnosing myself but I learned about different disorders and I never thought I fully fit with any of the disorders I learned. I always found myself relating to only *some* parts, or only in *certain* situations which I don't think means much. When I was younger, ADHD never really occurred to me as a possibility because my perception has always been unfortunately, a negative one. I  thought it meant I needed to have bad grades and I needed to be physically hyper and loud but because of quarantine and the fact that I'm stuck inside  and I literally CANNOT stay inside. I intentionally schedule all my classes in a way that disallows me from going home in between and only makes me sit still for a max of 2-3 hours. Now, with online school it has just become so incredibly hard to do anything and I feel so incompetent because I have always been able to access a library/ a coffee shop and I always force myself to go to class, even if I don't retain anything- I need the schedule, I work in mundane jobs primarily for a schedule and on the weekends I couldn't get anything done like I wouldn't start working till like 7pm? Again, all of this could be due to procrastination but since my brother (who left home) told me he's been diagnosed with c-PTSD and generalized anxiety, and it made me look into myself a bit more. I do not think I have either of these- perhaps anxiety, but not PTSD. Anyway, (sorry this is so long) as I was reading into ADHD I didn't realize the extent of the disorder. I found myself relating to pretty much everything- most of the posts I read from other adults diagnosed with it on reddit, tumblr, twitter. I read up, I watched, and I obviously can't say officially that I have it but I guess I just wanted to ask about what to do now. I have never been to a therapist/ psychiatrist or even a family doctor and honestly, I am hesitant to. I know a lot of people have said it takes months and multiple visits but I don't have the money for that. Fortunately, my university offers some resources like counsellors and accessibility but sadly it can take at the *minimum* of 5 months to see a psychiatrist- which I don't even know is sufficient. Is more than one opinion better? Again, I'm not saying I definitely have ADHD but I'm hesitant to seek out multiple doctors go through years of misdiagnosis and wrong treatment because it won't help me. I'm sure people will also be hesitant to tell me anything except- go see a doctor. I understand this, but I do not have the money to access that extent of medical treatment and I don't want to ask my parents because I know they won't help me. The only reason I began to think about getting professional help is because of how much it has begun to affect me. The anxiety is one part of it, but the feeling of being bored is the worst. Since leaving home and having the freedom of being alone, it has left me able to do pretty much whatever I want- including a lot of drugs. I am not an addict, I honestly don't even think I enjoy drinking or drugs. It's just because I feel like bored almost? It's not that I'm sad or anything, I just need to do something to get rid of this feeling and until I do something crazy and impulsive it doesn't go away. Honestly, sometimes this feeling can last days and I just keep trying to focus but end up doing stupid self-destructive things. Again, not sure whether this is 100% ADHD so please let me know if I'm on the completely wrong track this could just be a symptom of something else or a coping mechanism I have no idea. But doing stupid shit for unknown reasons and not being able to focus and get anything done is really awful and just punctures my self-esteem. It also affects me socially a lot because I feel like I do stupid shit when I'm supposed to study and the closer to the deadline I just make myself sit in the library or whatever to do work but all my friends do their shit on time and go out and take organized breaks and it's not even like I do more work I just take so much longer to do the same things. This quarantine is horrible, and my school will likely be online for the next term so I just wanted to ask for help. I can't focus at home, I don't have my schedule and getting high and smoking doesn't even do anything for me it's just something to do but I don't care for it. I feel incompetent and useless, I don't have the money to get adderall from my dealer but I also don't want to take it because I know it can heighten anxiety if misused. I just feel very lost, and for the past 2 years- it's been the first time in my life I feel like I don't have control over my school. I hate feeling out of control and pretty much stupid, I don't even know how I got in to this school. I just can't bring myself to focus or do anything I keep getting distracted and online school is so hard!!! Yesterday I wanted to go for office hours and I literally opened up the page at 2:59 pm and went  to get a snack and then i just went on my phone and watched tv and after 3 hours I realized I had office hours at 3pm. It's just stupid shit like this that makes it so difficult for me. I'm also alone here, all my friends went back home because of COVID, but I purposely took summer school and am working at this store (where I honestly barely work- I get like one shift a week but I needed an excuse to stay here instead of go home) so I don't know what to do. If anyone has any advice, please help me."
    },
    {
        "name": "t3_fu4gya",
        "created": 1585930557.0,
        "ups": 5,
        "downs": 0,
        "title": "One of my friends suggested me this sub-reddit!",
        "selftext": "Does everyone here wake up from any nap or sleep thinking why the hell did i wake up? Why do i have to wake up? Why can’t i just go to sleep and never wake up? No, I’m not depressed or a procrastinator but lately, it has been hard to find motivation in anything except soccer for me. But the thing is all my life i have forced into doing things or learning things i didnt want but had to do it just cause people around me dont turn ugly towards to me. I was a top-grade student in school but i never wanted to study. I would score good grades because i failed a class one-time in kindergarten and my parents started  sending me to tuitions since then. Only reason i scored good grades or found motivation to score good was that i get play soccer or they would buy me video games. They said given the right motivation you can do whatever you want and told me pursue Computer Engineering.Everyday during my school life I would always try to escape onto the fields and play. It got to point that my dad told me to that he would burn my shoes if i dont stop. Stopped playing for sometime but got selected for my University back in India, and it affected my grades and now i have to play without letting them know any of it.Other than soccer there is no other motivation. I mean i would literally be staring at screens and re-thinking my life and things. Some nights i just lay in bed waiting for sleep and after a while i hear birds chirping because sun is up. sometimes i start watching something and then after a while im like why was i watching this. Sometimes i feel like i need to eat this or let me buy this and enough this meal but after buying turns out i aint feeling hungry no more. Please help I completely don’t understand myself lately and am looking for some help! Also had a gf for a year when i was 21 but i loved her since 3rd grade. Came to US when i was 22 for studies; asked her to join to which she replied it is not worthwhile for her to do that. I have been feeling empty and lonely since then including the sense of having to not understand myself ever since high school. I always feel like I’m a sore loser and I can’t and will not get anything done in my life! I just want to play soccer 😐."
    },
    {
        "name": "t3_ecgihg",
        "created": 1576722737.0,
        "ups": 37,
        "downs": 0,
        "title": "ADHD symptoms from the outside vs the inside",
        "selftext": "I’ve been thinking about why it took me so long to figure out that I had ADHD (way too long). I had this lightbulb moment today - the symptoms I always read about are usually described from the outsider’s point of view: “easily distracted”, “zoning out”, “fidgety”. If you asked me if I noticed these things about myself, I’d say no. Because I am always 100% locked in. Sometimes I’m concentrating on a problem inside my head. Sometimes I'm concentrating on reading the Wikipedia article about the official languages of India, or organizing the tupperware, or fixing the tupperware drawer because actually it broke recently and I’m tired of it falling on the floor every time I open it. Yes I have a final exam tonight, why do you ask? To my mind, I’m never “distracted”, there’s just a million things I want to do that all seem really important.To my mind, I’m never “zoning out”. Though I suppose it looks that way to people around me.To my mind... ok, yes, I fidget a lot, now that I think about it, but is that really a problem? I hear it burns calories. Is it just me, or is there a disconnect here that is preventing people from getting the help they need? How can we change that?"
    },
    {
        "name": "t3_8w2ui8",
        "created": 1530749862.0,
        "ups": 7,
        "downs": 0,
        "title": "How bad is the stigma around adhd in india ?",
        "selftext": "I am 28 yrs old Indian born, currently staying abroad. Last year I got diagnosized with ADHD and started my medication. Initially it was hard, struggled with medication, anxiety. Now I have  got the right dosage, I am doing great at work and overall quality of life has improved. This I have not shared this with anyone so far,  including my parents and my sister. And my parents have started looking for bride for me, arranged marriage. Even I find it's the right time to get married. But I don't know how to tell this to my parents and to the girl , if I am meeting someone. And I have no idea how badly girls take this and how bad is the stigma about adhd in India. If anyone been through this , please share and help me. "
    },
    {
        "name": "t3_axog51",
        "created": 1551839451.0,
        "ups": 1,
        "downs": 0,
        "title": "USA -&gt; India",
        "selftext": "I'm an American who will be working in India for 3 months. Has anyone dealt with getting stimulant medication in India? Tips or suggestions?&amp;#x200B;I'll need my medication due to the nature of my work...All advice is appreciated :)"
    },
    {
        "name": "t3_c5cypy",
        "created": 1561516355.0,
        "ups": 131,
        "downs": 0,
        "title": "The hardest part right now: forgiving myself for blaming and shaming myself all my life. I didn't know. It's no one's fault. It's over. But it still hurts.",
        "selftext": "My 6th grade teacher told my mom I might be \"gifted.\" My parents always told me I was smart.I believed them.I knew I had a brilliant mind. I could feel it. I was destined to accomplish great things.But a smart kid doesn't make *those* kinds of silly mistakes. Over and over again.A smart kid doesn't fall on his face in every social situation ever.But instead of recognizing a problem and asking for help, I used my smarts to cover it up. Hide the ugliness, the awkwardness--maybe it's not real, maybe it's all in my head.I spent thirty years running away from myself. Running from the ugliness, the awkwardness that I could never wash off.Nobody understood. Nobody saw it. Or maybe they did--but didn't do anything about it.I remember failing a community college math entrance exam in high school. Someone told us they make special accommodations for people with disabilities like ADHD. My mom and I shrugged it off, didn't even consider that may be the case.A friend gave me some of her meds to study for a chemistry final. I remember *understanding* it like never before. I aced the exam. Still, never considered maybe I need that all the time.I kept running--not even knowing what I ran from. Into drugs, alcohol, abusive relationships...Then I get sober and start a new life, but...something's still missing. It took another decade, nearly slipping back into the hellhole I came out of, before I consider that maybe, just maybe, this doesn't have to do with trying harder. Or waiting for some miracle from God.I got diagnosed, and within two weeks I understand, for the first time, what has been broken all these years.What my parents and teachers and pastors overlooked.What I couldn't see or explain.Where all those silly mistakes and social awkwardness and self-loathing comes from.Suddenly I *can't* blame myself anymore. It's a genetic condition I inherited. It's no one's fault.So now I'm trying to face myself, and accept myself, and *embrace* myself, not only for the fuckup I was all those years before treatment, but also for the asshole I was for blaming it all on myself.All that bitterness for lost decades I held onto...has no cash value.No one is going to pay me back for what I lost. Because it's nobody's fault. It just was. And now it suddenly just...isn't, anymore.It's okay now. After a lifetime of *it-will-never-be-okay*.I can't accept that -- it's too good to be true. I can't tell you how many times I \"figured out\" what was wrong with me, and \"fixed it.\"Except, this has stayed real for a year and a half now. Everyone around me can see the difference. It's not just in my head. It's over. The battle I fought my whole life, that nearly took my life is just ... over.I wish I could go back and tell that 8-year-old little boy.I wish he knew.I wish he knew, so he wouldn't beat himself up.I wish he knew, so he wouldn't look for help in all the wrong places.I wish he knew, so he wouldn't lose sleep wondering what was broken inside.I wish he knew, so he would know that *somebody* understands.He's not alone.I'm not alone.We're not alone."
    },
    {
        "name": "t3_fceesq",
        "created": 1583194648.0,
        "ups": 9,
        "downs": 0,
        "title": "struggling with untreated adult add (indian)",
        "selftext": "I was misdiagnosed with bpd when i was 20 and none of the meds helped [me.Now](https://me.Now) i am 28 ,jobless,unable to focus on studying for competitive exams,feeling like killing myself,as its very hard to get an adhd diagnosis in this shithole named india.None understands me in my family and i was harassed and mocked at for my inabilities.I am in constant fear of my future."
    },
    {
        "name": "t3_f89squ",
        "created": 1582495332.0,
        "ups": 5,
        "downs": 0,
        "title": "In DESPERATE need for advice: I never get anything done and it is RUINING MY LIFE!",
        "selftext": " Hi there, I'm new to Reddit.A little background information: I was diagnosed with ADD as a 15-year-old in high school. I started taking Ritalin, but it messed me up (lost lots of weight, became underweight, bad social anxiety, depressive episodes).I went to college to start studying engineering but didn't even make it through the first semester. I got kicked out. Started studying Media Design afterwards, but the same thing happened.I now study business and I did make it through the first year. Mainly because it is easier and more interesting, but god, it was hard.I suck at time management, I never get anything done. It is ruining my life. I have so many dreams of starting/leading a business, making a mostly passive income and traveling all over the world, but I feel like I will never get there. I tried everything.Setting smart goals (never stuck to them, lost motivation)Waking up earlier (I just can't get out of bed!!!)Planning (I spend more time planning than actually doing)Taking meds (I took Ritalin for several years and it messed me up. Honestly too scared shitless to take any other psychoactive prescription drug ever again)My parents are Indian. Mental health is underfunded in India and not really acknowledged. My parents weren't raised with the concept of mental health and mental disorders. They see it as an excuse, often call me lazy, dumb, sometimes useless. When I was diagnosed my mother legit thought I was retarded and couldn't do anything on my own or get married. -\\_-Luckily I don't live with them anymore and my mental health is okay, I guess.I'm pretty much independent now. I can do the household, pay rent and cook for myself even though my mother thought I could never do that sh\\*t.I'm doing okay in college, but I always procrastinate and study last minute. I have to resit 50% of all my exams. I feel like I can do so much more than this.Every day I feel tired and sluggish. I'm always tired. I daydream ALL THE TIME and have literally no control. I just can't get myself to study because I just know I'll get distracted anyway. Most of the time I just lay in bed and do nothing.I know what most of you are going to suggest:Exercise/Meditate: I never stick to a habit!Eat healthily: I'm trying!Try other psychoactive prescribed meds: HELL to the NOPEDiscipline yourself: How?I heard caffeine + L-theanine can be great for focus and to calm a racing mind. I ordered some. I hope they will help me focus and not daydream as much.Any advice? What helped you become more disciplined? Do you have ADHD/ADD and how do you manage"
    },
    {
        "name": "t3_f8v7is",
        "created": 1582596146.0,
        "ups": 2,
        "downs": 0,
        "title": "Going through a phase of Self Hate and Frustation",
        "selftext": "In brief, I am feeling really frustrated because my academics results are just being poor.No matter how much I study I can't just get the result..I am feeling extremely under confident and negative Any tips to improve your AcademicsP.S:- I am doing Computer Science Engineering and I am from India 🇮🇳"
    },
    {
        "name": "t3_gbmpj0",
        "created": 1588383873.0,
        "ups": 1,
        "downs": 0,
        "title": "Help - Dealing with being fired and making sure it doesn't happen again?",
        "selftext": "I'm originally from India and relocated to Germany to work for a company as a product owner. 5 and a half months into my job I was let go for performance reasons, fairly sure my ADHD played a role in my poor performance. Due to the Corona pandemic my company couldn't move me to another team so they had to let me go. I got another job and was honest with them about why I was let go, didn't tell them I have ADHD though. They decided to take a chance with me and I signed my contract today. Has anyone ever been in this situation? How did you make sure you don't get fired again? I need help. I have a son and I never want him to look at me like I'm unreliable.I used to take ritalin before and it did help, I became the star employee of my old company and I reached a point where I could function without it. Think it's time I go back to it."
    },
    {
        "name": "t3_5mlo74",
        "created": 1483840044.0,
        "ups": 14,
        "downs": 0,
        "title": "ADHD in London... Forgot my meds in India. What options do I have?",
        "selftext": "Am from India, late 30s male. Been suffering from depression for past few years. Been to psychologist and Psychiatrist and broached the idea I might have ADD. For past 3 years, they said it's just depression take some Antidepressants and it will be better. Didn't help too much. Finally changed Psychologist and she helped me get prescription for Concerta. My fuck up - I am in London for next 4 months and I packed in only one 30 tablet Bottle of Concerta. Has anyone tried to post Concerta through courier service? I've heard ADHD meds are confiscated by customs. Can I take my India prescription to GP in London? I don't have insurance for mental issues and can't really afford going to a private doctor. "
    },
    {
        "name": "t3_fprehf",
        "created": 1585315805.0,
        "ups": 3,
        "downs": 0,
        "title": "First day on meds",
        "selftext": "I just took Concerta for the first time because India doesn’t have most of the other meds and I finished a whole trigo worksheet in one hour, even though i never payed attention in class but now i can’t bring myself to scan it and send it as a pdf so instead i’m here complaining on reddit We Love ADHD!"
    },
    {
        "name": "t3_fo0grv",
        "created": 1585060839.0,
        "ups": 2,
        "downs": 0,
        "title": "Wow, just visited this sub for the first time. Sorted posts by Top and am now 100% sure that I have some form of ADHD.",
        "selftext": "Obviously first time posting here, maybe a bit long, but it felt important to me to share my story, if only to materialize the thoughts swirling around my mind.I've been aware of my struggle with sustained attention for as long as I could remember, but always coped. I did very well academically in hs, was social and well-liked, and assumed I didn't have ADHD because I had heard it was over-diagnosed (though I did question it intermittently).After graduating high school, I moved to India for a year, where I lived and tutored in schools, and then to Los Angeles, where I did the same. This year, I decided it was time to go to college, and I was accepted and enrolled at a rigorous liberal arts school in NC.I've always loved school, particularly the social aspect. And I love learning. But reintegrating into the world of academia reminded me of all the challenges I faced there, particularly the banality of so much of it. Add to the fact that the social scene was underwhelming coming in as a 21 y/o freshman; I wasn't starry-eyed about the party scene and the freedom of college life, I was in fact abandoning the freedom of living independently among other things.I managed to finish my first semester with a 3.85 gpa, but it was difficult, and I resented so many aspects of it. Tutoring in a school was never mundane, it was wonderfully spontaneous and often chaotic. And I loved my students. But college life reminded me why I began to wonder if I was ADHD in the first place.  This 2nd semester has been incredibly hard; I've become disillusioned with my education and have a hard time focusing on damn near anything for very long. All of this caused me to seriously reconsider the possibility of my being ADHD.I reached out to a family friend who works with diagnosing ADHD and he agreed to meet on the completion of their standard evaluation form... which of course has sat on my desktop for a couple of months as it is a long and detail oriented form. I am well aware that it is to my benefit to complete it and meet with the professional, but I am sure many of you can relate to the procrastination of such tasks.Anyway, decided to visit this sub on a whim, and was blown away by reading posts that I might as well have written - particularly having to incentivize myself/play mental games to complete small tasks, avoiding larger ones altogether, mannerisms like face-touching, or, absolutely and completely, struggling to brush my teeth with any sort of regularity.I know this is not a diagnoses, but I feel now that I have all the evidence and more. This has been something that has created so many unnecessary challenges in the past for me, and it's time that I start to understand it and work with it.Here's to a start of a new journey, I'm excited to work through a potential diagnoses with my doctor and spend many more sleepless nights with y'all here on this sub!aight. now I need to get back to that philosophy paper that I wrote this to avoid doing, encouragement encouraged hahah &lt;3"
    },
    {
        "name": "t3_9dral5",
        "created": 1536327622.0,
        "ups": 5,
        "downs": 0,
        "title": "ADHD in India",
        "selftext": "Does anyone else on this sub from India have ADHD? If yes, what medications did you take? Is there a proper way to get diagnosed? I'm from a small town, I need to know if there is actual help available here. I'm 23 years old and every time I talk to my parents about me having ADHD they just say \"It's all in your head.\" And does medication actually help?"
    },
    {
        "name": "t3_9uej4e",
        "created": 1541461079.0,
        "ups": 96,
        "downs": 0,
        "title": "At 28, ive decided to never have a job again, and I'm pretty happy about it. (First reddit post ever)",
        "selftext": "I'm a Copywriter working in India, and after 4 different jobs in the last 6 years, I've finally decided to call it quits. Decided to just go where my ADD mind leads me. I've decided to stop worrying about being normal and embrace my ADD instead. I've decided to stop trying to be like everyone else, having an office job, because quite frankly it has been killing me slowly.I do have a freelance writing job on the side that will pay my bills. It allows me flexible timings and I'm happy doing that. But I really also wish to explore. I want to know what else I can do. Over the years I've realised I have a great sense of humour (in fact more than great) I have done a few open mics here and there, and I can say I was better than most at it if not the best (on the night). Only thing that stopped me from pursuing that was money. I'm still figuring what else I can do and although I am happy to have taken this decision, I am a little apprehensive about doing this. Has anyone else been down this road before? If yes can you advise?I can't deny I am a little nervous.Edit: Loved reddit as a lurker. Loving it more as a poster. Thanks for the words of encouragement guys. I'm a little overwhelmed by this. Going to be a regular now."
    },
    {
        "name": "t3_6ghq5y",
        "created": 1497158955.0,
        "ups": 3,
        "downs": 0,
        "title": "ADHD in India",
        "selftext": "Is there any hope for some one having ADHD in India? From what I have read, majority of people are not aware of ADHD or don't believe anything like this exist. "
    },
    {
        "name": "t3_dxkxkh",
        "created": 1574014693.0,
        "ups": 3,
        "downs": 0,
        "title": "Should I tell prospective colleges that I had to take a gap year because of ADHD?",
        "selftext": "Hello hello, I need some advice regarding how to tackle my SOP for grad school applications.  So, for some context, I finished college this year, B.Arch., from India. And I got my ADHD diagnosis three years back, this was actually after I'd failed by 3 marks in one subject and did not have enough credits to go on to the next year, so I had to repeat a year. Architecture, in general, is a very stressful course and I wasn't able to cope up with everyone. After I got diagnosed, things started to make a lot more sense, and I wasn't struggling as much anymore (thanks to therapy and meds). And to be totally honest, that's the only reason I have for completing a 5 year course in 6 years; I don't have a neuro-typical brain and I need a little more help than most people.  Okay, now for my question, I'm applying to grad school in the states and I've been told that I should address the whole \"taking 6 years instead of 5\" thing in my SOP and give a genuine reason. But, I don't know how to write it. I don't even know how to say it. Mental health is not taken seriously here and even my parents are suggesting that I should give a more \"digestible\" reason like typhoid or chicken pox or something. And although, I was offended when they suggested it, I realized later on that that might be a more practical way of tackling the situation, because I don't know how it would be received by the admissions offices at the colleges.  If anyone has any experience with this or a similar situation, or if you know how colleges might react to ADHD being the reason why I fell behind, please help."
    },
    {
        "name": "t3_d466i5",
        "created": 1568501639.0,
        "ups": 5,
        "downs": 0,
        "title": "I think ADHD Meds are destroying my marriage",
        "selftext": "I've been a lurker for years. Created an account to seek help in a desperate situation.  Apologize in advance for grammatical errors as English is not my first language.My husband was diagnosed with ADHD a year ago, and has been on medication ever since. For the first few months it was AderrallXR, and then Vyvanse. He says it has helped him with his focus in his job. I do not disbelieve that but he has a PhD and a high paying job, which he had long before he was diagnosed. We have a 9 year old son.My problem is on the home front. His personality changed overnight after being on the drugs. We were a totally happily married couple, and three weeks later he said he wanted a divorce. I thought it was a big joke. Since then, he has made my life a living hell. He shouts, gets aggressive and drives like a maniac (endangering us). He has become paranoid about me, saying I will kidnap our child and take him to our home country, India. I have told him he can keep the passport if he is so worried. Somehow, even that doesn't help. He calls me an unfit mother, and says he feels unsafe with me. I said these are big words, and what are the reasons he feels this way, he says he does not need to give reasons. He is just always angry at me. He says he has been unhappy for more than 5 years. When I asked why he never said anything all these years, he has no answer. He recently moved out of the house. His family is very worried about him. They feel he is very depressed. What do I do? I am at the end of my rope here. I am so angry at him sometimes for treating me the way he does and I am also worried that he can hurt my son with his reckless driving (he becomes extremely angry if someone cuts him off, for example).  But I know he is suffering too. What do I do? I feel I am drowning here, and any advise will be appreciated."
    },
    {
        "name": "t3_d4hwgw",
        "created": 1568565262.0,
        "ups": 34,
        "downs": 0,
        "title": "The best time management skill that i learned on my own.",
        "selftext": "I'm a 17 year old unmedicated high school student. I have ADHD but getting medicated in India is a tough task. So, I have to develop my own methods to tackle problems of time management and completing assignments on time. Now, let's get to the topic.So, what's 15 minute rule?It is kind of like the pomodro technique but it has one change : in a pomodro technique you take rest after short intervals after studying for say 25 minutes but in this technique you study for 15 minutes then completely change the subject or chore and take a break after 4 times of repeating.If you're studying maths, mark the question where you want to reach when the 15 minutes end.Why this is more beneficiary than pomodro?When you start working on a task your brain will eventually get fixated on the task ( I know this not easy) but soon it will also get bored of the task that's when you change the task. It will set your brain in motion and you will retain more knowledge in less time. In pomodro technique, when you complete 15 minutes you take a rest. Now, you sit down on your comfy sofa , your phone is in your hand. You scrolled twitter for a few minutes. OH! 15 minutes passed, now it's time to solve some equations . You're now sitting on your study table and you're on question 4, you check the timer. What?!, Only 4 minutes elapsed. Your brain now starts thinking this shit is boring as fuck. This work to rest transformation completely disrupts your momentum. Your brain is not fixated to solve the task but it is rather thinking when this 15 minutes will get over. This is not a problem in 15 minutes rule because the momentum is not disrupted .How to use technique efficiently?The biggest problem we ADHDers face is sitting and reading. How to read and retain what you've learned?. It's quite simple folks, just read aloud and then become a teacher. Become a teacher? The fuck you mean? . I mean just imagine that there's someone sitting besides you and you have to explain all of this shit written in the book and do it as loud as you fucking can. Things to remember before applying this technique:• stay from all this distraction for 4 sets of 15 minutes or rather 60 minutes.• after 60 minutes do whatever you want but only for 15 minutes .• this method only works in complete isolation ( maybe it might work for you even in not complete isolation)• if you are medicated then you use your meds after first 15 minutes.• a minor distraction might disrupt your momentum, so don't let any of the motherfucking distraction come in your way.• don't panic if your momentum is disrupted. Just take deep breathes and think if I concentrated once I can do it again and again.So, that all folks. I hope this method works for you. One more thing, I don't know who you all are but I love all of you. You guys are completely amazing and you have given me hope in my lowest time of life. Please don't lose faith in yourself . Please .Godspeed."
    },
    {
        "name": "t3_e82gzz",
        "created": 1575881889.0,
        "ups": 9,
        "downs": 0,
        "title": "Aurobindo is criminal",
        "selftext": "To make a long story short, I have ADHD. It had been a problem my whole life. Eventually as a young adult, I sought treatment, was diagnosed, and got a prescription for Adderall, and the next several years of my life were remarkable. I achieved a great deal.Unfortunately some years ago, CVS switched my prescription from Teva (which I had taken for years, to good effect) to Aurobindo Adderall. Over a course of mere weeks, while under the influence of the Aurobindo pills, which made me tired, delirious, anxious, physically numb, and depressed, my life fell apart. My symptoms were exacerbated rather than mitigated. I eventually lost my job, and I have spent the past half decade attempting to cope with the damage that Aurobindo Adderall and CVS wrought on my life. Everything it took years to build was wrecked in a matter of weeks because of CVS and Aurobindo. Do the research. I'm not alone--there are loads of other people who have been poisoned by Aurobindo since 2014. Corroborate my thread with the accounts of the hundreds of other people who have been screwed when pharmacies like CVS switched them to Aurobindo without even telling them.For those who are still under the impression that \"generics are all equivalent\", here are some links to give you food for thought:Primary source: First hand accounts of Aurobindo poisonings dating back over 5 years https://www.medschat.com/search.asp?q=aurobindo+adderall&amp;x=0&amp;y=0Documented evidence of fraud on an epic scale from Indian companies like Aurobindo (in this case it was Ranbaxy, but the principle is the same--generic drugs from India ARE NOT ALWAYS UP TO STANDARD) https://www.cbsnews.com/news/ranbaxy-whistleblower-reveals-how-he-exposed-massive-pharmaceutical-fraud/Evidence that Aurobindo corporation itself has REPEATEDLY failed to maintain standards: https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/fda-pulls-up-aurobindo-pharma-for-repeated-failures-in-cgmp/articleshow/70059427.cmsThis debacle has done a ton of damage already, and mark my words, eventually it's all going to come to light and the perpetrators will be held accountable."
    },
    {
        "name": "t3_d3en7b",
        "created": 1568352020.0,
        "ups": 3,
        "downs": 0,
        "title": "Need to rant about my recent psychiatry appointment",
        "selftext": "So for context, I haven’t been on any ADHD meds that have actually worked in about a year. Most recently I was on Strattera which did absolutely nothing. (This is important and will come up again!) And now I’m currently on Vyvanse which is also doing absolutely nothing. At first I was put on just 30mg of Vyvanse. Had the placebo effect for a couple weeks and thought I felt something. Nope. Went up to 40mg last month. Still nothing. So I’ve been on it for about 2 1/2 months now. I was so certain my most recent appointment was at 11:30am so I fucking missed it because actually it was at 10:30am. And just from that, I felt like my psych should have been pretty convinced that my Vyvanse wasn’t doing anything, ya know? So I came into his office for our rescheduled time later that day and could tell he was kinda miffed. (Which don’t get me wrong, I understand. Just, wouldn’t you think he would have understood pretty well *why* that happened?) He asked me how I was and I very clearly responded, “it’s been rough the last couple months. I don’t feel like my Vyvanse is doing anything. I’m still struggling a lot with x, y, z, a, b, and c.” He goes, “no. It’s doing something, just not what you’re expecting it to do.” Well, what the fuck am I supposed to expect it to do other than help my focus, improve my memory, improve my time sense, help me get motivated to do things??? It got bad enough that I just started openly sobbing in his office because I’m just so goddamn tired of not being able to function adequately. As I was crying, he told me I looked more “real” in that moment than I had the entire duration of my appointment leading up that. (Weird comment, IMO) In the course of the rest of the appointment:• I was told to grow up, and get a thicker skin because life’s a struggle and I can’t react so much to the things that I’m facing. But then he also said I shouldn’t bottle up my feelings because it’s really unhealthy??? •He told me I need to express my feelings more because I don’t come off as a very warm person when people meet me. (Fucking ouch????) •He told me to stop thinking so much and slow down and relax. Take time to appreciate nature. Literally said, “look at a flower and smile because it’s so beautiful”.•I told him a lot of my anger comes from going undiagnosed for so long and feeling like nobody fucking cared how much I was struggling (except my parents who were really at a loss for what to do about it since the school said I didn’t have it). He said, “I never got a diagnosis. Look where I am! There are thousands of doctors all over the world who don’t even believe ADHD is a real thing. It’s pretty much not even a thing in India. People in China can’t get access to any kind of stimulant medication because it’s illegal there. And most of the people with ADHD in those countries are doing just fine and are successful. So you actually don’t technically even need Vyvanse etc. to function with ADHD.”• He said that the emotions I’m struggling with right now aren’t because of my untreated ADHD. And they’re probably not from my depression. They’re from *me*. At the end of the appointment, you wanna know what he did? Upped my dose to 50 mg and added 10mg of Prozac to my Wellbutrin. Even though I’d told him in that appointment that when I had tried it before, Prozac had made me so sleepy I had to go off of it for just that reason. I asked what his plan was for if the 50mg was just as ineffective as the other two doses before it. He said, “maybe we’ll try adding Strattera with it.” I just went home and cried more."
    },
    {
        "name": "t3_ecm3xj",
        "created": 1576748435.0,
        "ups": 1,
        "downs": 0,
        "title": "[21 M] Was hoping to get diagnosed soon until…",
        "selftext": "…the therapist said she wasn't available until January. This is terrible because I'm about to take a semester off from grad school in the US and go back to India within this month because of my poor mental health to which the suspected ADHD largely contributed. Failed a course and I'm probably going to fail another one.What sucks is that I've been hearing that ADHD is not even recognized in India, so I wouldn't be able to get a diagnosis. Moreover, getting a diagnosis back home would mean an awkward discussion with my parents about ADHD which I'm pretty sure isn't going to end well. I was hoping to get diagnosed without talking about this to any of my family members, and then explain the diagnosis to them. Well that's down the drain now.During the semester off, I am supposed to catch up on a lot of the fundamentals I am lacking in grad physics, and I'm wondering how I'm going to do that without a diagnosis and medication. Any tips on how to cope (without meds) with executive dysfunction/task initiation and the constant urge to stray away when I face the smallest obstacle while working?"
    },
    {
        "name": "t3_biz82g",
        "created": 1556627750.0,
        "ups": 16,
        "downs": 0,
        "title": "can someone suggest some study tips for people with ADHD without medication.",
        "selftext": "I live in India, where there are no ADHD meds other than modafinil. It doesn't affect me much and I think I need to do something else than med for improving my studies and should I try Ashwagandha pills with this?"
    },
    {
        "name": "t3_48wa2c",
        "created": 1457102708.0,
        "ups": 7,
        "downs": 0,
        "title": "Need help... I'm a recently diagnosed ADHD Medical Student in India, how do I study well??? I'm very worried and alone.",
        "selftext": "Hi, I'm a medical student. I got in the profession because I was scoring real well in school and had great interest in science. I never realised how my methods of thinking, study and my personality as a whole was different than my mates. My parents and elder sister were emotionally abusive and always poked me for being 'careless' 'non-attentive' or 'forgetful', ignoring the fact that they were the same too. My father was a physically abusive, sick man too, who beat us up and beat our mother even worse. After cracking medical entrance I got in the top Medical College in my state. But my studies went worse and worse and I passed all years on boundaries. (Little above 50%). I suffered great loss during internship as my girlfriend, who was  the first and only person I could really talk to, died in a shocking accident. I was devastated. I must have been damaged even worse, as I don't even remember most things from the next month.  I couldn't talk to anyone, and when i tried to talk to a very close friend about my pain, she basically said it shouldn't be such a big deal, people lose bigger things in life, like the other day a boy from our college lost his father. \"In your case, its a girlfriend' is literally what she said. She said she liked me as a friend before because i wasnt clingy or needy (which i maybe seemed like now to her). This was hurtful to me and needless to say i stopped dealing with people altogether. Nearly for a year i didnt go to college. I thought after i took time to grieve, everything will be normal. After becoming a graduate we're supposed to prepare for post grad entrance exams, which are really tough. I couldn't focus and at the time whenever i studied, it was harder than ever before. I quit studies and did a good job for a year. I realised my potential was more, and wanted to pursue studies again. I quit the job and started studies. After a few months, concentration started fading away and i got stuck again. I decided to sort myself out and I took notes, wrote my symptoms down, and basically diagnosed myself as an ADHD patient. Everything matched (for those doubting my self-diagnosis, I have studies ADD in great detail, know whole DSM 4 &amp; 5 protocol for diagnosing. I'm ADHD alryt.) I started on methylphenidate, sold here as inspiral SR, (in USA it's Ritalin). I need to share my experience and problems with people-ADHD patients or not- who're sensitive and friendly. If you can help, you're most welcome. I really need help, because awareness of ADHD is very little in our country (India) even amongst psychiatrists. I have psychiatrists telling me it's a 'fanciful' diagnosis. As if it's not real. Hope that doesn't happen here.  Anyway my troubles are these-1. I'm depressed. The more days i spend on medication, the more I realise about how I have suffered in my personal life because of ADHD, and despite trying, I have difficulty embracing my ADD. How can I, when literally no one here even knows the disease and even if I explained it to them, they're in denial. I'm on fluoxetine 10mg, I kept the dose low because I'm afraid of rebound depression. I'm thinking of increasing the dose in a few days.2.I need help in studying- motivation, tricks to focus long hours studying, any positive ideas.3. Personal life is hell. I'm all alone. I have lost too many friends as I get 'disappointed' in them after a while of being friends. This is happening more and more after death of my Girlfriend as I'm hiding the pain from most people. 4. I can't let go my childhood bad memories. I can't talk to anyone about it. Only one person I opened about it is gone..5. I am seriously worried about my marriage etc. Like I'm not married yet, but I don't think I'll get an understanding person who'll accept me, with my ADHD plus my tragic past. Most people in my profession here are very self centred and that's why I never got in a relationship with a girl from my college. My GF was a paramedic and we were really each other's best friends. She was so good, my expectations of a partner don't even seem realistic now. Should I worry??Anyway, I want to thank anyone who read it all, esp.ADHD ppl out there, cuz I know it's nearly impossible for us to go through a black n white page whole. I am new to reddit, so if I'm mistaken anywhere please help me correct. "
    },
    {
        "name": "t3_at00ol",
        "created": 1550760560.0,
        "ups": 10,
        "downs": 0,
        "title": "Just wanting to share something &amp; thank everyone for their support",
        "selftext": "Last year, i was in tremendous pain and had multiple health complications thanks to wrong medication &amp; diagnosis. Maybe as luck would have it, i accidentally discovered this community &amp; connected so well with all the issues &amp; solutions posted here. Despite going on methylphenidate, it wasn't an easy journey thanks to akathisia yet I kept pushing myself and used lot of the good tips &amp; coping mechanism suggested here. They helped me tremendously, not only to heal but survive my exams too. My result recently came &amp; i managed to clear 12 out of 13 subjects despite battling alot of complications which wasn't possible without your support. So, thank you everyone - you all are awesome and despite our struggles and shortcomings, we still thrive and evolve which is what matters the most. Cheers, take care and lots of love, support and appreciation to all. You guys rock 🙋‍♂️💁‍♂️Tl;Dr - cleared 12 out of 13 subjects despite health complications, thanks to support from everyone here. Keep working on yourself and don't let anyone say we are inferior in anyway. Hugs"
    },
    {
        "name": "t3_eo8krh",
        "created": 1578971048.0,
        "ups": 1,
        "downs": 0,
        "title": "Are there any (free) resources for an adult with ADHD who doesn't have the resources to go for treatment?",
        "selftext": "Someone I know got diagnosed with ADHD at 24 but was unable to continue with more than 3 therapy sessions due to financial (and other) reasons. Unfortunately, we live in India where psychological treatment not covered under insurance and therapy is fucking expensive. Are there any resources that might help him, at least till he is able to get the help he needs?"
    },
    {
        "name": "t3_cwd3lc",
        "created": 1566980536.0,
        "ups": 3,
        "downs": 0,
        "title": "I think I may have ADD/ADHD but my parents won't let me get tested [HELP]",
        "selftext": "For about a year now I've been struggling with the idea of possibly having ADD/ADHD. I've looked up the symptoms and feel that I suit almost all of them, but when I tried to explain the idea to my mom, she told me that she's seen a kid with ADHD and that he struggled with all of his classes. She also went on to explain that she felt the same way when she was a kid, but her parents just slapped her and told her to work harder (she grew up in India where it was normal), so she did. I tried to explain to her that not everyone with ADD/ADHD fails all of their classes, but she still thinks that I want to get diagnosed because I think that having ADD/ADHD or being on meds would make me cooler, or that it's just a teenage thing. Also, if I fidget too much, talk endlessly, or zone out, she thinks I'm trying to prove that I have it so she'll take me to be tested. When she didn't listen to my reasoning I broke down in tears of frustration, and I haven't brought it up since. I will say that when I was younger I didn't really struggle with my classes and found everything easy enough for me to just glide by, but when I hit 7th/8th grade (11/12 years old), I began to actually fall behind in work since I happened to be in more advanced classes. Now I'm in 10th grade, 14 years old, taking on multiple AP classes, and I'm really struggling to keep up with work and notes due to my procrastination, extremely poor time management, and inability to focus on things when I need to. I'm turning 15 in a month or so and I'm hoping to bring up my symptoms at my yearly checkup with my doctor, but I'm scared of my mom getting angry with me for not asking her about it first, and I don't really know how to bring it up. (I didn't know where to put this in my paragraph so I'll say it here: my mom thinks that my teachers would have told her when I was younger that I'm struggling to sit still, but I don't think I'm part of the hyperactive subtype.) I just want to speak to a doctor so I can find out whether or not I have it and can finally get closure \\[please understand I'm not trying to self-diagnose; doing that is super not epic.\\] Pls help a fellow gamer out. :)"
    },
    {
        "name": "t3_ccao0h",
        "created": 1562965903.0,
        "ups": 6,
        "downs": 0,
        "title": "Experience with Atomoxetine (strattera)",
        "selftext": "My doctor started me on 10mg Atomoxetine and I have been on it for 5 days. He has asked me to take half of it(5 mg) for the first 7 days and then take the whole tablet.I have doubts regarding this dosage. Did everyone in this sub start taking such low dose and then gradually up it ??I am also on Aripiprazole because my doc suggets a possibility of Bipolar also.I know Atomoxetine takes time to show effects but my depression has hit me worse since I started taking it. Zero motivation to study. I have exams starting Monday and I have almost f'ed up.I am also emotionally not well. Hope you guys share your experiences with Atomoxetine and anyone who has taken Aripiprazole.I am from India and I don't think there are many options available to me apart from Atomoxetine. So, I really hope it works and make me better."
    },
    {
        "name": "t3_cikpwk",
        "created": 1564279361.0,
        "ups": 3,
        "downs": 0,
        "title": "I quit my first job after working for only 2 days",
        "selftext": "Firstly, I just wanted to say this subreddit is the best thing ever. This is the first time I feel like I relate to someone. Thanks everyone for sharing your stories. I've not yet been diagnosed even though I want to. I live in a country where mental health is not taken seriously at all. Good therapists are very few and expensive. I have the sweetest parents but I know they will worry too much if I share my problem. I just quit my very first job after working for only 2 days. This is the second job that I bailed out of. I was given my first offer with good pay while I was still doing my third year at college. I was the first one to get an offer in my whole department and I foolishly rejected it. My plan was to become a freelance developer. After I finished my college, I went into a panic mode. I simply couldn't concentrate on anything. I constantly felt overwhelmed, hopeless and had no self confidence. I felt like I was overworking myself while in reality I accomplished nothing of actual impact. Everyone I studied with got a great job while I was struggling to discipline myself to even focus on a small task. An entire year passed(which I still cannot believe) and I did not get paid at all. Once again I went into the same panic mode. I decided to settle down for a 9 to 5 job not wanting to worry my parents. I got this job in BFSI domain which I had absolutely no interest in. On the very first day, I felt lonely and overwhelmed. Nobody had time to help the new girl and I don't blame them. I went for the second day but I couldn't take it anymore. The loneliness and anxiety was too much to handle so I quit. I also would like to add that I've been diagnosed with PCOS and the anxiety really doesn't help. So I'm unemployed again and hate myself. I don't know how to break this pattern of making rash decisions and hating myself afterward. Have you ever quit your job after working for only a day or two? If so, how did you handle the aftermath? Also question to any Indian here: How did you get help. Also how did you explain to your parents without scaring them? Sorry for such a long rant."
    },
    {
        "name": "t3_di89j2",
        "created": 1571176577.0,
        "ups": 2,
        "downs": 0,
        "title": "Tried all the medication available in my country. None of them work. So that's it? I'm screwed for life?",
        "selftext": "I'm struggling to type this cause I'm feeling broken. I'm a 19 year old guy from India and I've been diagnosed with ADHD and depression. I've been trying to work my way out of this shit for the past two years. I've tried all the major ADHD meds and antidepressants  available in my country as suggested by my psychiatrist. They made me feel even worse. Some made me extremely anxious and some caused insomnia. So I guess they're not suited for my body. I'm in college right now and my academics are going downfall. All this while the only thing that kept me going was the small hope that some medication will eventually work. It's not just academics that I'm worried about though. I can probably slog my way through college and just get my degree and land a job. But it doesn't end there right? Then I've got to struggle at work. For the rest of my life. The fact that I'll never be able to do something to my full potential crushes me."
    },
    {
        "name": "t3_4k8mku",
        "created": 1463785263.0,
        "ups": 5,
        "downs": 0,
        "title": "Going to India for 3 months. Not enough meds. What do I do? Help!!!",
        "selftext": "I'm leaving for NYC tomorrow, and India on either Monday or Tuesday. I have 28 pills of Vyvanse. I can't get any Vyvanse or Adderall in India. They have Ritalin, but I would **strongly** prefer Vyvanse. It works for me. * **Can I get a second month's worth of Vyvanse somehow?** I have a prescription for another month, but I can't get it b/c it's a schedule 2 drug. * Can I get a prescription for Adderall/a different med and take it the medicine with me? Or is this still illegal (b/c schedule 2 laws)?* Anything else?"
    },
    {
        "name": "t3_cbrhmj",
        "created": 1562849644.0,
        "ups": 16,
        "downs": 0,
        "title": "A new coworker has a terrible accent that requires my full focus, which made me realize how little I pay attention normally.",
        "selftext": "I just started a new job in IT, which means having to learn a lot of new things, mostly by people telling me about them. One of my colleagues is from India and we converse in English. Not only does she speak fast and with a terrible accent, she has a lisp. If she is talking about something complicated, I found out I really need my full attention and even then will hardly understand her. I've been working on switching my attention quickly enough. This made me realize how awfully little I usually pay attention to what people say, it's like really a quarter of my entire focus. I mean I sort of knew but it just feels completely different. It kind of surprised me."
    },
    {
        "name": "t3_dtew5u",
        "created": 1573245664.0,
        "ups": 3,
        "downs": 0,
        "title": "Sometimes I wonder if there is a God!",
        "selftext": "I grew up in a time when ADHD had not been detected. I had back then, unfortunately, horrible humans for school teachers. The only authorities who appreciated me were my music and dance teachers. I was actually good at academics. I liked Math, literature, the sciences, social sciences, etc. But teachers were finding fault at my untidy books and my forgetfulness.Other issues I had were being extremely naive and lacking self-awareness as my parents themselves were this way.I grew up hating myself. I chose a subject that I did not like.  thought I will not amount to anything. I attracted bullies all the while. I was so afraid to take a job. I chose low-end jobs like being a receptionist etc.My luck came in the form of good bosses. I got the job as a tutor in an institution that caters to college students. My bosses only saw that I was really good in my subject (I later switched over to something I liked ). They never gave much weight-age to my clerical screwups. Once I had even lost a bundle of exam answer papers ( I was jostling between 3 more part-time jobs, then). Then I forgot to write down numbers on the desks once before a government exam.&amp;#x200B;But my bosses understood. My job does not pay well. But it does give me enough time for my music and time watch my health.I have finally achieved success in the form of my child doing extremely well academically and professionally.I am a single parent. My husband had abused me and thrown me out. My mistakes due to my ADHD were magnified and I was beaten black and blue many a time. ( I come from conservative India). I still do not have much confidence even to this day.My success has , but,  given me the confidence to analyze everything. I am actually , academically very intelligent. I am very talented in music.I also understood why most women, especially my teachers hated the very sight of me and as to why they were using my mistakes due to ADHD, to bully me.I have lost a lot. I could have won over the world with my talents. My only wish now is I achieve something through my music or my research field to compensate for my heavy losses in life."
    },
    {
        "name": "t3_chihll",
        "created": 1564054874.0,
        "ups": 5,
        "downs": 0,
        "title": "No hope",
        "selftext": "So today in a class about happiness, we were discussing the theory that if youre really focused on changing something, that motivation will drive you to achieve that state. In my group, I pointed out that when you have adhd or depression, focus/motivation works different because of your brain chemistry. (I gave them the whole break down about dopamine receptors). Then this guy says \"but adhd is a new problem that's recently come to India and it can basically be fixed using yoga.\" I found that kinda funny and started to educate him about how that's just not true. But then I was rudely taken away from the discussion to this chick who tried to explain to me that adhd is just an excuse that I'm using and I was like '' ??!??!? ''. Becuase I'm at a point in my life that I accept my ADHD/DYSLEXIA as one of my core strengths. Its the reason I got in to design college for creative education design. I'm not saying it's a bad thing, how can I use it as an excuse? It might be the reason I do something different but it's never an excuse. She continues to say, \"we all have problems too\" &amp; \"don't you think normal people lose focus too?\" And my hope in humanity died a little more every second of this 10 minute convo. I got too emotional to respond to her after a bit so I just ended with \"idk dude, I think I know myself. And I judt don't agree with you.\" Because at the end of the day, this girl barely knows me. We've rarely had classes together and we have no mutual friends. Also, I remember 2 years ago, she went around telling people I was weak because I was one of the first people in my batch to actually regularly start going to the college councilors becuase of hee whole group going around and slut shaming me for no reason and I couldn't handle it alone. So why am I surprised/angry when she's just a terrible person? UGH."
    },
    {
        "name": "t3_dtutzz",
        "created": 1573327908.0,
        "ups": 3,
        "downs": 0,
        "title": "Feels like I've hit a dead end",
        "selftext": "I'm a 19M from India. I've tried all the major medicines available for ADHD. None of them worked. Some of them caused terrible side effects. I became depressed after a while and then my psychiatrist made me take antidepressants so that I could concentrate and get through college. They also caused horrible side effects. Idk if all the meds I took fucked up my brain because I'm not able to do anything these days. It feels worse than when I didn't take anything and was unaware of my ADHD. My attention span is like 2 minutes and I have no motivation to even do simple day to day tasks. I just want to be able to finish college with bare minimum grades. If only I could sit and read a few lines from a book and get it in my head.I'm feeling hopeless. How is that not a single medicine helped? I just feel like crying."
    },
    {
        "name": "t3_ay6xm4",
        "created": 1551951629.0,
        "ups": 1,
        "downs": 0,
        "title": "What is the consensus on aurobindo and epic adderall?",
        "selftext": "Recently, my local (Raleigh, North Carolina) pharmacies have been trying to give me Aurobindo or Epic adderall. I've been on adderall long enough to be weary of manufacturers I am not familiar with, but a couple months ago, I gave in and let them fill my Rx using Epic. It was trash. Literally felt like I took melatonin or something. I literally blew through my 30 day supply in like 12 days and it totally screwed me as I am used to taking 30mg IR 2x daily. But that stuff did NOTHING for me and really screwed me over. Yesterday, CVS here tried to give me Aurobindo and I didn't take it because I did not want the same thing happening again. I usually get TEVA, Barr, Corepharma, etc and all of those are great for me. But I've never gotten Aurobindo. I wanted to see what the general thoughts on Aurobindo are before I let them fill my Rx with that stuff. From what I've read so far, it's not very good. Of course, there are a few people who like it, but most of the posts I've come across are from a year or so ago and it seems like these manufacturers just do whatever they want and change stuff up pretty frequently. "
    },
    {
        "name": "t3_b6u29l",
        "created": 1553871496.0,
        "ups": 16,
        "downs": 0,
        "title": "My conflicted feelings on hyperfixation",
        "selftext": "Ok. So I had a conversation with an (also ADHD) friend tonight that has me anxious and frustrated. I have been an obsessive person all my life. I think a lot of us experience that intense level of interest for something. When it sits in your thoughts all through the day, especially idle time. When you can't get enough of it, and you get that unique sense of joy when immersed in it. For me, it was usually TV shows, comics, or historical periods. They can last from a couple weeks to months. You almost always want to bring it up in conversation and info dump to whoever will listen.But after a while, the high starts to wear off. And then you get that odd sort of depression where you haven't found a new special interest, but the old one is getting tiring and almost stressful. Well, that's where I'm at with my current one. Not to mention, it has a unique problem. Though this series is pretty long running and therefore has a ton of content, there is next to no online fandom presence. So all of the pent up energy and thoughts I get on it have no where to go. The social aspect is completely gone, and it feels isolating sometimes. I managed to get one friend of mine into it, and have been sending some in his direction, but I'm getting the impression that he's starting to get sick of it, which is understandable. I told him that I appreciated the emotional labor he was giving me and that I didn't know what to do with my fixation. And then he had an attitude that surprised me for another ADHD person. He kept telling me to just find something else to be into, and that he can limit his fixations to a day. It just doesn't work that way for me. I can be into other things, but I have never been able to control when and for what I form an intense special interest. So him just telling me to \"find something else\" sort of felt like when people tell me to \"just calm down\" when I have anxiety. It just made me feel embarassed, which I already kind of do because my current special interest is kind of silly and cheesy. My sister, who is also ADHD, once pretty much said that she judges me negatively for my obsessions because she feels like spending that much time on movies or shows is a waste. She hyperfixates too, but on goals like getting a promotion or getting married.  I've brought it up with therapists, but their advice was also along the lines of \"just stop thinking about it!\" And to be quite honest, I'm not sure I want to lose it. Sure, the low period and info dumping on innocent victims and impulse buying can be a problem. If you're fixating on a fictional thing someone else is writing, you're basically placing your mental state in someone else's hands. When your brain is always thinking on it, it doesn't get the calm and rest it needs. It can lead you to glorifying people who shouldn't be glorified. But I love the high and creative energy it can give me. A few of my favorite paintings that I've made were inspired by special interests. I wouldn't know all I do about, say, India during WWII or 1930s Jewish Mobs if I hadn't discovered the topics while exploring my obsessions. I don't know if I want to like things a normal amount. Would I even be the same person if I did? I guess that's where I'm at right now. I want a mental break, just a bit of calm. But I also want an outlet to express my feelings on my current interest without dumping it on one person. And i wish I had better control over how much my brain thinks on a thing, but I also don't want to lose the passion my obsessions can create and the creative work that results. Also, I have an underlying anxiety that I have depression and my interests are basically unhealthy self-treatment via distraction. "
    },
    {
        "name": "t3_cn755p",
        "created": 1565220076.0,
        "ups": 1,
        "downs": 0,
        "title": "The video that changed my life.",
        "selftext": "Please find time to read the whole post (I know it's hard ;-) But try )Hello friends. I'm a PG student currently pursuing Research and Business Analytics. I came to know that I have ADHD fairly recently (5-6 months). The video that helped me understand this was very uneasy to watch. I'm into gaming very much (a way to distract myself from unnecessary thoughts). This video came in recommendations in YouTube (a gamers experience with a kid having ADHD).The video- https://youtu.be/KZWOXgc7PA4 As an analytics student, I've decided to dedicate this year into research on ADHD to find ways to help kids having ADHD. I always felt that my condition was a blessing more than a curse (before coming to know that I have ADHD). However, my mindset changed and wanted to move into medication and drugs. In the last few weeks I learnt that I don't need medication. It's the way I was supposed to function and I don't feel any need to change my outlook on life. This is partly because over the last few weeks I realised I have people in my life who genuinely love me even tho they don't know about my condition. So, I'm going to try and find ways to help kids having ADHD using different analytical tools. I'll need your help for doing this. I'll post again when I need your help making world a better place for people having ADHD.P.S.: I'm from India. My parents (most Indian parents) don't feel that ADHD is a real condition. This is for those Indian kids."
    },
    {
        "name": "t3_46gsx3",
        "created": 1455856332.0,
        "ups": 3,
        "downs": 0,
        "title": "Adderall in India?",
        "selftext": "How can i get Adderall in India? Any licensed pharmacists which i can contact who can ship the drug? My doctor doesn't recommend the drug because he doesn't know of any pharmacists who have it here. They only prescribe Ritalin.I've heard it's better than Ritalin in a lot of ways."
    },
    {
        "name": "t3_a3giwe",
        "created": 1544072380.0,
        "ups": 8,
        "downs": 0,
        "title": "6 year old hyperactive boy. What strategy should we adopt?",
        "selftext": "Our son is a bright, free-spirited  6-year-old who has trouble focussing on tasks he does not like. He can focus for hours when he is building legos or doing art or any physical task. He exhibits a high degree of defiance and gets really frustrated at times. We are not in favor of medication, and again it's because we feel he may be borderline hyperactive and not a textbook case of ADHD.  And would like to exhaust all possible options before we take the medication route.To an extent, I feel like I was like him, but grew up in India and not in the US. Along the way, I guess I picked up ways to deal with it - physical exercise, schedules etc. What strategies should we adopt on a day-day basis? As parents, we want him to have a balanced life."
    },
    {
        "name": "t3_cc8mco",
        "created": 1562952466.0,
        "ups": 2,
        "downs": 0,
        "title": "Career satisfaction/Crisis of confidence",
        "selftext": "I am SPIRALING TONIGHT.So I am a healthcare recruiter and I really like what I do, I talk to people, make sure they are a fit for a job, hopefully help them get hired and manage them on temp contracts. It’s not super competitive or sales-y. It’s a lot of Different projects. I like my coworkers, my boss seems to really get adhd because literally 5 of my coworkers have it. The problems are: there is no growth, besides commission. This is my first job out of school and it involves a lot of cold calling (100 calls a day). My pay sucks, and according to Glassdoor I’m underpaid by 10-15k a year. A ton of people have left (when I started there was 18 people in the office and now there is 10). My benefits suck, and they have no work culture. They have replaced my existing team with people from India, and while our outsourced team is getting better, they suck but my boss constantly sings there praises. I live with my aunt who is a SAINT. And as much as I like living with her and just nailing my student loans as much as I can (I impulse spend a little) I don’t really have any privacy, and I’d like to move out. I’m frustrated with my life and but I’m like wow I love my job, I love my aunt! I’ve started applying around and I want to do HR administration stuff and internal Talent Acquisition, preferably in healthcare but nothing that interest has opened up in my 5minutes of looking. I don’t know I think that my boyfriend triggered this (unintentionally) because he just started a great job at a company with great benefits and he’s a straight university hire. He’s got imposter stuff going on even though he went to a great school and he’s there with Ivy League kids. We were talking about benefits and I was embarrassed to tell him that I really don’t have any and today I also found out that I use my personal cell for work and the other recruiters get 50 bucks a month toward there phone plans and I don’t! They told me that I just had to use my personal cell!Also one time in a meeting I got frustrated and cried and it was very embarrassing so that’s pretty up there as well. That was 2 weeks ago.Anyway I woke up in the middle of the night and caught a negative wave and I am going to try meditation and try going back to sleep."
    },
    {
        "name": "t3_auf7pn",
        "created": 1551086792.0,
        "ups": 5,
        "downs": 0,
        "title": "Is it possible to have ADHD if there's no family history of it?",
        "selftext": "22M here, after noticing a lot of the symptoms of ADHD (primarily the inattentive type) in myself (and doing some thorough googling), I'm considering seeing a professional for a diagnosis. The problem is nobody in my family that I know of has been diagnosed with ADHD, although that may also be because my parents migrated from India, so mental health awareness may not have been as ideal. I guess my question is would a professional still consider my situation even though there's no known family history? I've read that ADHD has a strong genetic component. Consultations are fairly expensive (I don't have health insurance) so I'm a bit apprehensive about being looked at in fear of being wrong."
    },
    {
        "name": "t3_chxl2z",
        "created": 1564139882.0,
        "ups": 8,
        "downs": 0,
        "title": "12 years of childhood, 3 years of hell made by my mother’s partner, 3 years of after-hell by my mom. Then I left home, and started loop: family home-work-quitting work- commiting crimes-going to prison-returning do",
        "selftext": "This was great moment when i found why I'm acting in particular way. I don't really know, howI finally know, why I think and do things in different way than other people, and start seeing this as personal trait, not as disorder. I want to share a lot of things that I recently realized, that killed my self-esteem in childhood, and let me regain it in last years. And also, try to explain, why it was killed again in last months leading me to losing control over my life, and making any of my strategies uneffective.I was brilliant kid. I learn to read when I was 4, and to write half year later. When I went first time to school it was very crazy time in Poland. We’ve gained independence from Soviet Union, dropped communism, and started capitalism.  My mother was trying to send me to french school near our home, because she thinked, that their education system is much better for kid like me, but she hit the budget barrier. So I went to normal school with normal kids. At the beginning of elementary school teachers wanted to move me 2 classes up, because they thinked that it will allow me to use my potential. And my mother decided not to, because I was very small kid, smallest in my current class, so she was afraid that older kids will not accept me. What can I say - the kids in my age did not accepted me either, so I was outsider. My father is now 80. I'm 36. It's huge age difference, so we never had great connection. Also until I was 10, he was alcoholic, coming to home drunk often. But it was only time, when he was able to give me some attention, so I preferred his that way. He stopped drinking, when my mother demanded it, or she divorce him. It was quick decision, and he was not drinking for next 25 years (unfortunately, he started one year ago, on my niece wedding), showing his strength and determination. When I was 12, and my grandfather died, our family decided, that I'll move to countryside, where he lived with my father, to try to rebuild our relation, and mom will stay in Warsaw to take care of her business. Few months later she came to take me back to Warsaw with her new partner.I liked him a lot. Cool, progressive, with car and knowledge about things that were interesting to me. He told me, that he will never try to replace my dad, that I have my own dad, and he always want to be my friend and support me. He was a role model for me, I wanted to be like him a much. He was caring, looked like he really love my mom, and at the beginning I looked at him like ideal man. I was dreaming that I'll study physics like him, that I have beard like him, and this great trait of affecting people emotions with deep voice. He was here, to talk with me when I needed, not my dad. He was making pancakes every weekend, not my dad. He was explaining, that there is nothing wrong in naked body, and I don't need to be shy on the swimming pool and hide to change clothes. Unfortunately, he also told me that I should be ashamed of MY BODY, because I was a *little* overweight then. And wrong things started to happen soon: He started to punish me for little mistakes, he stand over me and controlled if I'm making thinks the way he want, without allowing me to use my way to get the results. As ADHD i wasn’t able to work with him looking over my shoulder, commenting the process, and being not interested in result at all. The he started to abuse me mentally, calling me an idiot, moron, because even when I was able to deliver proper solution, I was not able to deliver satisfying method. And next years were hell. In late 90s nobody in Poland could diagnose me? And tell that I’m ADHD so everyone thinked that I'm just bad, spoiled child. He was punishing me, really hard, in many different ways, and I was resisting. Every day, every second. Each time he give me a punishment, I was pushing him to the edge, so when he moved from spanking to something that is not leaving marks - making me to do squats, I was doing much more, that he told me at the beginning, because I've done everything to piss him off, and make him to increase. My record was 2500 squats in around 2 hours, when he started giving punishment he just ask me to do 100.I was doing this, because I felt lied. He maked me to cut off from my dad, promising me that he will be moving y friend, and then he started to go into role of my new dad. My mom wasn't doing much to end this, just closing in the kitchen, and sometimes just asking him to stop, because she’s too tired. She also had additional reasons she told me recently,  and I understand them, and she have my forgiveness for everything that happened. This all made, that between sixth and seventh grade, from wonder kid, second in the city in the math and physicist, winning in multiple national science competitions, and starting to have first sport achievements even when I was still very small (and I'm not much taller now), from wonder kid, that won in two contests in television, who was reading everything, and soaking up knowledge from every source, from wonder kid who was dreaming about being neurobiologist, or medical doctor, or genecist, or a jockey because I was riding horses like I was born in the saddle, I started to be a kid who was not able to do anything at school. And mostly, who was not able to be part of the group. I was creative before, being able to think about 10 different things to do, and even without having possibilities to do them right, I was able to find a method to do them done. Later, I was using my creativity to impress other kids. Making smokescreens, nitroglicerin, and finding a way to shortcut fuse, so we have longer midlesson break.2 years later I've finally made him to leave my mom. He was not able to deal with me anymore. And my mom, angry, lonely, with debts, and not being able to look optimistic in the future, started to make me feel responsible for it.  I was abused kid, that needed acceptance, caring, and assurance, that I'm skilled, gifted, and able to do everything I want, in short: I needed love. Be ut instead, she made me thinking, that I'm useless burden she need to carry on. She was telling me, that now she have nothing left to live for, that she never find another man, because nobody will be with woman with child like me. And she was started to repeating, that someday she will commit suicide, and I see then, how live can be hard. Once I was so frustrated, that I replied, that I'm OK with that, but first she need to make sure, that all animals she had at our home have proper caretakers, because I'll kill myself too. And I let her alone until uwithout any sign of life for 2 days, and this was the most ugly, sadistic, and fucked off thing I've done in my life. But I was really on the edge of hurting myself.So before I was a kid that knew he can do anything he want, he was passionate about lot of thing, who knew he is brilliant, thinking out of a box, and everything is in his reach. And few years later I was angry, aggresive and rebel teen, going to high school for kids that were not able to fit anywhere else. It was also first time, that I was trying mental therapy, to regain my self-esteem, and to make me know, why I cannot be like other kids. And it not worked. And few days ago I've learned, that there was no way to work I left high school after 3 years. I was bored, not learning anything new, and I preferred to go to internet cafe, and learn something useful, instead of dealing with teachers that sometimes knew less then me. Instead of something useful I found something cool, illegal and useful in different way: a way to recharge paycards for public phone system that we had in Poland. Around 0,5km from my home, was the biggest bazaar in east Europe, made on old stadium. Lot of people from Vietnam, India, Pakistan, Armenia, Russia, Ukraine, etc. was making business there, and contacting their families in their countries.There was demand, and I have a way, so I've provided supply. So when I was 17-19, I was making more money, that I'm doing right now. I had whole \"enterprise\" - people who was collecting used card for me, distributors from each country, that were delivering cards to their own, and each month I made around $8K. And never felt bad about it. I helped people, and I was fighting the system, because nobody liked our national communication company. Later, I've moved out from my mom, trying to start living on my own. And was throw in jail for first time. I left after 40 days, but in next years I was doing the same loop: Going to work, started to being pissed of incompetent people, throwing work, spending last bits of money, doing scams, and hacks, being caught, spending some time in prison, and going out to start over.I've go out last time from prison in December 2010 after 3 years and 2 months, and after some experimental artistic therapy there I still did not knew, what's wrong with me but I've believed in myself, and started to think, that maybe I'm really able to do anything I want in my life. It was hard, there was better days, and there was days, when I was thinking for hours, that maybe I should start commiting crimes again. And trust me, it was really, fucking hard for me, to keep it under control, because my first customer, who is with me until now, since mid 2011 was a small company that was delivering computer systems for loan company. I could easily made this system tricked to give me huge amount of money on any bank account as loans, then remove any trail from it. It was easy way, but I was still believing, that I'm able to do it proper way. And in next years I've made some real achievements:- I've paid all my debts, including returning all money I was made from my crimes- I've started my own company- I was in the ranking of most influential polish blogs- I was one of 3 nominee in the \"Text of the year\" competition made by one of the biggest polish online publisher, but I've lost. And win at the same time - Jury decided that I win, but before event, I've wrote post on facebook, criticizing some decisions, that allowed commercial video to be one of nominee. I've made right thing, and even when I was watching like someone else is taking my reward, I was feeling like real winner.- I was mentioned in few smaller internet rankings as young entepreneur, influencer, etc.- I was founder of biggest polish conference about Twitter, and of Twitter meetings- I learned photography, and started to be really good at it (And one thing from last days - I was asked by contest site, when I'm sometimes publishing pictures, that they invite me as one of 10 best photographers using their site to their cooperation with Displate - company that is making prints on metal plates, and they want to sell 3 of my pictures there with 50% profit for me)- I've finally started to like people, and even when I was very straightforward, I usually was the person that people want at parties, and who is popular and liked.- I was speaker on one conference, and week later on TEDx. I was making speech about teaching IT in prisons, as a way to reduce recidivism. I never was on stage before, but I ask my friend who is making public speech lessons, to help me with it. And it was funny, because I've asked him in May that he could help me with learning how to speak from stage, he told me, that he do it gladly, and he is so afraid, that I'm not asked him 2-3 months ago, because he would put me on TEDx stage in October, but now we don't have time for it anymore. So I filled call for papers for some conference, forget about it, and one week before it, I get info that they accepted my application. I wasn't prepared, I have not presentation, I never trained my speech, and I had only one week. I called my friend, who is the same sarcastic bitch like I am, and started with: \"Hi Kamil, I never thinked that I ever do it, so you can now start enjoying yourself: Kamil, I need your help. OK, you can stop enjoying, now it's a hard part\". He told me, that he will came for one hour at saturday, and I need to make presentation until then, and train it 2-3 times. He stayed for 4 hours, throw away half of slides, rearranged them in different order, and asked me to speak on TEDx 2 weeks later.- I’ve started working remotely for US-based company, with multicultural team. It was very hard time for me - I had customer from Poland, analytics company, doing big data, who did not pay me for last 2 months. I was pissed off, I was hungry, and I was tired. My friend  Maciej asked me 2 days after my struggle with them for payment if I'm not looking for some customers, because he is moving from here to different company. I was uncertain, that I'm able to do so, because my english was so poor that days. My wife was worried, that I will work too much, and it will be similar to the company that just scam me out. And It was always chaotic there, but for first years it was a real interesting. I liked being hero, that was keeping things in order, that was repairing everything, and who was always available. I liked many things there, because I really did not have personal life. My marriage was a mistake, so I was throwing myself into work. And I was improving everything I could. And I was inventing. And I was developing rather than maintaining. Introducing new solutions, and making things better. And then I left my wife and suddenly Karolina  happened to me. And I started to see a lot of little things, that I was missing from the picture:- That I'm communicate with CEO a lot, but usually it looks like I'm writing at my evening, and his morning, and he was replying at 3-4 AM my time. I liked to worked at night before, but now I preferred to sleep with girlfriend in one bed. And it was disrupted a lot of times.- That I'm signaling potential problems, asking for help, and everybody agrees, but nobody helps, and we are making everything more, and more, and more unstable, and number of alerts is rising, number of wakings in the very early morning is rising, and I'm starting to be frustrated, because I cannot do anything with it. And I'm started to losing my self-esteem, my faith in myself, because I CANNOT DO ANYTHING. - That I've decided to travel to Tokyo, just to talked with him, try to decribe everything from my perspective and make a list of priorities. We talked a lot. We've decided a lot things, and they never happened. I travel there to try to finally make things right, and it was useless. Also, we agreed that I pay half of travel expenses, because I will also stay there for vacation, but it was time, when critical part of app were constantly failing, and I was working all time. No vacation for me, and pissed off Karolina, that was feeling lost and lonely, great time indeed, burned out money, and motivation for no action.- That we've been talking later lot on Slack about potential solutions, new storage engines, new technologies, but still we have the same old problem - very outdated stack, that should be replaced.- So I've travelled to Toronto few months later, just to try the same thing with him and our lead programmer, so maybe we find out solution to our problems. And again, we've agreed that we need to act, but we've never acted. And I throw my personal money for this travel in times, when I have severe financial problems because of tax office and divorce, but at least I had vacation. Kind of. Because we were dealing with the  same part of app again and I was trying to talk with one of new programmers to convince him to stay with us, because he could be solution for our problems. - That we've been burning A LOT OF MONEY on keeping our technical debts alive. And it's really something, we could stop after tokyo, halting developing new features for three months. Then with clean slate, without recurring problems that are frustrating everyone, and with money for new SKILLED devs, we could speed everything up. And I was telling this in Tokyo, at the end of the meeting, but he attention and was bored.- And at January I've collapsed first time. I had a kitten, and after accident he needed surgery of his jaw. It was 50% chances that he will have whole-body infection, and he die. After surgery he was going to my bed, and sleeping close to me, so I've almost not slept. In one week, I've slept 16 hours, and when he woked me with disrupted sewing, bleeding and with dirt on his wound, I've started to act as I'm always acting during emergencies. I was ruthless, but effective, as always. I’ve cleaned wound, and I wasn’t reacting when cat communicated that he is pain and fear. Then I was opened my first aid kit, make him secure, by covering the wound, noted to myself that my first aid kit is useless, and I need real one (bought week later), put him in the bag with pillow and some herbs to make him feel calm, and when I sat for a moment, I was not able to do anything in next 15 minutes. I wasn't able to make a decision what next I need to do. I was just overthinking. When I finally went to bathroom to take a shower, my Apple Watch told me that my pulse is 180 per minute, and I should go to bed. I've passed out the second I throw myself on bed. 20 minutes later I was kinda OK.And it was first time, when I was acting like this. But not only - in next months I suspended like this 2 times. Shorter, for 3 and 5 minutes.My cat did not make it, and week later he was trying to hide, and throw 8kg of magazines of our friend who lived with us on himself. I'm aware that he was under them alive for almost 2 hours, slowly dying. And it was one thing, that also made my next months a hell. But in the end, I finally have proper diagnosis, that is making me aware why I'm acting different then other people. Because I never knew what really is wrong with me. But I had 3 wrong diagnosis in my life. I was very lucky that my dog was trying to stop my attempt to kill myself in the 1/3 of pills asking for a walk, and made me to go for last walk with him. He acted so crazy there, that he make me smile for a first time in many weeks, and I forced myself to vomit. And later I was also very lucky that my friend and coworker Karol invited us to his wedding. It was last moment to me and Karolina to fight for our relationship. And after 16 hours of talking we identified why I'm feeling unsafe in my own home. And now I'm very lucky, that I have great therapist, who is actually capable and understanding. I'm not on therapy yet, it's still 2 diagnostic meetings before it, but she showed me a bunch of tools, that allow me to work on my feelings, on my emotions, and learn what really is going on with me, and my surroundings.Thanks to anyone, who was really patient to read this. I’m glad that I’ve found  finally large group of people thinking like myself :)"
    },
    {
        "name": "t3_cp1j8q",
        "created": 1565582384.0,
        "ups": 5,
        "downs": 0,
        "title": "27 years of fucked up life, 8 of pretty great, than everything collapsed. Finally diagnosed with ADHD, and I have hope again.",
        "selftext": "So my diagnosis finally came on Friday, and now I finally know why I think and do things in different way than other people, and I’m trying to start seeing this as personal trait, not as disorder. I want to share my story, mostly to compare some stuff with you guys, so I will have some paradigm here.I was brilliant kid. I learn to read when I was 4, and to write half year later. When I was starting school it was very crazy time in Poland. We've regained independence from Soviet Union, dropped communism, and started capitalism.  My mother was trying to send me to french school near our home, because she thinked, that their education system is much better for kid like me, but she hit the budget barrier. So I went to normal school with normal kids. At the beginning of elementary school teachers wanted to move me 2 classes up, because they thinked that it will allow me to use my potential. And my mother decided not to, because I was very small kid, smallest one in my current class, so she was afraid that older kids will not accept me. What can I say - the kids in my age did not accepted me either, so I was outsider for next years. My father is now 80. I'm 36. It's huge age difference, so we never had great connection. Also until I was 10, he was alcoholic, coming to home drunk often. But it was only time, when he was able to give me some attention, so I preferred to see him that way. He stopped drinking, when my mother demanded it, telling that if he not then she will divorce him. It was quick decision, and he was not drinking for next 25 years (unfortunately, he started one year ago, on my niece wedding), showing his strength and determination. When I was 12, and my grandfather died, our family decided, that I'll move to countryside, where I’ll live with my father, and try to rebuild our relation. My mom stayed in Warsaw to take care of her business, and her college (but she never finished it). Few months later she came with her new partner to take me back to Warsaw.I liked him a lot. Cool, progressive, with car and knowledge about things that were interesting to me. He told me, that he will never try to replace my dad, that I have my own dad, and he always want to be my friend and support me. He was a role model for me, I wanted to be like him a much. He was caring, and I was thinking that he really love my mom, and at the beginning I looked at him like ideal man. I was dreaming that I'll study physics like him, that I have beard like him, and this great trait of affecting people emotions with deep voice. He was here, to talk with me when I needed, not my dad. He was making pancakes every weekend, not my dad. He was explaining, that there is nothing wrong in naked body, and I don't need to be shy on the swimming pool and hide to change clothes. Unfortunately, he also told me that I should be ashamed of MY BODY, because I was a *little* overweight that time.And wrong things started to happen soon: He started to punish me for little mistakes, he stand over me and controlled if I'm doing things the way he want, without allowing me to use my way to get to result (and usually I did not knew why I'm doing things in the particular way, but I knew somehow that it's way allowing me to success). He started to abuse me mentally, calling me an idiot, moron, because even when I was able to deliver proper solution, I was not able to deliver method etc. And next years were hell. There was no diagnostic methods allowing to tell that I'm ADHD so everyone thinked that I'm just bad, spoiled child. He was punishing me, really hard, in many different ways, and I was resisting. Every day, for almost 3 years. Each time when he gave me a punishment, I was pushing him to the edge, so when he stopped spanking and switched to something that is not leaving marks - making me to do squats, I was doing much more, that he told me at the beginning, because I've done everything to piss him off, and make him to increase. My record was 2500 squats in around 2 hours, when we started from 100.I was doing this, because I felt lied. He maked me to cut off from my dad, promising me that he will be my friend, and then he started to go into role of my new dad. My mom wasn't doing much to end this, because of her reasons (and I'm understanding them and I've forgive her). This all made, that between sixth and seventh grade, from wonder kid, second in the capital city of Poland in the math and physics, winning in multiple national science competitions, and starting to have first sport achievements even when I was still very small (and I'm not much taller now), from wonder kid, that won in two contests in television, who was reading everything, and soaking up knowledge from every source, from wonder kid who was dreaming about being neurobiologist, or medical doctor, or genecist, or a jockey because I was riding horses like I was born in the saddle, I started to be a kid who was not able to do anything at school. And mostly, who was not able to be part of the group. I was creative before, being able to think about 10 different things to do, and even without having possibilities to do them right, I was able to find a method to do them done. Later, I was using my creativity to impress other kids. Making smokescreens, nitroglicerin, or just finding a way to shortcut particular fuse, so we have longer midlesson break.2 years later I've finally made him to leave my mom. He was not able to deal with me anymore. And my mom, angry, lonely, with debts, and not being able to look optimistic in the future, started to make me feel responsible for it.  I was abused kid, that needed acceptance, caring, and assurance, that I'm skilled, gifted, and able to do everything I want, but instead, she made me thinking, that I'm useless burden she need to carry on. She was telling me, that now she have nothing left to live for, that she never find another man, because nobody will be with woman with child like me. And she was started to repeating, that someday she will commit suicide, and I see then, how live can be hard. Once I was so frustrated, that I replied, that I'm OK with that, but first she need to make sure, that all animals she had at our home have proper caretakers, because I'll kill myself too. And I let her without any sign of life for 2 days, and this was the most ugly, sadistic, and fucked off thing I've done in my life. But I was really on the edge of hurting myself. So before I was a kid that knew he can do anything he want, he was passionate about lot of thing, who knew he is brilliant, thinking out of a box, and everything is in his reach. And few years later I was angry, aggresive and rebel teen, going to high school for kids that were not able to fit anywhere else. It was also first time, that I was on group therapy for ODD. I hoped that I regain my self-esteem, and they make me know, why I cannot be like other kids. And it not worked. And few days ago I've learned, that there was no way to work, because group therapy is the opposite of what I really needed. I left high school after 3 years. I was bored, not learning anything new, and I preferred to go to internet cafe, and learn something useful, instead of dealing with teachers that sometimes knew less then me. Instead of something useful I found something cool, illegal and useful in different way: a way to recharge paycards for public phone system that we had in Poland. Around 0,5km from my home, was the biggest bazaar in east Europe, made on old stadium. Lot of people from Vietnam, India, Pakistan, Armenia, Russia, Ukraine, etc. was making business there, and contacting their families in their countries. There was demand, and I have a way, so I've provided supply. So when I was 17-19, I was making more money, that I'm doing right now. I had whole \"enterprise\" - people who was collecting used card for me, distributors from each country, that were delivering cards to their own, and each month I made around $8K. And never felt bad about it. I helped people, and I was fighting the system, because nobody liked our national communication company. Later, I've moved out from my mom, trying to start living on my own. And was throw in jail for first time. I left after 40 days, but in next years I was doing the same loop: Going to work, started to being pissed of incompetent people, throwing work, spending last bits of money, doing scams, and hacks, being caught, spending some time in prison, and going out to start over.I've go out last time from prison in December 2010 after 3 years and 2 months, and after some experimental artistic therapy there I still did not knew, what's wrong with me but I've believed in myself, and started to think, that maybe I'm really able to do anything I want in my life. It was hard, there was better days, and there was days, when I was thinking for hours, that maybe I should start commiting crimes again. And trust me, it was really, fucking hard for me, to keep it under control, because my first customer, who is with me until now, since mid 2011 was a small company that was delivering computer systems for loan company. I could easily made this system tricked to give me huge amount of money on any bank account as loans, then remove any trail from it. It was easy way, but I was still believing, that I'm able to do it proper way. And in next years I've made some real achievements, and were able to convince myself, that I don’t need a therapy:- I've paid all my debts, including returning all money I was made from my crimes- I've started my own company- I was in the ranking of most influential polish bloggers- I was one of 3 nominee in the \"Text of the year\" competition made by one of the biggest polish online publisher, but I've lost. And win at the same time - Jury decided that I should win, but before event, I've wrote post on facebook, criticizing some decisions, that allowed commercial video to be one of nominee in “Video of the year” category. I've made right thing, and even when I was watching that someone else is taking my reward, I was feeling like real winner.- I was mentioned in few smaller internet rankings as young entepreneur, influencer, etc.- I was founder of biggest polish conference about Twitter, and of Twitter meetings- I learned photography, and started to be really good at it (And one thing from last days - I was asked by contest site, when I'm sometimes publishing pictures, that they invite me as one of 10 best photographers using their site to their cooperation with Displate - company that is making prints on metal plates, and they want to sell 3 of my pictures there with 50% profit for me)- I was speaker on one conference, and week later on TEDx. I was making speech about teaching IT in prisons, as a way to reduce recidivism. I never was on stage before, but I ask my friend who is making public speech lessons, to help me with it. And it was funny, because I've asked him in May that he could help me with learning how to speak from stage, he told me, that he do it gladly, and he is so afraid, that I'm not asked him 2-3 months ago, because he would put me on TEDx stage in October, but now we don't have time for it anymore. So I filled call for papers for some conference, forget about it, and one week before it, I get info that they accepted my application. I wasn't prepared, I have not presentation, I never trained my speech, and I had only one week. I called my friend, who is the same sarcastic bitch like I am, and started with: \"Hi Kamil, I never thinked that I ever do it, so you can now start enjoying yourself: Kamil, I need your help. OK, you can stop enjoying, now it's a hard part\". He told me, that he will came for one hour at saturday, and I need to make presentation until then, and train it 2-3 times. He stayed for 4 hours, throw away half of slides, rearranged them in different order, and asked me to speak on TEDx 2 weeks later.- And I've started working for US based company as sysadmin and stayed there fore more than five years until today. It was very hard time for me - I had customer from Poland, also analytics company, doing big data, who did not pay me for last 2 months. I was pissed off, I was hungry, and I was tired. Maciej asked me 2 days after my struggle with them for payment if I'm not looking for some customers, because he is moving from here to different company. I was uncertain, that I'm able to do so, because my english was so poor that days. My wife was worried, that I will work too much, and it will be similar to the company that just scam me out.  And It was always very chaotic there, but for first years it was a real interesting. I liked being a team hero, who was keeping things in order, who was repairing everything, and who was always available. I liked very how things are done t here, because I really did not have personal life. My marriage was a mistake, so I was throwing myself into work. And I was improving everything I could. And I was inventing. And I was developing rather than maintaining. Introducing new solutions, and making things better. And then my girlfriend Karolina happened to me. And I started to see a lot of little things, that I was missing from the picture:- That I'm communicate with a CEO a lot, but usually it looks like I'm writing at my evening, and his morning, and he is are replying at 3-4 AM my time. I liked to worked at night before, but now I preferred to sleep with my girlfriend in one bed. And it was disrupted often.- That I'm signaling potential problems, asking for help, and everybody agrees, but nobody helps, and we are making everything more, and more, and more unstable, and number of alerts is rising, number of wakings in the very early morning is rising, and I'm starting to be frustrated, because I cannot do anything with it. And I'm started to losing my self-esteem, my faith in myself, because I CANNOT DO ANYTHING. - That I've decided to travel to Tokyo, just to talked with CEO, try to decribe everything from my perspective and make a list of priorities. We talked a lot. We've decided a lot things, and they never happened. I travel there to try to finally make things right, and it was useless. Also, we agreed that I pay half of travel expenses, because I will also stay there for vacation, but it was time, when part of infrastructure were constantly failing up, and I was working all time. No vacation for me, and pissed off Karolina, that was feeling lost and lonely, great time indeed, burned out money, and motivation for no action.- That we've been talking later lot on Slack about potential solutions, new storage engines, new technologies, but still we have the same old problem - very outdated stack, that should be replaced.- So I've travelled to Toronto few months later, just to try the same thing with CEO and main developer, so maybe we find out solution to our problems. And again, we've agreed that we need to act, but we've never acted. And I throw my personal money for this travel in times, when I have severe financial problems because of tax office and divorce, but at least I had vacation. Kind of. Because we were dealing with the same part of infrastructure again and I was trying to talked with another developer that decided to quit to stay with us, because I knew, that he could be solution for our problems. At January I've collapsed first time. I had a kitten, and after accident he needed surgery of his jaw. It was 50% chances that he will have whole-body infection, and he die. After surgery he was going to my bed, and sleeping close to me, so I've almost not slept. In one week, I've slept 16 hours, and when he woked me with disrupted sewing, bleeding and with dirt on his wound, I've started to act as I'm always acting during emergencies. I was ruthless, but effective, as always. Cleaned wound and it was not relevant to me, that I can make him suffering from pain and fear. Then I was opened my first aid kit, make him secure, by covering the wound, noted to myself that my first aid kit is useless, and I need real one, put him in the bag with pillow and some herbs to make him feel calm, and when I sat for a moment, I was not able to do anything in next 15 minutes. I wasn't able to make a decision what next I need to do. I was just overthinking. When I finally went to bathroom to take a shower, my Apple Watch told me that my pulse is 180 per minute, and I should go to bed. I've passed out the second I throw myself on bed. 20 minutes later I was kinda OK. My cat did not make it, and week later he was trying to hide, and throw 8kg of magazines of our friend who lived with us on himself. I'm aware that he was under them alive for almost 2 hours, slowly dying. And it was one thing, that also made my next months a hell. But in the end, I finally have proper diagnosis, that is making me aware why I'm acting different then other people. Because I never knew what really is wrong with me. There was no diagnostic tools, and methods until recently, when scientists started to talk about ADHD not only in the case of children, but also in adults. I was very lucky, that my dog interrupted my attempt to kill myself in the 1/3 of pills asking for a walk, and made me to go for last walk with him. He acted so crazy there, that he make me smile for a first time in many weeks, and I forced myself to vomit. And later I was also very lucky that my friend and business partner invited us to his wedding. It was last moment to me and Karolina to fight for our relationship. And after 16 hours of talking we identified why I'm feeling unsafe in my own home. And now I'm very lucky, that I have great therapist, who is actually capable and understanding. I'm not on therapy yet, just finished diagnosis but she showed me a bunch of tools, that allow me to work on my feelings, on my emotions, and learn what really is wrong in my surrounding, and identify issues."
    },
    {
        "name": "t3_crdag5",
        "created": 1566022096.0,
        "ups": 1,
        "downs": 0,
        "title": "Lost. Considering paying for an official ADHD diagnosis.",
        "selftext": "Hey everyone, it's my first time posting here. For the longest time in my life I've felt I've had ADHD and show many symptoms of it. I grew up in India and lets just say it was never even thought of as a possible thing I had, I was just lazy and what not. I moved to Canada at 18 for university and have struggled greatly. Today, a counselor at my university (we have a wellness centre) did the preliminary assessment of ADHD on my insistence. She said I scored within the clinical ranges in 4 out of the 5 clusters. I actually cried in front of her because I felt I could finally explain what was wrong with me, I wasn't lazy or stupid but actually suffering. Now the hard part. An official diagnosis and assessment requires a $800-1000 charge and as a student I can not afford that. I don't know what to do about it. My parents won't pay for it since they don't believe in stuff like that. I finally felt like I had figured something out and could get the required help, but with just an initial assessment and no official diagnosis, there is no way to prove I actually had ADHD so I can't avail any help from university resources or get any passive/ active medication to help me. I'm just lost and any words of kindness or advice would be appreciated."
    },
    {
        "name": "t3_aamvn2",
        "created": 1546132257.0,
        "ups": 13,
        "downs": 0,
        "title": "I'm trying to collect a list of helpful articles and links to convince my parents to get checked for ADD",
        "selftext": "I'll skip describing all the symptoms and how everything overwhelmingly resonated with me when I first found this subreddit because I'm sure you guys have been through that dozens of times already.My parents are not uber-religious nor do they have anything against big pharma - my mom has a degree in psychology, in fact - so once I'm able to give them an idea of what ADHD is really like (as opposed to the stereotypical image of a hyperactive boy) I'm sure they themselves will want to take me to a professional to get some help.But right now, it's the same old thing - \"You're just lazy and want to make an excuse for it\", \"If you can focus on video games for 5 hours then you should be able to focus on your books\", \"You got 80+ in physics last term, how do you explain that?\", and, the one I hear from not only them but many of my teachers, friends, and relatives as well - \"You have so much potential, I wish you would exert more effort and try harder\".So I had an idea - I'm currently making a very detailed word document on ADHD with various aspects of it which are commonly misunderstood (and linked articles to follow them up), such as you don't always need medications for ADHD, ADHD doesn't mean you lack the ability to focus or get poor grades, and people with ADHD don't always have to show extreme hyperactivity all the time. And once I'm done I'll show it to them and tell them to go through it.So I'd love it if you guys shared any nice articles, videos, or reddit posts which you liked or think will be useful in giving my parents a reason to take me to a doctor. I currently get decent grades, so articles/posts by people who cruised through high school but later crashed in college due to ignoring their ADHD would be helpful, as well as stuff on what happens to such people if they leave their ADHD untreated till later in life. Also, they're constantly commenting on my absent-mindedness and lack of ability to follow instructions (how ironic), so I've got some links of reddit posts of people describing the exact things my parents do about me - always being careless and messy, [quickly becoming immersed in one hobby and then switching to another](https://www.reddit.com/r/ADHD/comments/aa17ht/jack_of_all_trades_master_of_none_disorder/ ), [always seem to argue](https://www.reddit.com/r/ADHD/comments/9yufvf/how_can_you_help_yourself_argue_less_with_others/) and [end up getting on the bad side of friends/coworkers for some reason due to coming off as an asshole](https://www.reddit.com/r/ADHD/comments/119tmg/does_anyone_else_find_it_a_constant_struggle_to/), etc. - this is some of the stuff they're *very* well aware of. Would love to see more, thanks!Edit: I live in India, so unfortunately seeing a school counselor or therapist is not an option since they are non-existent"
    },
    {
        "name": "t3_cajue6",
        "created": 1562614045.0,
        "ups": 2,
        "downs": 0,
        "title": "Got diagnosed today with ADD.(23M)",
        "selftext": "Had to go through a lot. People around me doesn't know or doesn't give a s**t about mental illness. \"You have it?, Why don't you just go die.\" This was the attitude shown to my Schizophrenic mother. This made me fear getting diagnosed.This is not easy for someone from India. No provisions. No understanding. I hope this changes.Even the doctors are not very well aware of ADHD. I was first diagnosed with general anxiety and major depressive disorder. I had to take drugs which I didn't want because of this misdiagnosis., Or simply because my first doctor thought I would have been diagnosed in my childhood if I had ADHD. My parents were poor and I did my school rather well. They never even thought I had this and they may have thought I was like my mother, misbehaved and lazy.As I did my schooling pretty well, I opted for Medical school. I had to undertake entrance examination for this. Looking back I believe I had ADHD all along, and I am happy that I have come this far. My father died two years ago and it was not easy coping with grief with this.I believe being a medical student I had the resources to help me understand the problem and walk in the right path to get a diagnosis.This will not be easy for everyone here. Most in my country will be seen only as lazy and unworthy for having a brain on which they have no control of."
    },
    {
        "name": "t3_9r22j7",
        "created": 1540432960.0,
        "ups": 18,
        "downs": 0,
        "title": "I think I want an ADHD diagnosis because it would finally be an answer to the problems that have unraveled my life during these past years...",
        "selftext": "Depression, anxiety, not being able to manage myself as an adult, not being able to clean, cook and organize, losing my mother, not knowing whether my symptoms are grief or an extension of what I've always had.Getting a diagnosis would mean finally having an answer to the behaviors and problems for which psychoanalytic therapy asked me to look inside myself. But no matter how hard I looked into my psyche, nothing could explain the mental disorganization. If I found a biological reason for that, it feels as if there would finally be a reason to hope. Everything I've read and heard so far about ADHD makes sense to me, resonates with me.Except diagnosis is where the journey would begin. Of finding the right meds, learning the skills...It's been really hard here in India finding a psychiatrist in India who knows anything about adult ADHD or is willing to look into it with an open mind. I have some leads that I'm going to explore this weekend. But I need to keep an open mind too. I don't want to be the person who believes they have a disorder even when they don't.**TLDR**: It feels as if getting an ADHD diagnosis would be an answer to all of the unexplained problems that are getting in the way of my journey as an adult. But the diagnosis would only be the beginning. I need to keep an open mind about the diagnosis going either way, even though I identify with most of the symptoms."
    },
    {
        "name": "t3_9o6flz",
        "created": 1539580410.0,
        "ups": 7,
        "downs": 0,
        "title": "How is ADHD diagnosed in adults?",
        "selftext": "Lately I've been having doubts that I might be dealing with adhd. I am unable to pay attention to tasks at hand, and when delivered there are obvious mistames that are overlooked. And this has been going on for a while. Also the place I live in, I doubt that I can find an expert who can correctly diagnose the problem. What should I do??Is it that I really am dealing with it or am I being paranoid over simply being a careless person ?"
    },
    {
        "name": "t3_2hikzd",
        "created": 1411755425.0,
        "ups": 9,
        "downs": 0,
        "title": "Where to get ADHD diagnosis &amp; treatment in India",
        "selftext": "My sincere thanks to reddit first. I don't even know there's a name for a problem I've facing since my school days. I'm 24, as a physically challenged and scoliosis sufferer I thought this is natural to get depression due to loneliness. Its not that I don't have parents or friends, it is something virtually I created a wall around myself. But lately it is growing to a devastating level that it affects every area of my life.* I cannot multitask or get an overview of my life. I get obsessed with something deep and few days later it its completely wiped off my head* I have created to-do lists a uncountable times but followed them maybe 0.01%* I am talking to myself almost completely. It is somewhat rare words come out of my mouth.* I can't self-motivate and don't know where I'm headed in this world.TL;DR Can anyone point me wherea to get treatment in India, most preferably Chennai, Tamil Nadu?"
    },
    {
        "name": "t3_b64v84",
        "created": 1553724193.0,
        "ups": 3,
        "downs": 0,
        "title": "Doctor dismissing me",
        "selftext": "Im 17 and in India , I just went to get tested for ADHD after having trouble with concentrating since forever but I've recently discovered that it could be ADHD when I could relate with the procrastination and feelings of guilt while doing it, and took a bunch of online tests. And by no means is that a diagnosis. But after telling the doctor how im struggling he said that everyone has trouble with concentrating, it's not ADHD if you don't show any symptoms in your childhood and he didn't take any tests whatsoever.  He just gave me a tablet to calm me or something. i feel really disheartened that he wouldn't even take me seriously. Idek what to do now, I feel lost and I wanna die. I thought I finally understood how my mind works and all the negativity that comes with it. But guess I'm just lazy and looking for something to blame. I wanna die.Please help me"
    },
    {
        "name": "t3_485x24",
        "created": 1456724725.0,
        "ups": 1,
        "downs": 0,
        "title": "Anyone from [India] here?",
        "selftext": "I'm almost certain I have between mild to severe ADHD. Almost every symptom of it is present in me. I wasn't always this messed up but lately it's gotten really bad and I'm slipping into depression as well thanks to a lot of shit going on with life. If really like a professional to deal with this, can anybody help? I live in New Delhi. Thanks a bunch in advance!"
    },
    {
        "name": "t3_bsun95",
        "created": 1558820638.0,
        "ups": 1,
        "downs": 0,
        "title": "Can't handle the side effects of meds",
        "selftext": "So I'm from India and I've been taking Attentrol (atomoxetine) which I think is the equivalent of straterra here. I started with 10mg, took it for about a week then switched to 18 mg and I've been taking it for about 2 weeks. I'm aware that this is a low dosage and it takes a while to experience improvements. However the side effects are brutal. I have constant headaches and feel tired. I just lie down after taking the meds. I'm barely functional. After taking it in the morning I feel miserable until 6 in the evening when it eventually wears out. I don't know if I should continue taking them cause even if my concentration gets better with a higher dosage I'm pretty sure the side effects will also worsen.I tried stimulants (amphetamine) before this and they sorta helped me for a while but made me anxious and also caused fatigue. My doc told me I don't have any other options in terms of meds so I should continue taking my current medication and see how it goes.I just want to be able to concentrate and finish college. I don't know what to do. Could use some advice from you guys."
    },
    {
        "name": "t3_boh6nm",
        "created": 1557858782.0,
        "ups": 5,
        "downs": 0,
        "title": "Need advice with helping my abused younger first cousin who has been diagnosed with ADHD (by an actual psychologist) but refuses to take any medical aid (be it therapy/counselling or medications) on account of his parents cultish beliefs.",
        "selftext": "Ok, so this is from India. Its a story of how cults can destroy lives, in this case, my young cousin's. I have a first cousin whom I long suspected to have some form of learning disability (since I have ADD, I noticed a lot of similar errors that I make). He is the son of my paternal uncle, a person who has been involved with a growing neo-Hinduist cult, which relies on hypnotic meditation to lure people in. But it is a cult since any questionings of the Master (that's literally what they call their 'spiritual, proxy God' leader) are met with logically falsified statements, and the cult members are preyed on for money.Anyways, so according to this cult everything mentally incorrect can be cured by meditating (in the ritualistic manner that they train you to). You can kind of see where this is going, and the more you meditate the better it will be. And if it's not helping then you're just not doing it right.Nevertheless, this cousin of mine, who's about 17 now, was grown in the cultish environment. His house is filled with icons and idols of their 'Master', the proxy God. They pray to this living man. The meditation is just a way to connect to the Master who transmits divine spirituality to all who meditate, by paying him. Anyways, this child has a very twisted worldview as he grows up. Later on, when I reconnected with him a few years ago and started questioning his cultish ideas. He soon started to wake up from the slumber. He always was very smart to talk to, and even could understand things conversationally but never did it translate to his grades. In trying to help I kept exposing him to basic tenets of rational thinking and reasoning. But when he started questioning his father's cult, he was told that I have poisoned his mind, instead of answering his questions. Also, I forgot to mention his father was quite abusive even during his formative years (preteens and teenage). So out of his fear he reduced contact with me.Trying to piece everything together I thought of taking him to a psychologist and letting a professional help him. So one fine day, with his approval, since even he admitted to a need for professional help at the time, we went to psychologist nearby without telling anyone (since India is a more traditional or conservative country mental health issues are often looked down upon by healthy members of society). After the meeting my cousin was stunned. It's almost as if for the first time everything made sense in his head, and he was in a very good mood, and emotional. He then revealed to me for the first time that he was physically abused by his father from a very young age (which is why he was always so afraid to question his father). Luckily, that day itself the doctor had prescribed him some medication, we both had high spirits that day. He told me that he will finally tell his father before taking any medication (which is not ideal but given his suffering I sympathized).Next week when I called him to see how he was doing, I see that his tone, perspective attitude towards self-help, medications, etc everything had changed. He suddenly started talking like his father and saying that meditation (his father's cult's shitty version) is a better option than proven medication and therapy.I told him that I understand the aversion to medication, but he should at least start counseling or therapy. Which apparently his father instead convinced him to take more of their meditation BS. All his development in rational thinking was gone all of a sudden. He was openly and admittingly being ignorant. He even went so far as to say that 'even if all that I'm doing is completely wrong I'll still do it.'It's been a year since and he hasn't made any progress, and is most likely going to fail miserably in his high school exams and future career. I understand that some people are able to handle ADHD without medication or therapy, but that's not the case here.Now he won't even speak to me regarding anything even remotely close to ADHD. Avoiding it always, and threatening to break communication whenever I do bring it up. His family has set him up to fail, but he's either too brainwashed, scared or powerless to do anything about it.India doesn't even have something similar child support services, who can intervene in a clear case of parental negligence of their child's mental health. Any ideas to help this poor unfortunate child?TL;DR: My paternal uncle physically abused his son since a young age and is deeply involved in a neo-Hindu cult. As a result of these superstitious beliefs his son, my younger cousin, can't treat his ADHD. I tried once and came close to helping his ADHD but failed. Posting it here to get some outside perspective."
    },
    {
        "name": "t3_9dwrhw",
        "created": 1536371489.0,
        "ups": 4,
        "downs": 0,
        "title": "Any indian out here?",
        "selftext": "Sorry, for this country specifications but only we know the state of mental health awareness here. I first talked to a therapist, she said I have ADHD but as she was a psychologist and not a psychiatrist she recommended mindfulness and not medication. To get a second opinion I went to the best mental health institute in the country to consult a psychiatrist. Now, to my dismay, I went to one of the \"elite universities\" of India whose students are considered \" geniuses\" or whatever and when the doctor came to know of this she said \" it's nothing, try to focus more and there is no medicine for improving attention\". I am now fucking confused about it. Does anyone have any suggestion? On that note, what do medicines like aderall or ritalin for then?"
    },
    {
        "name": "t3_9pwqrs",
        "created": 1540090679.0,
        "ups": 3,
        "downs": 0,
        "title": "Feeling ambivalent about what happened at doctor's appointment today. Do I need to see someone else?",
        "selftext": "I am located in India and it has been really hard trying to find someone who can assess me for ADHD. I lived in the US for three years as a student from 2014-17 and was diagnosed with depression and anxiety there but not for ADHD. However, I really had a hard time completing my degree and in retrospect, my problems may have had to do with ADHD.Anyway, I went to this psychiatrist today who was recommended by a mental health activist acquaintance. First I was shown to a psychologist (even though I have just started seeing another one) who seemed very young and inexperienced. She kept asking me these very textbook questions about my symptoms (\"So you said you have depression? That means you must have experienced the symptoms for more than a two-week period?\"). Then I had to wait some more while she briefed the psychiatrist about me. (Is this person too self-important to be briefed by the patient directly? What's with the Chinese Whispers?). I told him I had come to him because I needed someone to rule out ADHD or make a differential diagnosis with the depression. He said that after hearing about my symptoms he thought someone like me was more bound to have OCD. I literally have no OCD symptoms apart from thoughts that maybe my father will die in his sleep too after it happened to my mom last year and constantly fidgeting with my nails. Whereas I have so many ADHD symptoms: not being able to focus on passion projects, not meeting deadlines, not being able to clean, burning out easily, getting distracted while talking with people if I'm in a place with a lot of stimuli etc. He told me to come back again and two other people from his team--a psychiatrist and a psychologist--will see me, and it will cost 2x as much as today's appointment did, even though I didn't learn anything today about my symptoms. He said there was a \"continental difference\" between ADHD diagnosis between USA and the UK--the US being more likely to diagnose people with ADHD--and he follows the UK school of thought. I don't know what's worse, overdiagnosing people with ADHD or not being open to diagnosing someone because of an ideological difference. I don't think I will be going back. I think he's using me as a guinea pig to train his team at the hospital where he works, which is why he wants me to see the two other people from his team. Why can't he and the psychologist I met today diagnose me? Why do I need four people to diagnose me?I am at the end of my tether about this. I am starting a new job soon and I want to succeed and not burn out. I wish I were still in the US so I could see someone more capable of diagnosing me or ruling out the possibility of ADHD. I feel so discouraged.Edit: grammar &amp; spelling"
    },
    {
        "name": "t3_ap2uz6",
        "created": 1549823870.0,
        "ups": 1,
        "downs": 0,
        "title": "ADHD and cooking",
        "selftext": "I’ve recently started taking a serious interest in cooking. I live in India but also like to cook Italian and Thai food. I go to a specialty market which is a 50 min drive away every week or every other week because even simple things like fresh rosemary and parsley are not available in a market close to me (Indians don’t cook with those herbs). However, sometimes I’ll buy a whole bunch of things and plans for dishes I’ll prepare during the work week, but when the week comes I’m too tired and end up making something really simple instead. Often, the ingredients I bought go waste. I feel very guilty because of this. I hate food wastage. I wonder if people had any suggestions so I could foray into new dishes but also not buy more things than I need while grocery shopping. I also cook for one so that makes things a little harder.TL;DR: I’m foraying into new cuisines and go to a specialty market 50 min from where I live to buy ingredients, but these often go waste because I’m too tired to cook something new and experimental during the work week."
    },
    {
        "name": "t3_66yltl",
        "created": 1492926587.0,
        "ups": 21,
        "downs": 0,
        "title": "Day one with Adderall",
        "selftext": "I was diagnosed with ADHD (again) on Tuesday and waited until the weekend to start medication.  Today being Saturday was my first day and holy cows in India this is wonderful.  I feel so clear headed.  Today I cleaned a room and my car.  I went to the gas station and got everything done I needed to with checking a list.  Also, (ok, mostly) I played Overwatch well.  I play Overwatch a lot on my weekends but I'm usually terrible (turrible?). Today I kick so much ass my foot is sore.I'm not fidgeting either. I stood in one place and stared at tree for minutes without moving anything.  Human statue style.All that being said, the clarity in my head is probably the feeling of all.  I haven't had a meaningful conversation with someone yet. But I am hoping that I am not mumbling and mixing up words or just forgetting the one I'm looking for.This is pretty wonderful.PS.  I proof read this before sending it.  "
    },
    {
        "name": "t3_8rkptd",
        "created": 1529197558.0,
        "ups": 7,
        "downs": 0,
        "title": "Meditation or Medication? From a 34-yr old who's struggled with ADHD through his life.",
        "selftext": "https://www.eurekalert.org/pub_releases/2018-06/vcu-sri061418.phpI saw this posted on /r/science and felt that meditation is a topic that is often overlooked in this subreddit. I am not a proponent of one method over another in coping with ADHD. But after having tried everything, I might finally have come to terms with ADHD.I realised that a lot of my disability in leading a 'normal' life and excelling in things that I know I should be good at was because of ADHD way late in my life. 28, to be precise. That is also because I am from India and ADHD especially in adults is not seen as an ailment, let alone a serious one.So I went for counselling, and got diagnosed and got a prescription for the Indian Adderall. It is a bitch to procure it even with a prescription.I went on a course of it for a little more than a month, but the medication worked if I have to sit and consume information -- reading books, understanding job briefs, going through presentations. It also made me a great listener as I could focus on conversations more intensely than I could before.But there were side effects too. I felt that some spontaneity in conversation (wit, especially) took a hit. It also affected creativity. Though I could sit at a task for hours, there was very little in terms of exciting ideas that I could come up with. It also affected my sex-life and my stamina during running. So I informed my doctor who told me that these are known side-effects and suggested that I could stop the course if I wanted.So I went back to behavioural therapy where I was suggested mindfulness meditation. And not just 5 to 10 minute meditation sessions, but a quick 10 seconds every now and then to bring your focus back to your emotions (which are usually running wild). This reduced my social anxiety and mood swings to a large extent.Today, I am entirely off medication for ADHD, and have a very productive daily routine which includes learning German, writing movie scripts (I have finished my second draft; which a few months ago had felt like an impossible task), working on my freelance work, and swimming.I use guided medication on Youtube (there are many, but [this](https://www.youtube.com/watch?v=CcqZ47d398k) is the one I use most frequently) to bring my focus towards work.I do routine tasks like doing dishes and watering plants so I get into a more productive frame of mind.I also started using this Sports Illustrated calendar where I mark my daily activities. I make a big red cross every day I have worked on my script. I got this from Jerry Seinfeld (can't find the link right now), and it is a beautiful feeling seeing this ribbon of red crosses running through the days.So the point of this post is that, there is a lot of posts here about getting diagnosed and being prescribed medications, but I am just putting it out there that maybe something else might work as well. Whatever it is, I hope these points help you in your life to cope with ADHD and its associated effects like stress, anxiety, etc.tl;dr There are a lot of posts about medication here. Mindfulness meditation and other meditation techniques are also incredibly helpful along with small unsubstantial tasks that would help you get into a productive mindset.Hope this helps you guys somehow. Have a nice day, everyone!"
    },
    {
        "name": "t3_8dkpdm",
        "created": 1524224964.0,
        "ups": 4,
        "downs": 0,
        "title": "Its not super ADHD related but i dont know who else to talk to this late at night",
        "selftext": "So my school is doing a musical and in it there is a song that always makes me tear up because I identify with it so much. So this girl is waiting for her father to show up to the spelling bee, and her mom is off in India for a 9 month \"spiritual retreat\". And in the song she is asking why her mom didn't take her with, and why she is always alone. My dad and mom divorced when I was a baby, I've seen my dad maybe 3 times in the last 10 years the most recent being at least 3 years ago. Ever since my younger brother was born my mom was too busy for me, he was in sports, he had good grades, he didn't have ADHD or anxiety that went ignored or undiagnosed, he is the perfect son. And so I had to learn to be independent since I was 8. And listening to the song makes me cry because I kind of resent my mom for not being there for me. I didn't get to go out much, I didn't get to play sports because we could never afford it, I didn't get enough attention or care that when I failed classes in middle and high school my mom only cared about grounding me and not asking why. Why wasn't I getting this busy work for math class done when I clearly did well on the tests. I feel like I got the bare minimum from her to be a decent mom and my brother gets the mom who is actually trying. But I can't say anything to her, she pays for stuff I can't afford on my own, I'm in college and work two jobs but only make 400 a month, she also occasionally gives me rides when I need them (as long as she isn't busy). I can't drive because no one takes me out to practice and so I have never gotten my license even though I've been paying to renew my permit every year since I got it when I was 15 (I'm 20, almost 21). I needed her, but she wasn't there for me, she rarely, if ever, asked how I was doing, and it was only ever in school or about a specific topic. I've been diagnosed with ADHD since middle school when my \"behavioral issues\" (crying over everything) got too disruptive in the classroom. And I haven't been treated at all, I can't afford the medicine currently because I am under her health insurance since she claims me as a dependent and therefore I can't get government assistance to help pay for the meds. I have anxiety through the roof to the point it's been majorly interfering with one of my jobs, and making me terrified of just answering the phone at the other. I just feel so damn alone"
    },
    {
        "name": "t3_9eefh9",
        "created": 1536540498.0,
        "ups": 2,
        "downs": 0,
        "title": "Hey y'all.. just wanted to know how you deal with negative thoughts.",
        "selftext": "Yesterday night my roommate yelled racial slurs at me (i am from india, it is pretty common here). We had an argument about it. 24 hours later it is still in my head. I have been doing AMAZING for the past 3 weeks i am on my medication. And this one incident just seems to be ruining it all in a day. Do you guys have one of these days? If so, how do you go about dealing with it?"
    },
    {
        "name": "t3_a1rbkr",
        "created": 1543602741.0,
        "ups": 2,
        "downs": 0,
        "title": "A book that is helping me a lot to deal with ADHD",
        "selftext": "Hi everyone. I've been diagonised with ADHD recently. I live in India and the awareness and medications here are not so mature for adults. So My doctor advised me to figure it out myself involving myself in psychology studies and Budhhist Philosophy. I've been reading a book called \"**Mind full to Mindful**\" which talks about zen and the practice of it. So far it's been a great help in developing my will power over the last week, so felt like sharing it with you guys! "
    },
    {
        "name": "t3_5okmyb",
        "created": 1484714985.0,
        "ups": 6,
        "downs": 0,
        "title": "Does time go faster or slower while you're on your meds?",
        "selftext": "For me it goes faster"
    },
    {
        "name": "t3_8n3aaz",
        "created": 1527661210.0,
        "ups": 4,
        "downs": 0,
        "title": "Extremely conservative and ignorant parents and ADHD .",
        "selftext": "So I have been diagnosed with ADHD combined type and have been prescribed adderall XR for the past 2 months(23 M).Due to certain error of judgement my parents found out about the disorder and had no choice but to come clean. Being of south Asian decent the stigma regarding mental health is insane. Both of them freaked out branding me crazy and blaming me for being weak and not being a man. They said there is no such thing as this and it’s all in my head. They ordered me to stop taking adderall and come back to India and get “actual treatment”. I am a graduate student finding a job in US , they told me stop searching for jobs and come back to India. The worst part about all this is that my relatives who I was staying with found the pills in my bag and told them blindsiding me. I knew they wouldn’t understand ,tried reasoning to no luck.  They are asking me to do the impossible which is actually making me better manage my symptoms. I somehow convinced them to give me a “chance” to come clean. So they will be coming over here for a few days to have a “talk therapy”.  I don’t know what to do about this because my future is on the line. I have been living 2 separate lives. One is a facade for them. I am a strong believer in science and facts and they did not give a shit about science.  I have explained why this happens and my dad has it too but doesn’t know about it because he had coping skills.  So I had a breakdown not knowing what to do  because my future is on the line and they are trying everything to not pursue my passion! This is utter BS and my anger and hatred is growing.  It just sucks bad that my own family doesn’t understand me in-spite of vehemently explaining the disorder.So I have decided not to give a shit but play along with them while at the side taking my medication. Is there any way / tips to hide the XR while they are around. They do not trust me because “I am not well and need help” . "
    },
    {
        "name": "t3_5q36mb",
        "created": 1485380022.0,
        "ups": 28,
        "downs": 0,
        "title": "My family hates me and now I'm depressed",
        "selftext": "**Background*** Dropped out of college due to ADHD in 2014, although I didn't know it at the time. Came home and tried to self-teach Web Development. Failed. Again. * Finally got medicated in May 2016. Basically cured my ADHD overnight. * Did an internship in India for 6 months and struggled with the meds available there. * Returned to the USA in November 2016. Taught myself Web Development success fully. **Now**I'm looking for work (junior front end dev) and trying to fill in any gaps I might have in my knowledge. Finding a first job is damn tough!The shitstorm I've been getting from my family lately is horrible. My mom is obsessed with me and what I'm doing. She needs a psych more than me. She's literally stuck in a though loop of obsessing over me. It's likely she thinks I'm wasting my time and should go back to college. My sister thinks the same. They must have forgotten about how we can't afford our mortgage anymore and we need money to pay for the house. Neither of them believe I have ADHD or understand how fucking debilitating it can be. They think I'm a loser college dropout who sits at home all day. They tell me I've been doing this for 3 years, when I'm relatively new to having self-control (excluding that horrible Indian medicine, it's been &lt; 3 months). Now that I'm on meds, I'm fucking trying. HARD. I'm working on my laptop at least 10 hours a day if not more. I'm going to meetups and hiring events. I'm marketing myself on social media. I can't remember the last time I took a day off anymore. I know we're going through hard times, but does that really justify the verbal abuse I get? I'm starting to consider leaving my family completely and moving out of their lives. I miss the old days. :(How can I make my family not hate me? How can I get a job ASAP? The traditional ways are not working for me. **tl;dr My family thinks I'm a lazy loser college dropout that wants to permanently mooch of his family. They hate, verbally abuse, and neglect me. I want to get the fuck out this madhouse and get a job. How can I patch things up with my family and how can I quickly get a job?**## Update: Got a job as a web developer. Instantly tripled my household income. I was right! "
    },
    {
        "name": "t3_1xaszl",
        "created": 1391833689.0,
        "ups": 24,
        "downs": 0,
        "title": "Unable to summon the courage/ overcome the stigma to go see a doctor (28 M). Please help.",
        "selftext": "I always knew that there was something called ADHD, only I thought it couldn't be me.  I recently saw a video about ADHD (while looking up on ways to improve my concentration) and the proverbial light went off in my head. I really need to fix this as this is severely curbing me at work, especially as I go up the ladder. There is a lot of stigma against mental disorders in my country (India) and though I would never think less of another person because they are ill or have a problem, I can't help but feel like a failure because my mind is broken. I try to lead a rational life and it feels horrible because it is my mind, my essence of who I am. I am afraid of losing who I am if I go around fixing things (not that I don't loathe who I am). Also, I am living with my parents (not very unusual here) and they will take it very badly. Plus my mom has a history of trivializing my problems (probably because I was a \"problem child\") and I end up reacting badly and feeling horrible about it. I don't think I can successfully hide it from them. Keeping shut about what I don't want to share is an area I have a lot of problem with. The stigma is pretty awful and if it turns out that I do have a problem, I am sure a good number of women would not even consider seeing me based on that alone. Though, it is seductive to think that I might have ADHD in the sense that it explains a lot of what went wrong earlier in my life, I would definitely be happier if it turns out that I do not have it.  But the writing is on the wall and I am unable to ignore this. I know I need to see a doctor about this, I am just not able to get the courage/ motivation to do this. Also, really not sure about how to deal with my parents/ family in the aftermath. **TL;DR**: Think I have ADHD, really interfering with my work/ career. Very scared, embarrassed because of stigma/ other fears. Not sure how to deal with parents who are bound to react bad. Help, please? **Edit 1**: Wow, so many responses and such thoughtful ones. Quite honestly, I was expecting to be told to quit being so whiny and just face the problem head on and hopefully, that would motivate me enough to just get it over with. I can't say I have completely overcome my fear/ embarrassment but I definitely feel a lot better about it, to the extent that I am probably ready to deal with it (trying to find a decent shrink now). I can't do much else but say thanks and promise to keep you updated about how things go. Thank you so much! Don't want to sound cliched but your kind response was a refreshing change and really means a lot. "
    },
    {
        "name": "t3_7i6fgg",
        "created": 1512681843.0,
        "ups": 9,
        "downs": 0,
        "title": "No family support",
        "selftext": "Guys, everyone in my family always keeps telling me that I need to grow up and that I am too immature for my age. These comments slowly started to hurt as I turned 18 last year in September. That's when I did a random google search about it. I could realte to ADHD. So I started reading further. I could relate to almost everything I read.This year in January, I told my family about it. None of them believed me at all and they said that things like ADHD are just things on the internet and even if they are real, I don't have them. My brother said that I am saying this as an excuse for not really growing up. I got more scolding than you guys can probably imagine. Ever since then, I have been silent about it.The year is about to end and I am now a college student for 6 months already. When in school, I always thought I was different from other kids in almost everything, but I slowly blended in because I shared classmates from LKG to class 12th. 14 years of being with the same people made me forget most of it, but there were always times when those thoughts came back creeping.Now that I am in college I have begun to realise how much different I am compared to others. I am from India and I think there is no way I can convince my parents to go to a doctor for this. Also I live in a a very small city, so there are no such doctors here atleast in my city. I have been on this sub for as long as I have been in college and never posted or commented. Last night when I told my parents about it again, they were a little soft on me this time and tried to convince me I didn't have it. I want to share the reasoning they gave for me not having it.These are my grades from class 12th:English:80Maths:55Physics:43Chemistry:43Computer:100I have always been super good at computers and that's something that my teachers always keep complaining about. They say why can't I perform in other subjects when I can be so brilliant in one. I scored 100 in computers for 4 years straight. I want to ask you guys, does this mean that I don't have ADHD? I am asking because I still think I do have it. I have every other symptom. I can't focus on anything. I can't stop moving when someone is giving me a lecture. I can never ever hear an alarm while asleep. I keep making careless mistakes because I didn't pay attention to detail. I keep forgetting things. I am impatient for my turn to speak in class when I know the answer, I often give every answer I know even if I have not been asked and also get regularly punished for this. If I want to say something to my dad and I notice that he's busy, I still start talking.I'll admit that I am in no kind of general depression and I am leading a happy life because my friends love me. This actually goes down to my personality. I just always want to please people around me, I know this is unrelated, but people like me because of that. A lot of times, I say things that I am serious about, but they think I am joking and find me funny."
    },
    {
        "name": "t3_aiwis9",
        "created": 1548251033.0,
        "ups": 1,
        "downs": 0,
        "title": "Going on a vacation on a budget without savings and without a job, Impulsivity or ...??",
        "selftext": "My 'internet gurus' mentioned travel and/or seclusion as the best course of action when finding yourself at the crossroads of life, not knowing which way to go. So I thought yes let's take a break from all this crap and see the world, something I haven't done much anyway because of a constant lack of finances. I need to think clearly, far away from my family and peers who look at me with concern and contempt. I have this 'faulty programming' that I NEED to 'reset', in India, no better place right ?. I've been carrying this guilt and shame (RSD) for almost 40yrs BELIEVING that I was faulty by nature and that I didn't deserve to be happy, with or without someone. I've been without someone for a long time, love eluded me because I couldn't love myself.Meditation, medication (recently), excercise and a lot of spiritual practice has been slowly showing me the LIES I've been peddling myself, that I am WORTHY of Love, at the same time I torture myself when I don't live up. I can't trust myself anymore. But I am more 'Myself' than ever before, I've literally transformed myself in so many ways and I did this largely without help. But I do need help, just need to ask for it more. Opening up has been so hard.Anyone here have experience with travel in order to 'find themselves' and what has it brought you in terms of happyness in life, career, love etc ? "
    },
    {
        "name": "t3_7prsen",
        "created": 1515737564.0,
        "ups": 6,
        "downs": 0,
        "title": "Having goals/long term aspirations",
        "selftext": "Curious as to whether this is an ADHD thing or not. I don't have any goals or aims in life. I don't mean I'm flatlined, sitting all day monosyllabic with drool hanging from the corner of my mouth staring into the abyss. There are general things I want for life, to have a meaningful relationship, maybe have a child, build a house etc but I've just kinda drifted from thing to thing all my life, quite directionless. I make the best of what I have then move on. Lots of people have specific goals like swimming with dolphins, flying a plane, visiting India, owning a fancy car, learning five languages. Tangible things. But I don't.If I think about what I might like in any specific terms for my life, I'm faced with a blankness. The best I can come up with is that I'd like to continue to stay stable mentally.I've only recently started meds and I've had a lot of light bulb moments of self awareness. I wonder if I've spent so long surviving the present, that I never developed a skill set for looking forward because doing that was never an option?"
    },
    {
        "name": "t3_9oegno",
        "created": 1539651324.0,
        "ups": 1,
        "downs": 0,
        "title": "Preparing myself for doctor’s appointment next Saturday. Worried that it would be the same as the last two",
        "selftext": "Until I came to know more about ADHD a week ago I had no idea that there could be a disorder that explained all of the issues I face. I have been seeing psychologists and psychiatrists for depression and anxiety for more than three years but nobody brought up the disorder. Once I just casually asked my psychiatrist about it, after being late for an appointment by 15 minutes, because of which she had yelled at me (that should have been a red flag but it was my college psychiatrist and I didn’t know as an international student in the US who else I could go to). She dismissed my concerns about having ADHD because of how hard I was hustling to make ends meet and a person with ADHD couldn’t do that. I was scraping by in my classes and not doing most of my reading, suffering from insomnia and alienating my friends. Then I went to grad school for a one-year intensive program and despite detailing my struggles with schoolwork and impulsive spending, my expensive therapist never brought  up ADHD or getting assessed for it. My grad school psychiatrist was totally useless even with my depression issues.I have returned to my home country now and I’m not sure how to look for an ADHD specialist here in India. I’m seeing a psychiatrist on Saturday but I’m afraid he might not turn out to be much help either. I don’t want to be the person who’s convinced they have a disorder even when they don’t, but I just want to be heard and given a fair chance. I was such a bright student but once I left for abroad the coping mechanisms I’d built at home fell apart and the extent of my executive dysfunction became clear. I’ve suffered so much in the past few years—lost friends, disappointed professors, alienated well-wishers and I can’t see myself living the rest of my life like this. Being diagnosed with ADHD almost feels like it would be an end to my problems because then I could finally get the kind of medication and therapy I need and so much of my behavioral and executive problems would start making sense. I’m afraid if that’s not what it is I will just have to live with the fact that I’m just a ghost of the person I used to be. I would appreciate any advice for my appointment or just otherwise that the people of this sub might have."
    },
    {
        "name": "t3_95hb3o",
        "created": 1533717548.0,
        "ups": 1,
        "downs": 0,
        "title": "Stopping medication",
        "selftext": "I consulted a psychiatrist for the first time and using Adderall from last couple of months .. Started with 10 then changed to 15mg.I am not liking the idea of using them for life, even my doctor said he was using from last 16 years.. I migrated from India a decade ago. It's hard to tell parents and future spouse that I have to use pills daily. In India consulting a psychiatrist means people think for only one cause - mental issues like fully retarded (its strange i know, irrespective of their education level)So can I change lifestyle habits and keep up instead of using pills.. My doctor suggested you don't need to tell anybody.. But I am thinking.. Why should I use brain stimulants which are unnattural"
    },
    {
        "name": "t3_8814f6",
        "created": 1522357764.0,
        "ups": 11,
        "downs": 0,
        "title": "A Tip for Early Work Meetings",
        "selftext": "**Make sure you adjust your med schedule to compensate!!** I'm so embarrassed that I have to share. I work for a company with offices in India &amp; China, so sometimes I have to video call really early in the morning. This morning, I had my first meeting running a project with our graphic design manager. I was running late all morning, got stuck in traffic, logged on to the call late, accidentally muted myself, shared the wrong screen, couldn't convey my thoughts coherently, and apologized about 10 times.  Ended the call...and realized that I hadn't given myself time for my meds to kick in. Just had to share because it was so dumb and easily avoidable. If you need me, I'll be hiding under my desk waiting for my adderall to make me feel like a person. "
    },
    {
        "name": "t3_732tgg",
        "created": 1506658951.0,
        "ups": 4,
        "downs": 0,
        "title": "I have been grappling with several issues in my life, some of which, I believed, stemmed from ADHD. I recently went to a psychiatrist, and following is my experience. I really need help and guidance and I have no where else to turn to.[Really long read]",
        "selftext": "Whoever chooses to read this, I am really thankful. I had a major mental break down in the last couple of days and I am experiencing being utterly lost and hapless like I have not felt in a long while.So for starters, I am male, Indian and 23 years old, currently an engineering student. Since I really started experiencing puberty, around when I was in sixth standard, I started experiencing a lot of different issues. Extreme social anxiety, crippling self esteem, and absolute inability to pay attention. I would engage in extreme escapism, making up worlds in my head, and spending hours daydreaming, making up stories. Anything that did held my attention, I would very quickly get obsessed with it, like going through thick novels lightening fast, but otherwise found myself staring at the same page I had started off with when I sat down to study hours before my final exam. Back then, I simply wrote it off as a mixture of laziness and bravado. Another really fucked up thing that used to happen to me was that I used to get episodes, in which I would have intense nightmares and would wake up, screaming that I couldn't breathe. I have no idea why my family didn't chose to take me to a doctor.There are certain details that are relevant to my case, I believe. I was sexually abused from the age of 4 to 9 by a cousin, seven years older than me, who used to come to our home. He used to make me perform oral acts on him, and put me in other degrading situations. In the seventh standards, my nightmares were especially centered around him, that he is coming to kill me, and my family would laugh when I would tell them this, half weeping.Another relevant thing is that my father suicided when I was four. My psychiatrist told me that a lack of proper father figure is also important for development and leads to issues. I dont know what to think about that. My mother was also mostly emotionally withdrawn, facing her own issues. I look back at my childhood, and find myself being terribly alone, with neither friends nor family.Anyway, this lead me to have a very withdrawn and introverted personality. I had very few friends, and they were all incredibly smart. That also really added to my whole general feeling of being pathetic as I was always on the verge of failing throughout my school.I guess this is getting too long, as it already is, I find myself cutting back a few paragraphs from my rant. Basically, with the inability to pay attention, to drive my focus through whatever I am supposed to, even under extreme stress, really fucked with me. Poor school grades, poor entrance exam results, poor college grades. A complete failure throughout. I would eat a lot whenever I would feel slightly perturbed, and would always realise that I ate like a pig, and would still do it anyway. Obviously, I became fat, which further fucked things up with me.I tried several times, to get a grip on my life. I would wake up early, go for a walk, eat right, go to college regularly. Try to study, try to socialize. I dropped my BMI from obese to normal, cutting through the overweight range, twice in four years. Maybe I would manage to pull through even a single week of productive days. Those weeks would go on to positively affect my life for months, even years, to come.But I always relapsed, and relapsed hard. It is then, when I came to this subreddit, as I had always suspected that I have some learning disability, I realised I share so many traits of ADHD, of people who wrote down their experiences, that ultimately compelled me to take this step. It was a big deal for me as their is a huge stigma in India in seeking mental help, and I kept it hidden. After having being compared to my father all my life, I didnt wanted people to think that I have finally cracked and am suicidal.I shared all of this with him. He was very friendly and warm. He told me that I am facing a lot of issues, and that he would help me unravel all of it. He told me that it is clear that I have the ADHD condition, but we have to face the different issues one by one over a long course. I have no idea what he meant. He told me that I have severe anxiety issued. During the session itself, I disagreed with him, though I did not voiced it, but now in retrospection I realise that I am literally crippled with anxiety in every single social interaction, right down to even responding to text messages. He prescribed me Stalopam 10mg, a drug to increase serotonin levels. Again, having done my research, I didnt liked that, knowing that dopamine is commonly believed to be the culprit behind the condition, or at least the lack of it. I decided to simply trust him and roll with it. I took a pill after dinner at night.When I woke up, it was an experience that was beyond exhilaration. I could hear the fan, the sound of my breathe, the birds outside. Sound of a thousand thoughts, fantasies, debates in which I represented every side, projects and scenarios that I will never find myself in, in my mind, clashing, filling it up, was suddenly silenced! I thought to myself, \"is this how normal people feel? are they so fucking zen all the time?\". It was literally too amazing, I felt peace and calm that I had never felt before. I was extremely happy and productive for the next few days. A lot of pending chores, and in my remote internship I had somehow managed to land, were dealt with.I was tiniest bit sad. I could no longer hear symphonies that my mind had made for me, nor those worlds and character came to my mind that used to play around with all the time. But the quite was a much better substitute for it, and I would choose it over that anytime of the day. I began to realise how people could continuously work for hours. And then I actually fucking did that. But that did not last long.Slowly at first, but I again started experiencing the deluge of mind fucking swarm of thoughts returning, inch by inch. Sometimes it would only be a couple of minutes. Then hours. On the 12th day, yesterday, it came back as a storm, completely crippling me, immobilizing me. I could not do anything, think about anything. I have never felt this helpless.Today, for the first time, I really questioned all of my dreams and ambitions. Do I even have the mental stability to do a job that requires intellectual effort? My boss told me to lay down the project structure of an app four days back, and I havent responded yet. I no longer feel that I can ever hold a job, at least that requires actual intellectual effort. I have never felt so hopeless before. Has any one ever experienced this here before? Does anyone who knows about this stuff tell me what is going on? I have never felt this pathetic.....anyone who has any idea please help me. Lastly, I would like to apologies for my English, as it is not my native language. I hardly speak to anyone for weeks, months and I have not had a real friend since high school. I suck at communicating anything to people. Also, there is no time limit to respond on this post. I need help, I have no friends, if you feel life responding when ever you like, please feel free."
    },
    {
        "name": "t3_4to77o",
        "created": 1469000152.0,
        "ups": 17,
        "downs": 0,
        "title": "I feel out of options. Any advice?",
        "selftext": "Hi again. I posted recently about how my father, a psychiatrist, doesn't think it's worth the hassle for me to be medicated in college.You all recommended that I see someone else for my ADHD given that he's not exactly the most objective source. I tried bringing this up to him, but he shut me up by sayimg that in India, where he's from, there's no such thing as having a choice in doctors and that I'm being bratty by not listening to my parents. He added that there's no way I could have ADHD since I've made it to a top five college.Maybe he's right in that I'm being bratty and seeking pills. But I don't think so. Everything I've read about adult ADHD just feels so... Me. He said that I just have poor study skills. But trust me, I've read over twenty books trying to combat this. I know every trick in the book and was so motivated to fix myself. But that dang hyper focus... Either I have terrible difficulty reading something in advance based on the schedules I make myself without losing focus or I'm insanely hyperfocused and waste hours upon hours on meaningless items.I know this isn't a parental advice forum, but I feel out of options. I've had this gnawing feeling of underachievemnt my entire life despite how well I've done thus far. My parents laugh at this and say that I put myself to too high standards. But I know I could be doing much better with the time I have if I could just direct my motivation and drive to succeed in the right ways.The worst part is that I can feel myself spiraling into depression. The feeling of under achievement combined with the idea that I will never get better... It can drive a person insane.I know I'm incredibly fortunate to have the opportunities I do, but at the same time, I feel so guilty that I can't capitalize on them the way I want to. I'm not a lazy person. That's evident from the idea that I've gotten myself this far without giving up, but I just feel like I'm out of options at this point.Is this all in my head? Do you think it's simply a matter of study skills? Please help.Edit: I'm 18."
    },
    {
        "name": "t3_4j3dyh",
        "created": 1463122709.0,
        "ups": 14,
        "downs": 0,
        "title": "\"If you died, I wouldn't have these problems.\"",
        "selftext": "I said I would mow the lawn. I didn't. My Mom is outside mowing the lawn. She's old and pissed. She came inside for a second and cussed me out. This happens every time the grass is big enough. I enjoy mowing the lawn. It's fun, it feels great. But I don't do it. I'm not really sure what I'm asking from you guys, but I'm kind of lost. I don't understand why I can't bring myself to do simple things. Is this even ADHD? I can't even get my Mom to understand it. She doesn't get how it affects me. **She just came back in now.\"Get out from my house. Get out from my life. If you died I wouldn't have these problems. Fucking asshole. Dog. Whenever there's work to do you have ADHD, but you're fine when you eat. You're fine when you go out.\"** The weird part is, her comments didn't affect me much (I feel pretty worthless though). It's like I have no emotions. And then she said, \"Come cut the grass right now!\" Now that she's said this, my resistance to the task has grown even more. How the fuck do I even talk to her? Am I just blaming everything on ADHD (that I'm not even formally diagnosed with? I think I might be some kind of bipolar. Every Thursday through Sunday, I go into a sort of depressive state. I struggled to even take a shower today, I'm amazed I got anything done today.I'm starting a new job soon. I'm waiting on meds that I might not be able to use at work in India. I think I'm going to fail it like I did with college and everything else. Why did I pick a career where focus is so necessary. Why couldn't I have done some easier business major or writing. I probably would've been in college and I wouldn't be slowly killing my mom (I caused her eye to twitch whenever she has stress, sharp heart pains that sent her to the ER, and overall unhappiness).Some **useful** comments would be nice."
    },
    {
        "name": "t3_374om1",
        "created": 1432530770.0,
        "ups": 2,
        "downs": 0,
        "title": "My life has taken a drastic turn and I am unable to control myself anymore",
        "selftext": "I've always been that guy in the class who's hard to control or who's doing all the crime. My childhood was a mess of scoldings from parents and teachers. In my family, I've never been adored or loved mainly coz I was just too naughty and impulsive. My grandfather hated me the most out of all the kids in the family and this still hurts me. By family I mean my aunts, uncle etc. My dad and my mom has always loved me and given me whatever I asked. I was good in math and used to get good grades in studies. I had a sharp memory and I could actually concentrate and do math. In 10th finals (which is considered &amp;amp;amp;amp;amp; pretty big deal in my state's system of education ) I scored 81% and got 99/100 in Advanced Math and 96/100 in General Math (yeah I had two math subjects). Everything was good till then. I was impulsive, naughty, hard to control, full of anxiety but I could concentrate on my studies and get good marks. Everything changed now. When I joined an engineering college for my graduation in Information Sciences, things just changed. I felt like the ADHD part of me that was dormant suddenly came alive and I could no longer concentrate on anything, couldn't memorize any formula or sit still to get my assignments and studies done. I started getting pretty low grades and my life just went downhill from there. When I was a kid, my mom seeing I was too naughty etc, showed me to a psychiatrist who said I had ADHD but I never had to take any medication as it never hampered my studies. I used to score high in my class. I don't know what happened during my engineering but things all went crazy. I tried to focus, I tried to concentrate but it was an impossible task. Since I couldn't study, I started going in motorbike trips with my friends. I had roamed almost 13 states on my bike during my fourth year in engineering. Things just absolutely started going bad for me. Yes I was happy travelling and seeing new places and covering half my country via my bike which I learnt to drive and bought recently but no matter how much I tried I couldn't concentrate on anything important like studying, doing household work etc. I started drinking with friends and started partying late night and started dating girls. I realized one thing that I did all these things to keep my off depression coz I could no longer focus on my studies or memorize anything. I don't know. I just couldn't memorize a word. Since I couldn't study, I gave up on it. I started going to casinos and I lost a lot of money there. I even failed in 3 subjects in engineering in the last semister. I have never failed in any subject in my life. I didn't know what to do. All my friends have graduated now and I am now about to give the exams of the three subjects that I failed. My engg should have completed in 2014 but now it's 2015 and I am still struggling. Still not graduated. My exams are next week. I will have to clear them to get my graduation degree. Parents came to know about my failures and they have pretty much given up on me. I used to be the brightest kid in class and now I'm just a failure who drinks alcohol, smokes pot and spends most of his time on his bike travelling his country. I want to make my parents proud. I cry everyday inside seeing the things I've done in the recent past - wasted a LOT of money, lost a lot of friends and failed in my studies. I don't know how this is possible. How can I suddenly lose the ability to concentrate? I had ADHD since childhood and how can it suddenly kick me off my life? How is it possible that it has struck me now while I was pretty fine when I was studying in my high school. I don't get it. What to do? About Medication: I almost forgot that I had ADHD until I got my self into engineering. I was very small when I came to know that I had ADHD but I never knew what it actually was. I have recently started searching about it in the Internet and YouTube and I've come to know what adhd is and seeing the videos of the people having adhd, their blogs, I could perfectly relate their symptoms with mine. I am sure I have adhd but why did I lose my memory and concentration suddenly. Why now when I need it the most in life? Doctors prescribed me medication (6 months back) but it's not available in my state (Assam, India). I've searched all major cities of my state for the medicines (named Addwize here in India and other one is Inspiral). I didn't get it. I tried online but there's no legal site that delivers such medicines online. Current condition: I am currently preparing for those three exams so that I can clear my engg but my future seems dull. I am now a below average student. My aim in life was to be an astrophysicist. I have my astrophysics exam 8 months from now. I am good at physics and math since childhood but now since I am not able to concentrate properly, I doubt I will ever be able to be the scientist that I always wanted to be. My sole aim in life is to be a physicist (Mainly a theoretical Astrophysicist). If I can get some advice, it will be nice. I am fighting through those usual adhd stuff such as lack of motivation, extremely lazy and bad at things which aren't interesting, very emotional, sensitive, depressed inside and unending flow of emotions. Its very hard to control my emotions now. I get angry too often and get anxiety attacks. I am totally lost. One moment I'm happy and next moment I'm sad. I can't control my emotions or my sudden impulses. I just want to make my parents proud. I want to be a successful person. I am 24 years old. I am very very worried about my future. I don't want to die a failure. EDIT: I think I should mention this. No one knows about this, not even my closest friends or parents. Last year in November, 2014, I got so depressed regarding my lack of ability to concentrate that I tried to commit suicide. I had suicidal feelings and one day it was just too much. I was very very scared that day and I took help of an ADHD Facebook group to calm myself down and talked to various people there and they helped me to control my urges to commit suicide. I am very thankful to those good persons there in the group."
    },
    {
        "name": "t3_99agmo",
        "created": 1534942394.0,
        "ups": 1,
        "downs": 0,
        "title": "Can’t plan travel. Looking for retreat.",
        "selftext": "32 year old female. Was diagnosed with ADD in 2016. Last year I aimlessly backpacked in Central America. I felt lost. Didn’t gain much from that solo adventure.This year I thought a retreat would be better for me as I try to get a handle of my life, you know, the longtime struggle for all of us diagnosed in our adult years.Anyone has a good recommendation for a retreat that would be good for ADHD folks? I’ve been looking at book yoga retreats.com and feeling so overwhelmed!I’ll consider the USA, India, Israel, Mexico and countries in Central and South America just because those are the places my passport will allow me to visit without a visa.I’ve got a budget of US$3,000. It’s taken me a year to save this money, and my time to travel is coming up around the corner. Naturally, I haven’t been able to make a decision, and here we go, doing it at the last minute.Typical.Help."
    },
    {
        "name": "t3_41q6a8",
        "created": 1453259118.0,
        "ups": 17,
        "downs": 0,
        "title": "Medication May Not Be Everything, But It Is An Important Puzzle Piece",
        "selftext": "ADHD as all of you from this subreddit know is a very frustrating disorder to live with. The stigma of whether the disorder is real or not simply because of the nuanced nature of diagnosing really young children (although the DSM-V changed it to age 12 instead of age 5, correct me if i'm wrong), or the fact that you hear stories about college kids abusing stimulants to make themselves \"smarter,\" and let's not forget those New York Times articles that talk about overprescribing and overdiagnosing because of Big Pharma, all at the expense of denying that ADHD is not a real condition.  To all of them out there, I just want to say F*** you guys! You don't know what its like living with a disorder that leaves you constantly spaced out, mentally fatigued, awkward socially as a byproduct, and being vulnerable to constant toxic messages whether it be from parents or other peers simply because you function differently. Let me organize this in a point by point basis as follows:  1. ADHD is caused by poor parenting - My parents enforced as much discipline on me as they could. My parents banned me from watching TV or playing video games during the school year. My parents did their best to check my homework or watched over me in the living room as I was doing my work, but I would always get negative remarks for either working really slow or making small but crucial mistakes, etc. Hell my parents would always tell me to get back to my seat and stop fidgeting too much. This lead to a lot of frustration on both sides; my parents felt frustrated that I wasn't consistent, and I felt frustrated and fatigued because I had to try harder and harder and always felt constantly anxious to not make mistakes and put in my best effort. Often leaving me misunderstood as lazy. 2. ADHD is a result of poor diet - While diet is important, a good diet alone is not going to make it go away. During my school years (and of course now), I ate eggs, fruit and milk for breakfast and tons of veggies at night. My parents prepared really great, healthy meals than they give themselves credit for, but it didn't really help me cognitively back before pre-medication days. I still had trouble concentrating and focusing, and after the first hour my mental energy would diminish. With that said, I still believe in a healthy diet, but its only one puzzle piece. 3. ADHD is a school system problem - There's a lot of talk about how US schools need to be reformed or how US schools are killing creativity, etc. While I do agree that there are some valid points, I feel its a little one sided, because if you look at Asian countries like Japan, South Korea, and even in India, its basically emphasizing test taking and memorization at an even higher level than the US and spending even more school hours. Don't they need to be reformed too? I mean for me personally, I love learning, but without medication, my mental energy level feels constantly depleted and I feel like I need breaks, no matter how exciting it is. In my ideal world, if classes were 5 mins long, or I could absorb information in micro chunks that would be great. I could go on and on about, but I wanted to touch upon these points that really affect me personally. Now I want to demonstrate the difference medication made for me using the 3 point format:1. Medication Helped Me Follow Through With Studying And Chores - With the help of medication along with optimizing my work schedule to suit me, I'm able to be a lot less mentally fatigued and much more alert when studying. It really feels like I have a lot more control when i'm absorbing and analyzing information to make sense of everything i'm learning without feeling like i'm in a cloud. I'm also able to follow through on chores and can do them without overthinking them too much than usual.2. Medication + Proper Diet Manages To Sustain My Energy - I'm able to function properly with a combination of both medication and good diet, making me feel much more alert and less fatigued during the day. Of course I try compensate the appetite supression and fatigue near the end of the day with a small healthy snack like a fruit or something that packs protein like tuna for instance. 3. Medication Has Helped Me Feel More Involved In Class - Thanks to medication, I no longer feel the need to drift off or fidget constantly, regardless of how exciting or boring the class is. I'm able to take notes much more fluidly, participate in class much more fluidly, and see how everything is well connected with each other.  Even though this is all anecdotal, I just want to get all of this out there, because ADHD is a real issue that must be taken seriously. It is why I (and many other professionals) says its an important puzzle piece for treating ADHD along with good diet, scheduling that works for you, exercise, etc.  I still have a long road, but i'm much more confident about what I can accomplish, that I was during my grade school days. Thank you! :)TL;DR - Medication is an important part of coping with my ADHD but in no means a panacea. I also make sure to do other things in combination with medication.Disclaimer: I'm no doctor, but I just wanted to talk about my personal experience. If anyone has any articles they found, please post it on the comments below.                                                                                             "
    },
    {
        "name": "t3_1v05q7",
        "created": 1389523408.0,
        "ups": 23,
        "downs": 0,
        "title": "Diagnosed with adult ADHD a year ago, advice on if I should try a different medication or am just expecting too much from medicine?",
        "selftext": "Around a year ago I was (finally!) diagnosed with ADHD. Unfortunately, due to where I live, traditional stimulant medications are highly regulated, and cannot easily be prescribed to people who were diagnosed after age 18; similarly, **where I live, prescription of most non-stimulant drugs to those diagnosed after age 18 is considered \"off-label\", and I'd have to pay full-price (Atomoxetine, for example, would be over $200/month).**Fortunately, my doctor and I found that modafinil is easily prescribed, and with a prescription, I can legally import it from India. So that was my first effective treatment (after an unsuccessful trial of Effexor XR). It got me through a year of university, where I did well at something for the first time since I was 12 years old! So that was great. Unfortunately, through trial and error, I found that **modafinil only really seems to have any effect on my ADHD if I use it for 2 or 3 days per week**. If I continue taking it after that, I stay awake just fine, but get nothing done but browse Reddit, as per usual when I'm off medication. I need a few days off to recover any sort of useful effect from it.This means my life is still a rolling disaster; **I can't afford to waste my \"on\" days on things like cleaning my house, or organising things outside of university**.SO. **It is possible for me to attempt to get prescribed traditional stimulants, but it would be expensive**. I would have to see a psychiatrist ($300/hr) and have him contact the psychiatrist I saw for depression as a child, and ask him if he thought that he could have missed the diagnosis for ADHD. Then he would need to apply to the state government for an exemption from the usual prescribing laws. Then he'd have to write me the actual prescription. So that's several hours of time, making it quite an expensive proposition. But it'd be worth it if afterwards, my kitchen wasn't full of slowly rotting leftovers sitting on the bench, and my yard didn't look like my house was abandoned.**BUT. Is medication \"that good\"? Am I expecting too much from it?** Should I persevere with modafinil for 2 days per week, and just try harder? Try to get some CBT?**tl;dr:*** prescribed modafinil, it works well but only for 2 days/wk* doing well at uni, but rest of life is still a shambles due to not being able to \"waste\" my \"on\" days* cannot be prescribed non-stimulant medication for cost reasons* can try to get a script for traditional stimulants, but will potentially cost ~$1000* ***will traditional stimulants actually help me get my life together, or am I expecting too much from medication? should i just persevere, or try CBT/other therapies?***"
    },
    {
        "name": "t3_2kbb7k",
        "created": 1414298150.0,
        "ups": 17,
        "downs": 0,
        "title": "Applying to US colleges this December? You probably shouldn't mention your AD(H)D. (with numbers to back it up)",
        "selftext": "I'm applying for US colleges this December, with hopes of being admitted in fall 2015.I'm from Norway, where the diagnosis is quite well respected and is not considered \"some conspiracy to push drugs on children\". In general, there's very little awareness around AD(H)D, and the people I've told are more like \"Huh, I though that was about being hyperactive or something, well whatever\". While it's slightly frustrating, I actually prefer it that way.  People here don't really have any negative connotations with AD(H)D, as they have literally no idea what it really is.Anyways, I visited US colleges in September, and quickly learned that it's way different over in the US. I planned to mention my ADD on my college application, but I got curious whether it was a good idea or not, as there seemed to be quite a bit of stigma. I happen to know a few US teachers (I was teaching as a volunteer in India for a while), and mailed around. I also asked them to ask their teacher friends, and have now gotten feedback from 10 US college teachers or high school teachers.- 2 of them said that I should disclose it in the application, because it will explain why I've done certain things (retaking exams for example).- 5 said that I should probably not mention it. They argue that while there are laws in place against discrimination, they are not regarded seriously. However, many did recommend making the school aware (through pyschological counselling or similar) as soon as I start school. - 3 said that if I mention it, I might as well not apply, as it's common for your application to just be thrown away the moment that the application readers become aware of your AD(H)D diagnosis.**TL;DR: 8/10 US college or high school teachers recommended me to not mention AD(H)D in my college application, as it would hurt my chances of being admitted**"
    },
    {
        "name": "t3_4d1nza",
        "created": 1459635703.0,
        "ups": 5,
        "downs": 0,
        "title": "Need to figure out my meds quickly, or I will lose my job.",
        "selftext": "Currently, I've just started trying to find the right meds. I'm on Day 12 of Strattera 10mg. **I'm going to India for work as a programmer, I'm scared I'm going to fail.** I have trouble programming at home for very long, because it is mentally straining and painful. In India, I'm expected to work really long hours. I have people putting their trust in me for this job, and I don't want to let them down. Therefore, I'd really like to get my meds figured out quickly (before I go to India). **If Strattera doesn't work after a month, what should be my next step?** Should I try a stimulant? I'm concerned that Strattera may take too long to figure out. Should I up the dosage and wait another month in India? Should I cope and self-medicate in India? I'll be there for 3 months. Should I drink lots of coffee?**UPDATE 1:** Got Vyvanse. Works great, but lasts only 7 of the 15 hours I'm awake. And it's unavailable in India. I will have 4 months without Vyvanse, but generic ritalin is available here (Addwize is one of them). I'll tell you guys how it goes. "
    },
    {
        "name": "t3_3ub75k",
        "created": 1448543684.0,
        "ups": 8,
        "downs": 0,
        "title": "Filling in Prescription while traveling to Asia",
        "selftext": "I will soon be moving out of US to India or China for about 6 months depending on what options I have for working. Currently, I am on Ritalin here in US. I did some research and it seems Ritalin is strongly controlled and banned in China, and in India there is an alternate medicine which is known to have little or no effects + stronger side effects. Has anyone traveled to these countries before having ADHD ? I believe I can fill in a prescription for 30 days , but cannot carry more than that. I was actually surprised to read that ADHD is not taken seriously in these countries. How do they handle ADHD ? "
    },
    {
        "name": "t3_6ou8ko",
        "created": 1500746419.0,
        "ups": 4,
        "downs": 0,
        "title": "Like I can remember",
        "selftext": "I can hear someone calling my name repeatedly — “Krishna, Krishnaaa,..”, for a second I thought I am in a temple. When I struggle to barely open my eyes, what I see is a blurred vision of beds, curtains, monitors, medical equipment and someone in a white coat who’s on auto-pilot to call my name. We make eye contact and she stops.“How are you Krishnaa?”, she said.This is when I realize that I can’t open my mouth like my jaws are tied up and there are tubes coming out of my throat. My limbs are tied to the bed, left hand is in a cast. With these, before I could make sense of the situation, I managed to give a thumbs-up to the doctor.When reality slowly started kicking in, my mom and cousin sister walks into the Intensive Care Unit. They apply hand sanitizer and walks towards my bed. I wave at them like a happy dog’s tail.“You’re a brave person. We are all praying for you. Stay strong and start breathing on your own.” said my cousin sister.Start breathing on my own? Did I stop breathing? I had no idea why she said that.“All your friends are calling to check on you. Some of your friends are waiting outside the hospital. Since not a lot of them are let into the ICU, they couldn’t come see you….” Mom goes on. I had never felt cared for like that ever before. My tear glands started doing what they are best at.“Stay strong. You’re brave…Stay strong…”, this went on a loop.I wrote on my mom’s palm asking about my co-travelers. She said they are all fine and they are in my hometown. That’s when I figured I’m really far away from my hometown and I’m in a different language speaking town.They left the room. I was all by myself with the other hospital beds for company and a window to my right for entertainment. I could see a tree outside the window and the broad daylight made me realize it is daytime. I close my eyes and am off to sleep.I wake up, it’s dark outside. There’s a hospital staff next to my bed preparing himself to give me a sponge bath. While he is on his job, we make eye contact. He spoke in Tamil, which translates to “You’re brave. There is God above. Don’t you worry, nothing will happen to you.”. This gentleman will probably be in the least pay grade at that hospital. Though I am an atheist, there wasn’t anyone who was courteous like him in that hospital to tell me something humane.“Today is New Year, Happy New Year! You’re going to be fine, I’ll pray for you!” he concluded and gave a pat on my hand.I remember traveling on the 27th of December. Is it that bad a new year celebration hangover I have that I can’t remember what happened in the last 5 days? My brain started preparing a questionnaire with multiple choice answers. Hope my co-travelers are fine. What the fuck just happened? How did I end up here? Was I driving? Why are they telling me to start breathing on my own? Why can’t I open my mouth? Why can’t I speak?I rub my cheek with my right hand to notice that I have a stubble. Maybe they didn’t shave. Hopefully, they didn’t shave and just trimmed my beautiful beard which I grew for months. Oh wait, they shaved my chest. Dammit. Why is everything that I see in double? Why am I coughing through the tube in my throat? Why am I spraying blood when I am coughing? Why have they stuck a sticker on my face?Oh, wait. I can see the moon. Hi, moon. You look pretty behind that tree. Yup, damn pretty! Hope my girl is okay. I hope she’s not crying. Happy new year everyone! Why can’t I sleep now?All my teachers asked me to shut up when I was in school and college. Is this what they wanted?I was diagnosed with ADHD when I was 12. I met with an accident when I was 24 with comminuted displaced fractures of left body of mandible, bilateral medial and lateral pterygoids, walls of bilateral maxillary, ethmoid, sphenoid and frontal sinuses with hemosinus within, nasal septum, bilateral cribriform plates, lamina papyracea, nasal bones, left maxilla, roofs of bilateral orbits. Extra-conal air pockets seen in both orbits, herniation of intra-orbital faint maxillary sinus seen on right side. Extensive mid facial soft tissue lacerations with subcutaneous emphysematous changes (all copied from the CT Scan report).I couldn’t speak or open my mouth and was breathing through a tube on my throat (tracheotomy tube) for 50 days. Was on liquid food until then. I could slowly start chewing after 8 weeks.My cousin sister who I traveled with died in the crash. Her husband who she was married to for 4 months physically scraped through with minor injuries. I was wearing a seatbelt when I was sitting in the back of the car (quite unusual in India to wear a seatbelt if you are sitting in the back, apparently).If it was not for ADHD, I would not have got easily distracted throughout my physical recovery period of almost 4 months. Music, movies, 2016 T20 cricket world cup and IPL gave me company.Dad asked if I wanted to drive 25 days after the accident when we were returning from a review at a hospital. I obliged and got on the driving seat. It was a manual.TL;DR: ADHD helped me recover from the trauma of a nasty accident and injuries. Never been thankful for it until then."
    },
    {
        "name": "t3_27z4sz",
        "created": 1402619647.0,
        "ups": 2,
        "downs": 0,
        "title": "Have you tried brain training?",
        "selftext": "I am interested in hearing stories of people who have tried the brain training programs like Cogmed or others for their ADHD.  If you have tried these types of programs, please share about it.  "
    },
    {
        "name": "t3_1w24zy",
        "created": 1390623206.0,
        "ups": 8,
        "downs": 0,
        "title": "ADHD Emergency,",
        "selftext": "I'm about to buy a ticket to London, it's possible to buy modafinil there without prescription through india, I've been waiting since beginning of november in my country to see a doctor.I've seen one, but he only referred me to another doctor, and on wednesday they are looking at my case.IF they decide I'm a candidate for medication, then I'll have to wait another month or two.Problem is I can't take it anymore. Not suicidal or anything like that, but I solve problems, I solve problems for a living, my gut feeling tells me to go to England, buy medication, see a phsycatrist there.But it's not logical thinking.  I'm smart enough to know that, but sometimes I don't care if I'm thinking logically or not.What I would like to do is to have a skype interview with a psychiatrist, just to go over things.  Somebody I could be totally honest with - and not having to worry if he/she would blacklist me or something.I have decided I want to try medication.  I will do that, last resort is buying amphetamine from some russian guys I can get in touch with, but I that could lead to very bad things.Basically I'm not thinking clearly - but I'm aware of it.  I hope it keeps that way.If someone here can recommend someone who I could contact, and I would do so through an anonymous referral. I'm buying bitcoins now, and shipping modafinil to england to a po box so I can pick them up easily if I decide to go there.Atm. I have some money, and I'd rather use it to get some permanent help than to pave the way to my demise."
    },
    {
        "name": "t3_1ks647",
        "created": 1377085410.0,
        "ups": 7,
        "downs": 0,
        "title": "Diagnosed after falling behind at my 4-year job and my 4-year relationship. On my first dose of Adderall and I feel like a normal person. I'm not used to this and it worries me.",
        "selftext": "Hi, Currently on my first dose of Adderall and this is how I feel: I can finally think about one thing at a time. It's like the freeways of my mind finally got middle dividers. It's the difference between driving home relaxed, alone at 2am with plenty of energy and driving in Bangalore, India.My thoughts aren't colliding, then picking up pieces and moving out of the way for other colliding thoughts anymore. I am calm and I am okay. Anyway, so here I am feeling alright, feeling focused and ready to do some work, but I have an uneasy feeling. Like, will I really need a pill to make me feel normal for the rest of my life? I'm on 15mg IR and am about 4 hours into it and am experiencing, I'm not sure if it's a \"crash\" or not, but definitely a calming. I think I'm just acclimating. How did you guys deal with your first dose? What went through your mind and what did you do? How did your first week go? What did it do to your self-identity? I have no idea what to expect and am not used to the idea of having ADHD, but I'm a 28 year-old adult and I'm 99% sure I have it.**EDIT tl;dr** I just found out I have ADHD and I'm 28 and I don't know where to start. I'm taken aback by my new self-identity, even though I feel more calm because the calmness means I really have it. And always have. Any words of advice for how I'm feeling?  Thanks in advance for any help, guys. "
    },
    {
        "name": "t3_5aj0l3",
        "created": 1478035354.0,
        "ups": 2,
        "downs": 0,
        "title": "I find it impossible to do things I don't want to do (even with meds). Family and job on the line. help...",
        "selftext": "I find it impossible to do things I don't want to do (even with meds). I also find it challenging to do things someone else's way (if I don't like it). &amp;nbsp;**Family**&amp;nbsp;* My family's pissed over the fact that I'm working from home instead of going to the office. I do this because my current meds give me anxiety (I'm seeking alternatives). I've got no idea why or how my family can be, so involved with my work life. * My employer is a family friend. **He let my previously secret ADHD known to everyone in my family**. He doesn't understand ADHD, so he told them I'm depressed. I've been in India for the past 6 months, and nobody here seems to understand mental health at all. The good old \"just try to fight it\" speech is ubiquitous. My family is slowly pushing me into real depression.  &amp;nbsp;**Job**&amp;nbsp;* I hate this \"job.\" I was sent to India to learn (software development). I learned. Now they want me to just practice. I have no idea what to make anymore for practice. They use uncomfortable Oracle frameworks that just feel wrong. The office is constraining on its employees. The enterprise application industry is not right for me. They make boring B-list software for boring C-list clients. * I haven't had a challenge or learned anything in weeks. My mom still thinks I should try to work here and get the first job I can. I literally cannot do it. This work sucks. It's barely work. I hate it. I hate it. I need a job. I need money. I hate it. I miss the USA. I'm moving to New York after this shit. Fuck. **tl;dr I'm feeling a lot of pressure to get a job (which I choose to do anyways), continue a shitty job, and live a shitty normal life. I'm also scared of upcoming job application and interviews.**"
    },
    {
        "name": "t3_4bo2f7",
        "created": 1458790481.0,
        "ups": 7,
        "downs": 0,
        "title": "Started my first job soon. I'm scared of failing.",
        "selftext": "I'm getting sent to India for 3 months followed by at least a year in Miami as a Java developer. Developers in India tend to work really long hours, and I'm scared I will not be able to handle it. I'm will be starting in a few Strattera (my first time with meds) too. Does anyone have any tips or advice for me?"
    },
    {
        "name": "t3_4fhrqt",
        "created": 1461104186.0,
        "ups": 5,
        "downs": 0,
        "title": "\"I don't have a purpose in life\" - Thoughts as they Appear",
        "selftext": "My mom wants me to mow the grass. I said I would do it everyday for the past three days. I didn't. I rarely feel challenged. When I do challenge myself, I can never stay on task long enough to get anywhere. I feel like I'm just going through the motions of life. I wish I could just read everything for a year. Sit in a library and explore. No responsibilities. No people. No distractions. I used to always read, now I'm always online. I've got no idea what I'd do after that.I've got no friends. All of my friends were made through school. I dropped out, because I was failing. I don't really feel a connection to my mother anymore. I live in her home. She's very stressed about me, and how I don't do any work. Do I have Asperger's? Am I depressed? Is it just anxiety?In high school, I would feel panic after procrastinating on my work. In college, I got to a point where I stopped feeling the panic. I knew I was overwhelmed. I just stopped. I feel like a societal misfit. Maybe I don't have ADHD at all. I feel like I can choose what I want to do, I just don't. I slink back into comfort. No but, my past looks like ADHD. No idea what else it could be. I'm sure of it. This must be doubt. My mom's mowing the grass. Why don't I just go and take it from her. \"No mom. I'll do it.\" I'll be fine once I start. I'm too stubborn to quit. Maybe I should just get off the internet. I'm pretty sure I'm addicted. The apathy continues when I'm offline. My cousin does these things too. I'm pretty sure he has ADHD too. He's got Multiple Personality Disorder. My mom's yelling at me for not cutting the grass from downstairs. I feel bad about myself whenever she yells at me. She went back to cutting the grass. Why am I still not cutting the grass?Why haven't I made an appointment for a therapist? I've got a job lined up in India, but I'm not doing my visa application. I've been adding on to it slowly over the past two weeks. It would take me 30 minutes to finish. I need a mentor. I need to try. I need a schedule. I............I don't know...Why do I do this? So selfish. **tl;dr My thoughts as they come up.**P.S. I have a psychiatrist appointment today. How do I tell her about this? I don't know what *this* is."
    },
    {
        "name": "t3_2fup3d",
        "created": 1410245318.0,
        "ups": 4,
        "downs": 0,
        "title": "Is it my ADHD or does my wife have Histrionic Personality Disorder, and who is the real abuser?",
        "selftext": "as an add'er myself i know how hard it is to read to the end so if you want to read more u can but tl;dr. i am a high functioning adhd'er but things fell apart when child was born. adhd are known for showing lack of empathy but im starting to think wife has HPD and there are times that i feel she is just abusive, but she calls me abusive for neglect and ignoring her. am i crazy? is it just because of adhd i feel like this or is she really higher than average maintainance? i have now trial separated from her because it's too much, it's exhausting for both of us and i really need to think if this relationship is poisonous or if it's all me??please read on for details:i'm early 30s, married for 2 years and only diagnosed a few months ago after my child was born. i've always managed to cope, my intelligence saw me through higher education and my job is well paying enough to keep me above water dispite all the money i've lost from not following through on money owing to me and missed flights lol. ive never got into drugs or addictions, i do love movies and video games tho.i know living with adhd spouse can be infuriating sometimes, however there are times when i feel that my wife is just plain abusive and histrionic. whenever ive researched adhd and abuse it is always about the adhd being the abuser but very little on the spouse. i did by coincidence see something about HPD, reading the signs she fits almost all of them.i really empathise that i don't fulfill promises always, im normally late, last minute and dont' manage finances well and how that affects the wife. i really do try. im the last one to use adhd as an excuse to be lazy, i dont' tell ppl i have it (even close friends) coz i don't want to be treated differently or special and i have tried just about every organizing and personal development methodology there is. my wife had to convince me to takes meds because i don't like using crutches. friends would describe me as spontaneous, slow and laid back. angry is the last adjective in the world.my wife on the other hand is an organizing maniac (probably part of the attraction) busy bee, highly extroverted but very very very emotional. i know that non-adhd are prone to nagging, but i feel that i can never please her. she comes across as very gregarious and so therefore free-spirited but she is one of the most anal person i have met, she will criticize at dishes not spotless, or because i took a long time getting the broom when glass smashed etc. at our wedding she complained nonstop because she felt the music wasn't loud enough (everyone had a good time except her), her days are easily ruined by things i wouldn't even stop to think about. i feel because im the stoic cool under pressure risk taker ive inadvertantly taken the role of her sturdy rock and therapist. she panics easily and has frequent emotional outbursts when under pressure (normally i get the brunt) and she constantly expects me to take time out from whatever im doing to listen to her because she is super excited or sad at that moment and can't wait. she is extremely extremely emotional and gullible. we visited her in-laws (in a different country) recently and we watched Frozen, i was embarassed how completely absorbed she was in a children's movie, crying, laughing, cheering on, booing with the movie and all very very intensely, my family didn't know what to think. she is really insecure about being alone always checking if i still love her (i tell her repeateadly on a daily basis). One time my adhd mind wandered and i blurted out 'Who do you think will die first?' oops that was a mistake! she has deep rooted insecurities about being separated and either being a widow or me getting remarried and forgetting her. she always fears that i will abandon her. i think she wants us to be buried together dead or alive like in old india. she hates being left out. is always the loudest in the room. get's extremely excited at new projects, but folds at the first hurdle or rejection. she has a million more friends than i could possibly even want, 50% of them are her best friend. she has tons of families who are 'like my other family'. one, who was a mother role when her mum abandoned her and also had travelled 5 hours to our wedding, had to leave the wedding early because her real daughter was rushed to hospital in an emergency and my wife still is personally hurt that she didn't stay. she invites herself to things, like jumping into an intimate family photo at a wedding (it's ok because it's one of her many like-families) and i see the look of akwardness as they have to say ok.the only thing that she doesn't really tick the box is sexual promisciousness. She found religion at 18 and dresses very modestly now, but IMO she is so focused and obsessed about modesty it's almost like a reaction. she is still naturally a very flirtatious girl regardless of dress and ive started to notice times where she is almost hostile to female waitresses and all gooey and smiley when the male waiter comes. also despite coming across warm and cuddly she has had a number of sexual dysfunctions (which i've now heard about HPDs) and was a virgin until marriage. i wonder if the prudishness is another symptom? she was also molested as a child i should say.i've been by her side because i considered her to be a good hearted person and one of the most genuine person out there, but now i just don't know. adhd aren't known for empathy, my wife really feels others pain, but then there have been times where i think that she is so sensitive to her pain that she doesn't feel others'. There has even been a number of times when she has become physically violent with me. Once we were supposed to pray and eat at friends for the New Year and i physically could not move, exhausted and out of it. after many failed attempts at waking me up, she proceeded to hit me and jump on me to wake up, she then became hysterical and a malicious side i never saw before came out, she then started punching me in the balls, i was that out of it that i didn't even react, i just wanted to sleep. it was only when she dug her thumbs in my eyes that i reacted. instinctively i grabbed her wrist tightly and shouted to stop (probably with a few swear words). she had no recollection of doing anything wrong after, instead she was shaking profusely like a wet dog in the cold and holding her wrists the whole night and accusing ME of abuse??! a few months later i discovered i had a medical condition causing internal bleeding and severe anemia. i thought now having medical proof in black and white would make her back off when i was lethargic and/or oversleep sometimes, but alas, no!at the beginning i thought it was a cultural thing, her mother is sephardi moroccon and they have a reputation for this. but now i think maybe it's something a lot more deeper. we just don't work well together and we argue a lot. everyone knows her as a fun, outgoing warm and kind person, doing lot's of religious acts for the community etc. but i know her differently. ive noticed people naturally take her side and because of her bubbly personality and my adhd apathy, she comes across as happy and me that is depressed. she is convinced and telling people i am depressed but i know im not. i feel it. im stressed and disturbed, non-adhd people don't understand that procrastination, disarray and oversleeping doesn't mean you depressed.i just don't know if it's me that is easily disturbed or a combination of living with someone i can only describe as a drama queen. my biggest problem is that i know i have a disorder, and so now i can't trust my judgement of what is sanity or normal, she seems to fit the description like a glove, but it's only me that has said this. everyone loves her, but i just find her annoying and emotionally draining. if she has a disorder too then maybe it's time to get out while i can?? it's very confusing.Does anybody have any similar experiences? I feel like I'm being gaslighted without even knowing it. Is this just me, or does my wife need therapy? Should I get out while I can??ps. part of the reason also why i doubted her disorder was because she was also very accomodating (when she was not high-conflict). Books have been written about separating from a cluster B spouse but she was 'take all the time and space you need, i still love you and i'll waiting for you', she was even in high spirits the next day, singing to god etc. but now i just got a call from 3rd party, she is not speaking to me, and is throwing all my possessions on the street by first thing in the morning. so much for accommodating, guess my intuition was right."
    },
    {
        "name": "t3_4oj8xh",
        "created": 1466199332.0,
        "ups": 2,
        "downs": 0,
        "title": "I'm sick and tired.",
        "selftext": "My grades just got declared and they're a mess. My mother just won't believe that a thing such as adhd exists, and says that if I would've studied instead of wasting time complaining about it I would've gotten better grades. I tried hard, I really did.I've visited many doctors but only got laughed at (yes, literally) because these doctors couldn't believe I had adhd and still passed high school. I suppose that's my fault - should've visited psychologists not family doctors. You see, I live in India and believe it or not all the elders here are suggesting me to do 'Pranayam', hailing it as the next godsend cancer fucking curing miracle of life practice. Including my mother. She refuses to believe me.All this disbelief made me doubt myself. Maybe I really was a smart but lazy fuck who just likes to give excuses. However this was only until I consulted my brother - who has been practicing medicine in the U.S.A for the past 20+ years now and has a doctorate in child psychology - and he confirmed my diagnosis. He suggested strattera and things went alright until I started losing weight, lost apetite and overall felt very depressed. Quit that. We're both leaning on a stimulating medication option now - methyphenidate. But I can't buy that without a prescription.I don't remember if I was going to end this post making a point so I'll just end it like this."
    },
    {
        "name": "t3_55gise",
        "created": 1475405313.0,
        "ups": 1,
        "downs": 0,
        "title": "After a lot of thinking,I don't know what is this post about...",
        "selftext": "I don't know exactly when it started,but it was around 6 years ago.I started  having problem concentrating and would often find myself daydreaming and just lost in my own thoughts during classes.It wasn't that bad at first,I did pretty well during 10th grade and 12th grade wasn't that bad either in other people's opinion,but I knew I kinda performed below par and  felt like something was wrong.But it didn't bother me that much,as it wasn't that bad. Fast forward 3 years,I am in college. Me and a friend were doing an internship. My friend had borrowed a motorbike for travel and only I knew how to ride. The first day was ok,I didn't know the way to the place and he guided me. But, while returning,I realised that my mind was blank. I couldn't remember the way back. So he gave me directions. It was the same on the second day as well. On the third day,I just didn't ask him for directions and took wrong turns. He was kinda shocked/pissed and jokingly suggested that I must have dementia or something. At that point, I was really,really scared. I searched internet for my symptoms. And then I found that I have ADD.I have almost all of the symptoms-daydreaming,easily distracted,unable to follow instructions,losing my train of thought often and many more. I really dont know how I survived college,I didn't do well but it could have been worse. I sometimes I put a bit more effort though and played less video games. Anyways,I am here because I discovered this awesome game called Brain wars. It forces you to concentrate and I have realised just how bad I am at concentrating stuff. I am okayish at the game,but I have noticed that 'I' am not actually playing the game. Like I start concentrating and then I am lost in my own thoughts about how much I should score to beat,etc,etc ,but somehow there is this secondary brain or something. Like my hands automatically move. When I realise that I am not concentrating,I actually fuck up. I know it sounds crazy.  This also explains why my judgement stat is so poor. And I am not saying I have developed this ability thanks to this game. I have realised that actually this is how it has always been. Just that I have noticed it now. For example, there was not a single moment when I was not engrossed in my own thoughts,but somehow I would take the correct turns to class (of,course it took me around 2 weeks to develop the \"pattern\", I just followed other guys before that).So my question is does this game actually improve your ability to concentrate? If anyone has any experience with this game or any other game for that matter, feel free to share. Any other tips as well like meditation which can improve your focus even a tiny bit?Now,I know you guys would tell me that I should perhaps consult a doctor and take medications. But I don't want to. Here in India, there are not that good mental health facilities. And if you were to actually consult one, your friends and family would be scared of you and treat you like you belong in an asylum. I have seen one or two cases of depressed individuals who were treated a bit differently in college. More importantly, I don't want to depend on drugs my whole life. From what I have seen, the symptoms come back if you miss your dose. And they have a side effects as well.So,this finishes my rant,post,story whatever. Thanks for reading!"
    },
    {
        "name": "t3_5jep67",
        "created": 1482285824.0,
        "ups": 2,
        "downs": 0,
        "title": "Just got diagnosed, prescribed methylphenidates; what to expect?",
        "selftext": "So, after almost three or four years of fighting with my parents over this, I finally got them to take me to a psychiatrist. (They saw me physically unable to study before a test for a subject I detest and got worried when, consquently, straight-A student me bombed a test for the first time in my life.  *cough* \"Asian parents, huh?\" *cough*) The funniest part was when I began to drum something (some variations on the killer 7/4 intro to [this](https://www.youtube.com/watch?v=k-GUNcSWSko), I just realised) on the table absent-mindedly, to which the doctor said, \"That's a classic sign of hyperactivity.\" and I got to give my mom the I-told-you-so look to end them all. I feel so relieved to realise that it wasn't \"all in my head\". :)So I've been prescribed methylphenidates -- one is a 10 mg dose that lasts four hours (this is in the morning), and another is a sustained-release 10 mg dose for after lunch. (They don't call these Ritalin/Concerta in India.)What should I expect? Any FAQ links I'm missing? Advice?"
    },
    {
        "name": "t3_3qj7vz",
        "created": 1446047120.0,
        "ups": 3,
        "downs": 0,
        "title": "Taking a break from my PhD",
        "selftext": "Guys. I finally came out to my supervisors about my ADHD and the fact that I started medication a week ago (150 mg Wellbutrin). They have offered me two options: To stay on and continue my PhD programme or take a break for a few months and then return. Personally, I'm not sure. The break seems tempting because I can go back home to India (I live in Singapore, where drugs are highly regulated) and get myself on Ritalin immediately which would speed up my recovery; I really don't trust Wellbutrin. Any suggestions? Should I continue my programme and hope the Wellbutrin works in the six week probationary period they have me on to show I can perform efficiently? I'm so confused."
    },
    {
        "name": "t3_5rq7hj",
        "created": 1486105651.0,
        "ups": 1,
        "downs": 0,
        "title": "Got my meds today",
        "selftext": "I had posted earlier about having forgotten my meds in India before coming to UK. After a lot of procrastinating, got registered with GP. Went there today. He saw my 3 years history of depression and one month prescription of Concerta. Told me that in UK they don't fill a prescription unless a UK psych had been consulted. Then said he could see my history and so filled my prescription. So am good till March at least... "
    },
    {
        "name": "t3_34h0fr",
        "created": 1430474470.0,
        "ups": 2,
        "downs": 0,
        "title": "Went to the doctor yesterday about ADHD",
        "selftext": "I actually have numerous things wrong with me medically that I am kind of worried about including hearing problems in my right ear. I spoke to her all about these things first, and she did what she could for most of these symptoms. At any rate, when all of this was done I told her that I knew I had ADHD and that I would like to get help for it. She seemed completely clueless as to what she should say or ask about my ADHD and I wasn't very good at explaining it to her. All she could do was ask over and over again how I had such a good memory when I told her about my past. Is this a thing? Do some doctors think your brain falls out of your head when you have ADHD? She's Indian, not that this matters but, I heard recently that getting an ADHD diagnosis in India is impossible because they don't believe in it. So I'm not sure if it's her cultural bias. Another thing she said is that it was probably more likely that my ADHD was caused by my hearing problems. She also wouldn't get me a referral for a psychologist/psychiatrist, and insisted I find the paperwork from when I did have ADHD or get re-diagnosed. I was informed at this point that it would probably cost 3,000 if I were to get evaluated for having ADHD. This is unfortunate considering that my paperwork is all at least over 10 years old at this point. I'm really not sure what to do at this point, but I did find a therapist who is willing to do it for only 1,200. That seems like a really steep price for me and puts me far behind in a couple of my financial goals. :/"
    },
    {
        "name": "t3_13f9x4",
        "created": 1353314489.0,
        "ups": 2,
        "downs": 0,
        "title": "About to visit a psychiatrist for evaluation but concerned they might ask about stuff I don't remember?",
        "selftext": "First post - sorry if this is really long!Obviously I can't afford formal neuropsychological training (poor student at a greedy Ivy) but was told a 1-2 hour evaluation could be almost as useful. My worry is that though I meet a lot of the criteria for both ADHD-C, I personally have certain memory problems in general, and among these, very little memory of my childhood.Failing my own memory, I turned to progress reports. DSM-V will change the maximum age of presentation of symptoms from age 7 to age 12, but all the teacher comments I've been able to dig up before then have been very positive (and in general, I've never had to apply effort in school before college), though they often tend to describe me as creative.The weird part is, my parents and I distinctly remember at least my 2nd grade teacher giving me detention on a regular basis (&gt;1/week) for something or another, yet all her comments are beaming praises of me. My parents grew up in India and there's a bit of a language barrier (even though I speak my mothertongue) and my parents don't exactly remember the specifics of something that happened 11-12 years ago. My mom vaguely recollects that sometimes I'd be reading in class even while my teacher was talking, and that tended to set her off. I'm worried that maybe I displayed similar behaviors in other classes but because they were rarely overtly disruptive, and because I did so well in school, I was never considered as having a learning disability. Diagnosis of ADHD seems to focus really strongly on this childhood onset of symptoms - how would you recommend I bring this up with the psychiatrist I'm meeting on Tuesday? I don't want to be misdiagnosed as ADHD or non-ADHD if the facts don't line up.Thanks so much and I will be sure to update the community with what happens."
    },
    {
        "name": "t3_52ofsw",
        "created": 1473849611.0,
        "ups": 1,
        "downs": 0,
        "title": "I want to be an inventor, but I can't afford an education because of money problems at home. And I hate my job.",
        "selftext": "*Note: When I say \"work\", I'm referring to a shitty lesrning experience in enterprise application development at a family friend's company.* *Tired of doing useless work.* I'm at this weird point where I just cannot do my assignments at work, with or without meds. The guy who's supposed to be training me doesn't give me anything to learn. When he used to (last time was 1.5 months ago), the work was trivial, unimportant, and unchallenging. Using clunky technology to make clunky products for clunky, conservative clients. *My family is putting a lot of pressure on me to do this work I don't want to do.* (It's at a family friend's company and he gave me a great opportunity. But the workplace turned out to be where ambitions go to die.) *But I feel like I have to do it, because we need the money*. My mom's getting too old to work, and I'm getting too old not to. It feels soooooo unnatural doing other people's work and having a boss instead of what I deem important. *The Dream**If I didn't have to worry about money*, I'd like to self teach myself software development properly. Then I'd get a non-shitty job temporarily, and finish the websites/businesses I have been working on. After I'd have saved up enough money, I'd do a learning challenge where *I'd learn everything needed to be an inventor* (physics, chem, cs, electronics). Probably gonna break into some University casses and do some MOOCs. I'd work on projects once I had enough knowledge. The end. *Also, I'm training here until November in India. Stopped taking meds, because all they have is ultra-depression-almost-but-not-quite-suicidal Concerta and ritalin. When I get back to the USA, sweet functional Vyvanse!*Are tips or ways to make money so I can spend time on what I want to do?*tl;dr See the bold sentences*"
    },
    {
        "name": "t3_pdioq",
        "created": 1328584929.0,
        "ups": 4,
        "downs": 0,
        "title": "Questions from a Parent of  a 4 year old.",
        "selftext": "We saw a psychologist for our 4 year old and they think it is ADHD. They have asked us to put him on a Sugar Free/Gluten Free diet to see if he calms down ( seems to slow him down a bit).for any experts out thereThe Symptoms are:1.In ability to question things. He does not ask questions.2. wants to be physically active ( climb/jump/run) etc.My question(s):When we were in the US ( we are in India for a vacation), I thought that his speech / interaction was slow because he is confused with English and our mother tongue. Back in india , he seems genuinely happy with his grand parents and cousins. We are beginning to wonder if being in a larger community helps him to build his speech etc.Does any one have thoughts?"
    }
]