[
    {
        "name": "t3_ipd69m",
        "created": 1599674989.0,
        "ups": 8,
        "downs": 0,
        "title": "Having BPD in India is a curse",
        "selftext": "Hello there I am new to this page, I am 21 (F) living in India with clinally diagnosed BPD. I have always been pretty sensitive about mental health issues and living in India has made it so difficult. I can be really impulsive towards people who just have no clue about what the fuck is therapy and all these people know about is meditation. My parents recently found out about my condition and have just termed it as some stupid nonsensical stunt I am trying to pull off also asking me to meditate if that's what I \"Think\" I have.Recently, on an Instagram page a person posted about how his/her parents asked her/him to wake up early when s/he seeked for therapy. Most Indians think of mental health issues as just anxiety and depression and it's so sad and annoying at the same time. Ugh! It just gets so difficult not to act out but at the same time I know I am overreacting but I can't stop myself. Dammit."
    },
    {
        "name": "t3_jy3o4l",
        "created": 1605957740.0,
        "ups": 1,
        "downs": 0,
        "title": "I want to know the kind of invalidation people with BPD have faced from their Psychiatrist / Psychotherapist / Psychologist. And how did that make you feel at that time?",
        "selftext": "I have C-PTSD (not officially diagnosed because India, but I am sure of it). Had been diagnosed with BPD a month back. Thought it was mis-diagnosis. Until 3-4 days ago I checked all the 9 symptoms with a calmer mind, since now I DO have abandonment issues. I fulfilled all the 9 symptoms. *Trigger Warning: Passive Suicidal / Homicidal Ideations*Recently, after having been put on a mood stabilizer (also on two anti-depressant and anti-epileptic/tranquilized), my mood became better, only to plummet down two weeks later. I always had a destructive mind and self-harming tendencies during a panic attack; mainly hitting myself or banging my head on the wall. Now, intrusive thoughts in form of passive suicidal ideations have increased. Also, it freaked me out, when my thoughts had turned murderous. That freaked me out. Because I don't have it in me to harm anyone else. I would rather take the brunt of everything. *Trigger Warning ends*A friend, with her sister in the Pharmacy industry, said that it could be the side effect of my medication. And I should immediately talk to my Psychiatrist about it. I did. And it was awful. Gawd awful. I didn't not know the stigma attached to people with BPD. (Two of my closest friends have it, one of them being my best friend.) That day. No. No no no no no. The next day, I came to know from my mother that the Therapist told my Dad that's I am lying and it is all attention seeking behaviour. I made a list of the things Psychiatrist told me:1. Learn how to remain on one topic. Don't deviate. \"(I have a racing mind you dodo. My mind actually does not know how to remain on one topic. I have severe Anxiety.)*2. How can you call your father who has served in the Army and is a doctor a moron? *(This was when I called my parents morons off-handedly for being in denial about their own illnesses and for being stubborn. I told him that I don't think he was a moron, rather certain qualities of his which are moronic.)*You calling your parents moron is abuse. (Really? What about all the things I have been called since I were kid. Physical, emotional, verbal abuse for 20 freaking years!)3. Have you noticed you don't keep eye contact? *(Yes. I have been told. I don't know why. Maybe because I am trying to articulate what to say next. Maybe I get intimidated by the other person. Maybe I don't feel comfortable. Or maybe I am asking my other mind to shut up, and say the right things that are supposed to be said.)*4. These are not the side effects of the medication. Something else is wrong. Or something is up with you.5. You are not meditating properly. It will work. 6. Stop raising your voice and getting angry because this is not the place to do so. *(I do not know if he was purposely riling me up. I was losing my calm because he wasn't believing me when I told him about my flashbacks and my inability to mediate for the past 15 years. Or that I have this stupid inner voice, which I call my other mind, that keeps providing subtitles for every situation and over the years since I was a kid, I had trained myself to not acknowledge it and say what was supposed to be said.)*7. Do you realise you just contradicted yourself? *(Yes. I might have. I didn't have control over what I was saying. I was angry)* Is your father here? Bring him. I want to talk to him.*He also wasn't listening. Kept cutting me off.*After the session got over, for two whole days, I felt this sense of hopelessness and worthlessness I have never felt in my entire life. And that's saying something because my tolerance for *bad* is really really high. I felt dejected and frankly speaking, dead on the inside. I have been through 9 Psychiatrists / Psychotherapists in entire life. Never have I met one who does not listen. Here, I met two together. They just DO NOT BELIEVE. When parents, friends, relatives, acquaintances, strangers, doctors (who are not Psychiatrists) don't believe, I can take it. How do I take it when the Psychiatrist does not believe! I didn't understand if I was the one emotionally blackmailing or if I was being gaslighted. I waited for three days to post this, because I did not want to put up a rant. It ended up being a rant anyway. And I am still hurt."
    },
    {
        "name": "t3_hp93at",
        "created": 1594498867.0,
        "ups": 16,
        "downs": 0,
        "title": "My first time Inpatient: how I learned to advocate for myself",
        "selftext": "Hi everyone, I just got released from the hospital after the 72 hours. I signed all the papers to go in voluntarily so I could stabilize and get my meds changed in a safe environment. It's a long story about why I went in but I figured you guys could understand. I've recently been diagnosed bipolar and borderline.So, I was previously on 40 mg of Prozac, 25 mg Lamictal and 10 mg Buspar. Prozac and Buspar were part of my old \"anxiety and depression\" cocktail. The first psychiatrist I saw added 25 mg of Lamictal to my regimen after my diagnosis and didn't change anything else After that appointment, when I got home I felt great. For all of....2 days. My body got used to the Lamictal and from there on it was like eating candy. I kept taking the medicines hoping it would get better.From there, things kept going downhill. I ended up in one of the most severe depressive episodes I've ever had while also experiencing mild psychosis. I had a lot of outlandish thoughts like I wanted to build a makeshift boat and go to India, I wanted to get to Paris with a total of 60 bucks in my pocket, really weird stuff. Then I talked about hanging myself.The next day, my family had me go to counseling. My psychiatrist was contacted and told how bad things were yet refused to change my medicine and didn't call for hours. I was still in full blown crazy land so the best option was hospitalization. I agreed to it because I was so tired of feeling like I was.The hospital was great and I loved the doctors I saw. I remember answering tons of questions. Every single doctor informed me that I should not have been on any more ssris after my diagnosis. Before being diagnosed, I had tried 7 ssris with little to no success or worsening of symptoms. Also I was told the mood stabilizer I was on was gonna be way too slow working. The head psych doctor there reevaluated my whole med regimen and took me off of Prozac and Lamictal and she added Lithium and left me on Buspar which I do well with. I felt like a new person when I started lithium. It's been totally amazing so far. I have a checkup in 4 days to see my blood levels.I'm going to do all of my follow-ups with the hospital's doctors which I feel very good about. I feel like I can trust them and they have a lot of knowledge about medications as well as what each mental illness needs to be treated with. I completely cancelled everything else I had with the prior doctor.Overall though, I learned that it's okay to reach out for help. I also learned that I have to fight for myself when my medication is out of balance. It's hard when you're seeing some doctor that's second guessing you and then they leave you hanging when you're in a crisis.  I feel much stronger about advocating for myself after all of this.I just wanted to share because this community has made me feel like I belong. Maybe some of you can relate as well. I feel like everyone here is a friend and I'd love to hear anything you guys also want to share."
    },
    {
        "name": "t3_f886l3",
        "created": 1582485137.0,
        "ups": 295,
        "downs": 0,
        "title": "Splitting with hobbies/passions/places/jobs?! As soon as I feel part of a community I feel like an imposter and quit/run away...but I dream of &amp; long for connection &amp; finding my tribe..?!",
        "selftext": "Hey, I recently received a diagnosis of BPD and it’s really shining a light onto my past and why it’s all been such mayhem. It’s comforting and sad at the same time to be making sense of it all finally...(NB also diagnosed Bipolar2 but waiting for another psychiatric assessment to understand if this was a misdiagnosis or co-morbid factor...perhaps explains the ups and downs further if so. I’m not on medication.)I know about splitting with people and can relate to that but one of the things I’m wondering is also BPD related is my tendency to get obsessed with a hobby/activity or even place; thinking this is what’s going to save me/make me feel whole again/ the missing piece to my puzzle.....I put my everything into it and then as quickly as it started, I turn on it and quit/run away!It means I have had a very unstable life in terms of where I live, my jobs, my finances etc. There is no continuation of anything.Does anyone else relate? An example with places:I nearly bought a house in a random town recently which I fell in love with &amp; started spending some time in, and had all these fantasies of all the friends I would make but then suddenly it felt hostile and I realised how lonely I would be there, because surely no one would want to be friends with me....and I pulled out and retracted my offer &amp; haven’t even wanted to visit the town again since...I also spent 2 years traveling the world on my own and would get to a place, absolutely love it, feel at home, but as soon as I started to get to know the place and people I would feel so self-conscious and socially anxious I would cut all ties and leave again. The things I am desperately seeking in friendship and connection are what I end up running away from! Bulimia followed me around on my travels because of the desperate loneliness I felt. An example with jobs: I put my everything into getting a great job, landed it and made a great first impression with my work, awesome co-workers, great company etc. Then after a couple of months despite getting really good feedback and obviously a valued member of the team, I get crippling anxiety about going into the office; feel super self conscious, have panic attacks on the way to work thinking today is the day I will get sacked. So I quit! (This was 5 yrs ago and I’ve only worked for myself since lol!) An example with passions:I’ve been into yoga for years. At the beginning of last year during a good/stable patch I trained as a yoga teacher in India &amp; started doing some teaching when I got back to the UK. I practiced every day, it was my passion, I loved the philosophy etc. I go to classes to learn from other teachers. I was just starting to feel like a yoga teacher/part of the yoga community....Then I destabilize, stop teaching and I can’t bring myself to even get my mat out...for months 😔 The thought of bumping into someone I’ve thought or one of my teachers freaks me out because I feel ashamed and embarrassed of myself (perhaps partly because I’ve put on loads of weight recently too). I’m desperately hoping for this to come back because yoga felt like a life line for me. Actually this is the same with spirituality and health too (I also have bulimia)...I am either feeling very spiritual and healthy or completely disconnected and unhealthy. It seems to be that anytime I start to feel a part of a community...I get really anxious and run away... but at the same time I dream about connection and finding my tribe...! Always searching for somewhere to belong...but as soon as I find it...I freak out and I’m gone! I’ve just realised I’ve been chasing my tail my entire life!! 🙈🤦‍♀️🤣Can anyone relate?! Is there any hope of settling down?! xx"
    },
    {
        "name": "t3_haq3mo",
        "created": 1592425413.0,
        "ups": 2,
        "downs": 0,
        "title": "Long Distance Love",
        "selftext": "I am a feminine gay guy living in India and my boyfriend is from Switzerland. We're almost the same age. We've been through some stuff together. He lost someone very close to him this year but I couldn't go there be with him because of the lockdown. I have just finished a stressful work from home internship abd he has been very supportive with my work and career. He's set in his routine, he works out a lot and as a result is usually very sleepy. We don't get to talk on some days. Just a few days ago he told me he's required to get some military training and is required to join the army soon. I miss him so much. I miss him all the time. We had a fight the night before last night because he said something to me. We couldn't talk properly last night because I was crying and I didn't feel like talking to anyone. I just want to be in his big arms but that seems highly improbable in the near future. He's told me that he loves me and he wants to spend his life with me. He's also offered me to move to Geneva and live with him (but that can only happen when his grandmother is no more, she is very old and homophobic). I have been busy with my work but now that I am done with my internship, all I want is him. He has told me we can't be talking all the time or we'll get sick of each other or run out of things to talk about. I feel so touch starved but he's so far away. I really don't know what to do about it. All of this gives me severe anxiety. Any help would be highly appreciated."
    },
    {
        "name": "t3_ha8a0b",
        "created": 1592356696.0,
        "ups": 1,
        "downs": 0,
        "title": "Second generation kids with BPD",
        "selftext": "Hi y'all :)  I was talking with my psychiatrist and she told me that a LOT of patients she sees with BPD happen to be second gen immigrants. Wondering how many like me may be on this sub and if you feel as tho your upbringing at home, the country you live in and the resulting culture clash and shaky sense of identity has contributed to your BPD.In the motherland (India) I moved back and forth between relatives who could take care of me. Then I moved to Aus when I was a very young child and had to move homes and school numerous times bc of my parents jobs.There are numerous complicated factors but I truly feel that my parent's expectations from the old country and what the dominant culture expected of me majorly contributed in rending my identity apart. I.e. never having a true sense of belonging anywhere.I've reconciled myself with the fact that I'll never have a \"base\" anywhere and that's okay because I can make my own family through meeting like-minded people and simply trying to be happy in my own company, existing in a brain with so many overwhelming cultural paradigms. Feel free to share your experiences."
    },
    {
        "name": "t3_cq8q08",
        "created": 1565813077.0,
        "ups": 1,
        "downs": 0,
        "title": "[India] Indian culture and BPD",
        "selftext": "Hi All, New member here. I have a few close people in my life who show symptoms of mild BPD. (Now, don't start accusing me of internet diagnosis and such please) . I came here to survey what fellow members from India think about one of the theories that I recently started considering. Recently, feminists such as Rima Kallingal had talked about the discrimination that girl children face in Indian families. (Please google \"Fish fry + feminism + Rima\" for details) BPD as far as I know is more prevalent in women (correct me if I am wrong, not too sure about this, and I might be biased due to high number of affected people in my life)Also anecdotally it is not at all rare to find emotionally demanding and clingy girls in an Indian context. I think if someone from India watches the youtuber Laina (overly attached girlfriend) , they would find at least some situations that does not sound much exaggerated.So the theory is :  I suspect there is a link between how Indian girl children are brought up, the devaluation of girls' opinion in everyday family situations (such as the fish fry incident Rima talks about), and the abandonment fears , and the BPD- like symptoms in adult life. Of course everything is on a spectrum and I am in no way devaluing the horror that severe BPD sufferers had to go through like childhood trauma. But to me these Indian version of cultural causes and effect seem to align well with what I have read about causes and symptoms of BPD.Feel free to comment if you have supporting or opposing views."
    },
    {
        "name": "t3_gmj0gl",
        "created": 1589897631.0,
        "ups": 5,
        "downs": 0,
        "title": "Fluctuating Sexuality",
        "selftext": "I am 19 year old guy. This is awkward , I have led myself to believe that I am purely gay at age of 17 to deny parts of my sexuality. Yet I am technically still attracted to opposite sex in sexual mannor. I only dated men &amp; I have never been interested in opposite sex in romantic way other than one crush . It's been exhausting as I can't seem to grasp where does my sexuality fall in as I live in india it is rare to find out people &amp; my family is very keen on told you so dialogue that queer people don't exist .  I fear I can dream of a house with a guy but feat Is it possible that it is due to my BPD that I am attracted to same sex. I have even felt asexual time to time &amp; even felt gender dysphoria (which is a very heavy word to say) adds more heavy stuff on my mind . I barely seem to understand what is wrong with me. What to fix. I never felt anything wrong with my queer experience &amp; it feels so right.  But I feel extremely not right feeling attracted to opposite gender . It maybe internal bi-phobia or something. It is just habit of mine to break things into binary . Is it right or wrong that's all I sometime care about."
    },
    {
        "name": "t3_h7rxw6",
        "created": 1592020780.0,
        "ups": 3,
        "downs": 0,
        "title": "I (23F) show all major symptoms of BPD and I need help. How do I talk to my parents about it? I don't think they would understand",
        "selftext": "So, I lost my last relationship over BPD and I knew getting help was long due and I've come with the acceptance that I do desperately need help and DBT.I've had several issues in the past (2 years ago) and went to consult a psychiatrist who said I am emotional unstable which is basically the most common symptom on BPD. i talked to my mom about it but even though, she is an understanding person, she just didn't get it. She said I seem fine and it's just in my head and that I'm fine. I didn't go with the treatment because of this.Fast-forward present-day, I'm pretty much losing my shit and am majorly f-ing up my relationship and the symptoms have only gotten worse since my last visit to the psychiatrist 2 years ago. Its high time I get help because this is ruining my life.Also, In case you're wondering why a 23 year old adult need their mom's permission to go with it... Well, that's how shit works in India, and also, I was about to start earning this year but ya know, coronavirus.. So, I would also be depending on her financially for the treatment.So, any tips on how to go about convincing my mom about this? She knows I have anger issues. She is very understanding in general and tries her best. She just doesn't know much about this and in general thinks I'm doing great."
    },
    {
        "name": "t3_dqwpeo",
        "created": 1572790457.0,
        "ups": 256,
        "downs": 0,
        "title": "The child who is not embraced by the village will burn it down to feel its warmth",
        "selftext": "The whole thing that makes me hate having BPD is the trauma. Most of us with BPD have had some sort of trauma in our lives. In fact, I think it's safe to say that almost everyone has had some sort of trauma in their lives,  regardless of a serious mental issue. I hate my diagnosis though because I feel empty. I feel empty even though I'm still better than the billions of people starving and dying from disease. Will any of them even get a chance to know that they have BPD? Is it selfish that my resources allowed my diagnosis, and I still wallow in my emptiness everyday? I could go to Mumbai and see Mukesh Ambani's house (check it out) towering over one of the biggest slums in all of India and not feel a thing. While it is of course a beautiful sight from a design and art POV, and also a disgustingly gluttonous display of wealth, I would see that view and only think of myself and see that I am a metaphor for privilege, that same privilege that makes me a tower compared to all the kids who die every single day. I feel empty, and that makes me feel guilty.I feel empty when I steal from my parents and friends, but I feel guilty when I ask for love. Then I get angry at the world because I asked for love and no one could give it to me the way I want it. And for those who haven't been initiated into who I am, I try so hard to be my best person, yet there's a bubble placed around me. If you met me, you would probably atleast acknowledge my intelligence and my humour. I am around so many people all the time, and I have good friends, but even then I feel so disconnected. I get paranoid that everyone is trying to keep me out of something. I have not found even one person that I would give to them as much as I would take. I used to have that feeling in my heart all the time, the instinct that I wanted to give myself away, but over time, thru more pain and being taken advantage of, that instinct left me.But why do I expect good things when I'm not good? I see others who act worse than me, but they come from better families and are better looking. They get the things I want, and that's when I feel the worst feeling ever; lost. Thru time, as I mature, I remind myself that things are always in the grey. However, this trauma always forces me to see things in a more extreme light. It's either \"yes\" or \"no\", \"high\" or \"low\". . . Even when I find myself in a situation surrounded by people who want to help me, the smallest comment of criticism can create a monster in me.My parents are my only support system, but they are also partly the cause to my issues today. I come from a conservative household where being a student is all that counted, and I could never enjoy the innocence of my own age because of an overbearing mother and a violently angry father. I had problems as a child, but I didn't have the maturity to understand my feelings. Music was my respite, my way of getting my feelings out, which they could not emotionally support either. Funny enough I decided to become a musician when I got older. While the start of my career was really promising and fruitful, I kept being taken advantage of and also never really found my \"group\" within the industry. So while I never wanted to be the stereotypical rocker burn-out type, it feels like my time has passed. There is so much history of emotional and physical abuse in my past that I act out from a place I can't tap into; it just overwhelms me. My parents always suggest that maybe I should choose a different career, but I've lost so much faith in myself I'm worried that if I got the money to go to school again or found a new path, I would squander it. And maybe I could squander some of their money as a f\\*ck you to them, but I'm also painfully aware of my actions and the implications on a grand scheme. I could squander the money; that same money that someone else could use, and use it well. Why do I have any value if there are others who might actually do some good with what I have. . . Now both my parents and I are in pain. I can be really cruel sometimes and tell them that they're only helping me to cleanse themselves of their mistakes, and other times I just cry because this pain I have is so deep that I don't even know what makes sense anymore. How much trauma can my trauma create?"
    },
    {
        "name": "t3_ews579",
        "created": 1580522145.0,
        "ups": 1,
        "downs": 0,
        "title": "I’m fucking over it.",
        "selftext": "I’m over my life. Fully and completely. I have a fiancé. I’m not sure I want to marry him. He’s a great person and I do have fond feelings for him, but at the same time I want to leave him. He took an almost 5 month break from his corporate job (fully paid as a disability leave) for “anxiety” issues. But I feel like he’s abusing the system and doesn’t want to work. I can’t be with someone who is so unreliable. I’m constantly terrified of him losing his job, as he makes twice what I do. He’s been back at work for three days and called out twice. He says I need to understand that he’s sick, understand what he’s feeling.Meanwhile I’m in so much pain that I need surgery to remove a blood and fluid filled Fallopian tube. I have type one diabetes. I’m on super strong antibiotics that make eating a fucking nightmare. I vomit routinely. Yet I show up to work every fucking day, feeling like physical shit and literally wanting to slit my wrists at my work station. I constantly go from thinking we are going to be together forever to hating him. And back again. He says I’m jealous that my work won’t support mental health disability. He needs it. Nobody can understand what work makes him feel. He went through several psychiatrists until he found one that would write him out of work. I can’t get psychiatrists to work with me because I have BPD. I wish I had the luxury of doctor shopping.  When it was time to go back to work he “relapsed” and his anxiety came back. His doctor told him is because of the generic brand of meds they gave him. They’re made in India. Obviously that means they’re shit. Gotta get on the American stuff. That’s the only one that will work. I work in pharmacy. I know that’s not how it works. Some people are sensitive to the additives in some generics, but to say only the “American” one will work is horse shit. I literally have so much anxiety around phone calls that my mother is handling all of my health issues right now. I’m 30. I feel pathetic. I’ll never be independent. Financially or emotionally. I work ALL the time. I don’t know how I do it and how I still have a job. I’m so emotionally checked out. I make mistakes all the time. My boss hates me (and ofc that might just be in my head bc I am nuts). I’ve been passively suicidal for months now. Recently the feelings have amped up. Everywhere I turn it feels like I’m being given signs that it’s just my time to die. I have dreams about cutting myself. It’s been 10 months since I last did. I miss it so much. I told my psychiatrist and she upped my abilify. Big fucking deal. I can feel myself really starting to spiral now. As I mentioned, I work all the time so I can’t find any time to go see a therapist. The last time I saw my therapist was December. We’ve been working together for three years and she told me I need to start seeing someone else. She said it’s because of personal reasons in her life, but of course my stupid mind took it as more rejection and I sobbed for an hour in my car. I feel really and truly pathetic. I feel like a caged animal: panicky and about to lash out at someone. I don’t know what to do anymore. I want to be dead. I told a coworker that and she thinks I’m joking. No. I really want to die. If you can’t tell, I’m a “quiet” pwBPD. I don’t lash out at others often, but I usually take it out on myself."
    },
    {
        "name": "t3_5syrso",
        "created": 1486656447.0,
        "ups": 2,
        "downs": 0,
        "title": "Private inpatient DBT clinic, preferably UK but Germany, India or Thailand all considered",
        "selftext": "Hi,I (44m) don't have a diagnosis but reading lots has brought me to make the appointment to get checked. Years of substance abuse, suicidal thoughts and destructive behaviour have ruined my marriage and harmed my wife and children deeply. Next step (assuming diagnosis) is to go away somewhere. English speaking would be best but German a possibility. Does anyone have any experience of 3 month residential treatment options? Looked at Thai rehab which seems like it might fit (mindfulness, intensive CBT, hopefully prevent return to alcohol abuse) but not sure if it is the best option. I stopped drinking before Christmas but know I could go back to it if i don't learn better coping techniques. I've seen a klinik in Berlin doing DBT and some others in De which treat BDP but reports would be good to hear. "
    },
    {
        "name": "t3_clps83",
        "created": 1564905973.0,
        "ups": 14,
        "downs": 0,
        "title": "I can't deal with the dark side of the information age.",
        "selftext": "Trigger warning for everything triggering I could think of right now Last night a guy killed 6 people among them a 10 year old boy and his ex wife and mother of the one person he spared, a2 month old baby. Now I'm reading that 2 little girls under 3 were raped and kidnapped and killed in India in under a week. El Paso happened too though I've managed to isolate myself from that. I just don't know how to deal with all this, I'm literally crying now and I love everything the internet stands for, knowledge and connecting people and shit but I don't want to know about these things and I can't separate myself from that shit because it's so pervasive now, every other headline is dark and that's without the climate change predictions lol. How do I cope with such extremely emotional news? Not even people with normal emotional responses could stay normal with the situation going on, but how does a person who can't control emotion deal with this shit? Short of cutting my Ethernet cable and throwing my phone in the toilet, I don't know how to separate myself from this, but I need the internet because everything I do, everything I want to do for a living is on the internet. I mean, how do I stay normal when someone beheads a 3 year old? Why is the world like this, why do people like this exist? Why was I forced to live in this world why do I exist why can't we just die of sadness because at some point the sadness should kill you because at one point there is nothing that can overcome the grief. What can possibly make me feel better if I have pictures of a 3 year old baby gang raped by grown men? Why can't I just stop. Thinking about things? We always say we got desensitized to violence but we didn't, the threshold just changed, the moment we are desensitized to beheaded babies is the day we should all just be flattened by the moon."
    },
    {
        "name": "t3_e5yvxh",
        "created": 1575493296.0,
        "ups": 5,
        "downs": 0,
        "title": "Forever alone",
        "selftext": "I feel like an unfunny version of the meme.With the seasonal affective disorder kicking into high gear, even being highly functional BPD is worthless. It is \"cuffing season\", and I can't even get an online date from one of those guys who target plus size gals because \"they are so grateful for attention they will do anything to please\". I am not a troll!: When \"gussied up\", I am a solid 6 or 7. I have a good sense of humor and make people laugh. After years and years of therapy, most people don't notice my BPD I am warm, empathetic, affectionate, and supportive. I love football, baseball, hockey, and NASCAR. I'm a geek and nerd, who hates rom-coms I am a goddamn catch.And still I can't get anyone to be interested in talking to me on March or OKCupid. I mean, yeah I have 3 strikes against me (37 years old, 5'8\" and 265lbs, don't want to have my own biological children), but there has to be SOMEONE who would value me. My friends and family say I am a catch, and they helped tweak my profile. But everyone they know in my age range (27-47) is married or gay.I am so fucking lonely, I can't stand it. It is NOT the \"most wonderful time of the year\". I HATE being the 3rd/5th/7th wheel at activities, get togethers, outings, and parties. I hate watching everyone snuggle and give each other presents. Those suicidal thoughts I have managed to put on the backburner are coming forward big time during the holidays. I am touch starved: I haven't been kissed or even properly hugged (longer than 2 seconds) in 3 years. My last serious relationship ended 7 years, 11 months, and 25 days ago when my emotionally abusive husband left me. (Yeah, you read that right, my dear of abandonment had me debasing myself for a narcissistic awhile who took out his inner turmoil about being a closeted transgender woman on me).the sex was over long before he left and I haven't had sex in so long I have cobwebs growing in my crotchAll around me is love, affection, family - and I don't even have a Favorite Person, much less someone to share my highs and lows with. I can't handle the thought of being alone another 50-60 years. I honestly have considered seeing if there is such a thing as a mail order husband. I figure there is a dearth of women in a China and India, SOMEONE is out there for me.Fuck"
    },
    {
        "name": "t3_dqwygi",
        "created": 1572792473.0,
        "ups": 3,
        "downs": 0,
        "title": "The child who is not embraced by the village will burn it down to feel its warmth",
        "selftext": "The whole thing that makes me hate having BPD is the trauma. Most of us with BPD have had some sort of trauma in our lives. In fact, I think it's safe to say that almost everyone has had some sort of trauma in their lives, regardless of a serious mental issue. I hate my diagnosis though because I feel empty. I feel empty even though I'm still better than the billions of people starving and dying from disease. Will any of them even get a chance to know that they have BPD? Is it selfish that my resources allowed my diagnosis, and I still wallow in my emptiness everyday? I could go to Mumbai and see Mukesh Ambani's house (check it out) towering over one of the biggest slums in all of India and not feel a thing. While it is of course both a beautiful sight and a disgustingly gluttonous display of wealth, I would see that view and only think of myself and see that I am a metaphor for privilege, that same privilege that makes me a tower compared to all the kids who die every single day. And much like that tower, I would mostly be vacant. I feel empty, and that makes me feel guilty.I feel empty when I steal from my parents and friends, but I feel guilty when I ask for love. Then I get angry at the world because I asked for love and no one could give it to me the way I want it. And for those who haven't been initiated into who I am, I try so hard to be my best person, yet there's a bubble placed around me. If you met me, you would probably atleast acknowledge my intelligence and my humour. I am around so many people all the time, and I have good friends, but even then I feel so disconnected. I get paranoid that everyone is trying to keep me out of something. I have not found even one person that I would give to them as much as I would take. I used to have that feeling in my heart all the time, the instinct that I wanted to give myself away, but over time, thru more pain and being taken advantage of, that instinct left me.But why do I expect good things when I'm not good? I see others who act worse than me, but they come from better families and are better looking. They get the things I want, and that's when I feel the worst feeling ever; lost. Thru time, as I mature, I remind myself that things are always in the grey. However, this trauma always forces me to see things in more an extreme light. It's either \"yes\" or \"no\", \"high\" or \"low\". . . Even when I find myself in a situation surrounded by people who want to help me, the smallest comment of criticism can create a monster in me.My parents are my only support system, but they are also partly the cause to my issues today. I come from a conservative household where being a student is all that counted, and I could never enjoy the innocence of my own age because of an overbearing mother and a violently angry father. I had problems as a child, but I didn't have the maturity to understand my feelings. Music was my respite, my way of getting my feelings out, which they could not emotionally support either. Funny enough I decided to become a musician when I got older. While the start of my career was really promising and fruitful, I kept being taken advantage of and also never really found my \"group\" within the industry. So while I never wanted to be the stereotypical rocker burn-out type, it feels like my time has passed. There is so much history of emotional and physical abuse in my past that I act out from a place I can't tap into; it just overwhelms me. My parents always suggest that maybe I should choose a different career, but I've lost so much faith in myself I'm worried that if I got the money to go to school again or found a new path, I would squander it. And maybe I could squander some of their money as a f\\*ck you to them, but I'm also painfully aware of my actions and the implications on a grand scheme. I could squander the money; that same money that someone else could use, and use it well. Why do I have any value if there are others who might actually do some good with what I have. . . Now both my parents and I are in pain. I can be really cruel sometimes and tell them that they're only helping me to cleanse themselves of their mistakes, and other times I just cry because this pain I have is so deep that I don't even know what makes sense anymore. How much trauma can my trauma create?"
    },
    {
        "name": "t3_cb145o",
        "created": 1562708928.0,
        "ups": 4,
        "downs": 0,
        "title": "So a friend recently said...",
        "selftext": "So a friend recently said I must not tell anyone that I have BPD as that lowered my chances of getting married which is a big thing in India. Strangely, all that I have shared with about my disorder have been very much supportive except for this one oddball. Is it really that bad having BPD, like AIDS/HIV that it should be concealed from your own people? I am not even sure if I want to marry or not but something like this discourages me certainly. I don't want to be discriminated against but then maybe I have already been differentiated from by nature itself."
    },
    {
        "name": "t3_8zw7gc",
        "created": 1531954667.0,
        "ups": 7,
        "downs": 0,
        "title": "Ayurveda and BPD",
        "selftext": "I've been learning about Ayurveda for awhile. I just found this [page](http://www.konquerdepression.com/2011/12/ancient-india-ayurveda-borderline.html) online that explains BPD with the ancient Indian medicine system. Is any one else into this and has anyone worked with Ayurveda to treat BPD? Unfortunately it doesn't seem possible to find a safe version of  Smritisagar, the herb/mineral compound that eliminated symptoms for this person. Anyway I thought it was helpful to read about BPD through a different system of healing"
    },
    {
        "name": "t3_bhguv3",
        "created": 1556272663.0,
        "ups": 1,
        "downs": 0,
        "title": "I'm hurting because of revelations and I need to vent...",
        "selftext": "Between last Friday and now, I've fallen into some sort of abyss. The psychiatrist I've been seeing spoke to me about cultural stuff and the dynamics of abuse that can happen in Indian/South Asian joint families. I live with my parents, and my aunt, uncle, and their two kids came to visit for two days last week right after this session I had with the psychiatrist.&amp;#x200B;This aunt and uncle used to live with me when I was aged 11-15. I started to see the extent of the way in which they emotionally abuse their children. And then I realized that it wasn't \"my fault\"...these people were just abusive. And...I lived with other aunts and uncles at various points and they were abusive too. Also they were worse to me than they were to their kids because they had issues with my parents.&amp;#x200B;Then, on Saturday, out of the blue my mom started talking about her life and told me that she attempted suicide five years ago and that she had been molested by someone in the family when she was a child; then she wouldn't tell me who...so I have no idea who and am consistently wondering which one of her uncles were probably responsible. Then she started describing feelings of emptiness, not being able to recognize herself in the mirror, not knowing who she is, feelings of feeling unreal or not in her body...etc. All this time, my mom was the one stable one...but now I'm realizing, she was/is ill too. Moreover, her instability actually seriously hurt me. This is why she couldn't protect me. This is why I always feel like I can't tell her things but I've always been her \"therapist.\" She seems to have all of the signs of a disorganized attachment herself...because how else could she tell me that she tried to kill herself and say that to me with no emotion herself. My whole life I thought that I was bad for not being able to properly connect with her emotionally. I'm realizing that she's not connected to herself either. &amp;#x200B;I don't have one parent, one uncle or aunt, or one first cousin who doesn't meet criteria for a personality disorder, eating disorder, or substance abuse (I had a grandmother...but then she had schizophrenia). Not one on either side. And the past two days have been consumed by a cousin in India who took pills and then called me here in the US at 5 in the morning...as if we could do something about it...we couldn't do anything about it and that kills me. What's worse is that I'm not even sure how I could begin to set her up with help. Luckily she's okay...but now the parents have made it all about them and how horrible this has been for them and they don't want her to see a doctor.&amp;#x200B;I can't save any of these people. And, for some reason, ever since I was a little kid people kept expecting me to save them without asking me if I was okay.  And that's killing me. I don't feel like I can separate from them because I love them and any boundary will be seen as betraying them. On the other hand, I need to save myself somehow...and I feel hopeless....I feel like I'm in a bind. I feel like a bubble has burst. Although I can blame myself less now, I feel so paralyzed. Somehow it was easier to believe that it was just my fault; it was just not me trying enough. Somehow, realizing that I came from an extremely chaotic family system that hurt me and could not protect me hurts way more than just me being \"bad\" or \"defective.\" The pain was so great that I spent the last three days (which was basically my spring break) in bed crying, sleeping or binge eating. I'm so sad that it physically hurts."
    },
    {
        "name": "t3_92qmzd",
        "created": 1532850917.0,
        "ups": 6,
        "downs": 0,
        "title": "Long Time Lurker... Time to Introduce Myself!",
        "selftext": "\\*sigh\\*  If you like long rambling... here I am!  I am a 35/F happily married to a 44/M.  We have one human daughter and one cat and one fish.  We live in Western Canada and like to garden and enjoy outdoor living in our small oasis we planted from the sod up.  In my family, on the maternal side (which is the only side that matters to mental health apparently), EVERYONE has a diagnosis.  And depending on what it is, that's how you are treated.  Because you're In Treatment right? And Knowledge is how you Break the Cycle of Abuse right?  Oh boy, you don't know my family very well!  Did I mention one of my family members worked as a psychiatric nurse for 40-some-odd years?  Goodness, where do I start?  Now why am I here?  Well obviously maintaining one's mental health isn't easy.  I have more than enough ACE's to qualify for any doctor's quack experiments!  What's an ACE?  Oh that's just short for Adverse Childhood Experience!  If you have 1 or 2 or 3 of these things happen in your life before 12 years old, you'll supposedly be fine.  But if you have more than 3 or any combo of them happening simultaneously, you're high-class, quality fodder for a test study.  or as my dark sense of humor quantifies it, \"you're fucked up\".Google \"ACE test\" - NPR has a good online quiz on their website about it.  I have like, 7 different ACE's.  \\*golf clap, yay go me!\\* So?  what's the problem you say?  Just get a therapist!Ahhhhhhhh... how do I say this without getting jumped all over?  Therapy and all mental health stuff is one of my SERIOUS Triggers.  I cannot go to therapy... I have TRIED.  It is not healthy for me.  I have ruminated for months about WHY NOT.  I think I finally have an answer, though it is not an answer that will satisfy anyone who knows me IRL who is just like, \"Go see a therapist!\"  :-p  So when I was a tweenager, feeling those ordinary out-of-control tweenage emotions, Mom figured, hey I could use a counsellor to talk about my feelings.  Okay Mom - fun fact: I have Emotions about Things for Reasons.  If you actually resolve the problem by addressing the Reasons, you will find that I don't have Emotions about Things.  LALALALALA there goes my Mom again, finding me a new counsellor when I say, \"this doesn't work\".  You know why this doesn't work?  Because I ALREADY told you the Reason why I am a stubborn, defiant, pissy brat.  YEARS ago, Mom.  Don't you remember?  And you looked down at me and said, \"that has nothing to do with it.  you choose your attitude and you're doing this to yourself.\"  But of course, this Reason would actually require my own mother to:1) admit her guilt 2) force her to do something about it 3) live with the consequencesSaid Reason?  Oh, just that by the time I was 5-6, I had really HAD IT with my alcoholic father wreaking havoc on the family dynamic.  So I gave my parents some Solid Life Advice from a 5 year old, seeming to comprehend what TV, books and peers said was The Answer to my Secondary Problem (my primary problem being religion).  So I wanted him to either successfully go to rehab OR I wanted him to divorce my mom and move out of our house so I could move on with life.  Yeah I know.    Seems pretty cut and dry.  But of course, \"I wuuuuuuuuuuuuuuv your father and I forgive him,\" was always the standard.  Nobody cared that I had not forgotten, forgiven or was even given a consideration in all this.  I was and still am pretty infuriated about this prevailing attitude in society of \"who cares what the kids want or feel, let's just be adults and make choices and say 'too bad' if the kid cries due to the aftermath.\"If I had a penny for every time someone has started a sentence with, \"But they're your father/mother....\" I would have a trust fund large enough for Elon Musk to pedal me around in a rickshaw.They are my biological parents.  They abused me.  These are facts.  There is no wiggling around this.  Geez Mom.  Other women get divorced over really simple things like where and to whom their husband is rubbing his genitalia on.  Other people simply get divorced because \"they change their minds and aren't compatible\".  If people are allowed to divorce over really anything, well, a neglectful alcoholic who can't hold down a job and doesn't come home at night sounds like a Very Good Reason to hire a lawyer.  Oh right but thanks to an oppressive cult that Mom has become baptised into, we cannot be a single female-headed household.  Abused, Neglected, Disrespected, But Married! that's what we want ; Divorced we cannot have.  I'll rant about the religious aspect for only a moment.  Being in a cult as a child when your parent has converted means being ostracized, shunned, and brainwashed/unvalidated by any Adult you encounter, and it requires a lot of mental energy to secretly keep your own identity, while struggling with the confusion of, \"But what if all the Adults are right and I'm NOT good enough for God?\"  To add icing to this cake, my mom decided to keep me enrolled in public school the whole time - because otherwise I might cost MORE money.  ;) Meanwhile the other kids in my congregation were being home-schooled so they didn't have to deal with things like having every single item in your desk AND locker vandalised and broken, being ridiculed by the entire class and teacher over not getting any Christmas presents, and spending recess clinging to the tallest part of the tallest tree while the other kids threw rocks and dog feces.  So ... Mom thinks I just need a counsellor.  Okay, that's great until the counsellor realizes that, \"the broken things in my teenaged client's life CAN be fixed!  let's tell the mother this exciting news!\"  only to have their cute little therapist dreams crushed when my mother points out, \"My marriage is between me and my husband.\"  Nooooooooooo Mom, you might be married but now you have reproduced and brought another human into the world ; you DO have to consider their feelings too!  So we did this fun little therapist shopping thing.  I guess I went through about 5-6 of them before Mom got the idea that I just needed to be medicated.  That's what would fix my attitude - DRUGS!  See, Mom also had been trying to figure out what was wrong with HER.  And granted, there were definitely Reasons.  Good Reasons.  I will let y'all know now that she is FINALLY on a cocktail of pills that she depends on hourly for her definition of normal... but as one of her pills is thyroid medication, we don't know what we can blame on the mental illnesses since her doctors tried some extreme treatments that probably damaged her thyroid (if it was EVER working properly), large doses of Lithium and electro-shock treatment to be precise.  Anyway.  Mom's been in-and-outpatient, she's got a suitcase of pills like Hunter S. Thompson, and she thinks Medical Science holds the answer for me, too.  Yay.  Don't I sound excited?  And she has all the books I'll ever need, don't you know?  There have been stacks of mental health literature ALL OVER ever since I can remember, due to my mom's career field, and the family member who worked in mental health.  Because you know, reading a book on dysfunctional families and NOT following any of the advice sounds like it will make everything  better, right?  I can QUOTE parts of \"Walking on Eggshells\" and the DSM.  \\*shudder\\*  But ... Treating Your Mental Health sucks when every single moment can be referenced to a chapter in a workbook.  Did you fill out your tracking sheets yet?  Have you done that soul-searching?  Did you take your PILLS?!  Mom pretty much forced me to read everything and anything she could get her hands on, so I wouldn't \"feel alone\" about these feelings I was having.  I was reading fiction like \"Girl, Interrupted\" while trying to digest the jargon of medical journals.  I was being \"inspired\" by reading biographies of all the famous people who Might Have Had a Mental Illness.  YAY I'm just like Abraham Lincoln!  So rewarding....  I was taking my four-times-a-day doses of medication and keeping a detailed log of their side effects.  I took all the pills that the doctors and their drug reps could peddle, even the ones that could give you incurable leprosy!  YAY.  Sorry no leprosy, all I got out of that was a crippling effect of vertigo and a tendency to go into heatstroke.    But ... you know what?  trying to make my Mental Health a full-time job was exhausting.  And it didn't solve anything anyway!  I don't care that I feel this way, I care that I feel this way because \\_\\_\\_\\_\\_\\_\\_\\_\\_ happened and my Adults ignored my feelings.  Every Single Time.  You know what would solve my problems?  An Adult actually going, \"Wow, yeah, totally if we do A, B, and C, this would make a real difference in your life!\"  As you can guess from my username... none of my Adults came through for me on that.  That's so nice that everyone wants me to practice coping skills while NOT removing the stressors in life.  Plus don't you Adults realize that I also have to somehow go to school, do homework, take care of all my pets, do my chores and take care of my asthma before I deal with my Journalling and my Self-Care? HA!  Plus feed myself and sleep.  You don't do any of that anymore.  Yeah teaching your child coping skills for toxic stress so that you can continue with Your Personal Status Quo is just... unbelievably fucked up IMHO.  But some people call this Parenting.Anyway, I finally escaped and immigrated to Canada.  So excited to leave the medical records behind!  Mom wanted me to pay $5 a page to have them transferred to my new doctor's office.  I laughed and changed the subject.So therapy and treatment and workbooks just make me ANGRY.  I rage far too much as it is.  Today I lost my mind over a newspaper article - an injustice done to a complete stranger in a different town!  Not my circus, not my monkeys, but too damned late for my blood pressure.  I do not want to talk to someone who has NOTHING to do with the situation about how I FEEL about it!  And I have to remind myself ONE MORE TIME that the angry ramble is from my past.  I have nothing to fear but fear itself.  Cue another motto and tagline from a well-read mental health book.I personally have come to the conclusion that the only cure for my BPD, if there is indeed one, is to become Buddhist.  I kind of giggle about how Marsha Linehan has made her CAREER out of basically translating Buddhist readings into Western mumbo-jumbo that is easily digested for people who cannot or do not want to conduct the Hard Work that is spirituality.  Not that I am being NEGATIVE about this at all!  I just think it is far beyond ironically amusing.  I came to this conclusion while meditating in the Buddhist area of our local museum, trying to refresh my energy levels and suddenly it was a flash of enlightenment LOL  Life is suffering.  Suffering is desire.  Alleviate the attachment to desire and you alleviate the suffering.  Take out the mystical esoteric B.S. and you get the basic core of distress tolerance skills.  Life sucks, we have little control except how we choose to react to a situation.  I mean, I'm not saying that people who live in a Buddhist country don't have mental illness!  But I want to think that the constant and ever-present skill of mindfulness is much more actively practiced.  I mean that is kind of how yoga eventually became all trendy and popular, isn't it?  It became a way of life to enough people who went to India and learned yoga, that it became a Thing to Do in Western culture.  Now I try to make sure there is a visual of Buddha in my life at all times because it easily brings me back to that calm mental space of compassion and self-acceptance.  so. much. mindfulness.  it's still exhausting but it doesn't come with a checklist or an appointment or bloodwork.I even tried going to a therapist here in Canada.  But again, therapists can't interfere in your toxic relationships, help you manipulate your Abusers, or do anything but ask you, \"and how does that make you feel?  What are your goals on that topic?\"  and the last and final straw for me was when the therapist wrote down a helpful list of books I should take a look at.  Oh look, my Childhood Textbooks! Yes reading more triggering material TOTALLY will make this better!  Wouldn't it be nice if instead of \"Mental Health Awareness - text 09876 and donate!\" campaigns that happened annually, it was just standard workplace procedure to attend a Tai Chi class before clocking in?  Wouldn't it be nice if instead of your managers demanding, \"No personal cell phones\", there was binaural music in the background of your office?  And actual sunlight available in your break room?Wouldn't it be nice if more meditation spaces existed in middle/high schools rather than competitive sports that celebrate aggression?So ... if I go on an angry rant... please just listen to me.  The best way that I have found to tackle my mental health issues is to figure out \"WHY\" people did these things to me.  If I understand their pain, I can lift that wet blanket off my back.  I feel like the knowledge releases the negative energy associated with the pain, and once I am not as attached to the pain, I can accurately shift blame from myself to the other person.  If I'm not holding their pain, it doesn't need to weigh me down. IT WAS NOT MY FAULT.  IT WAS NEVER MY FAULT.  I am a simple ant caught in the force of a garden hose.  I will happily provide internet hugs and brownies when people need it.  Thank you for reading all of that... if you managed to.  "
    },
    {
        "name": "t3_82oc4e",
        "created": 1520458978.0,
        "ups": 7,
        "downs": 0,
        "title": "General Advice for Long Distance Relationships?",
        "selftext": "Relationships in general are hard for me because I'm very insecure and of course having bpd doesn't help relationships go smoothly. However, I'm currently in an LDR and I really really want to make this work. Does anyone have any general but bpd-specific advice for long distance relationships? (I'm 21F in USA and he's 20M in India if that info is needed lol)"
    },
    {
        "name": "t3_acfust",
        "created": 1546615855.0,
        "ups": 1,
        "downs": 0,
        "title": "My wife is diagnosed with BPD , I want to understand my approach towards it , Pls help ..",
        "selftext": "Dear Friends , &amp;#x200B;I got married one year back to this amazing girl , it was a arrange marriage stuff (As it happens in India) , I am truly and genuinely love with her .  &amp;#x200B;After a month of marriage we started having argument on smallest of things , at first I thought it is something to do with adjusting with each other .But soon the arguments started getting bad to worst , at first I thought she is overreacting to every thing, every time i try to put my point of view things start to blow out of proportion , she also started abusing me verbally and physically , I became clueless on how to control the situation , I also spoke with her family about it but as per them she has always been aggressive but never been abusive or physical abusive with anyone , when I started to understand about  ,why she is reacting like that she said it is because of my family , my mother and my sisters interference in our family . Which was never the case. Just to be more clear , before marriage she was very close to my family as well , she use to talk to them more than me and be always available for them , she used to do things for them which was not even expected for her , everybody was very happy that we are going to make a wonderful couple , I was confident as well , but in no time things changed drastically as described&amp;#x200B;In order to find solution to this situation , i started meeting with various Psychiatrists, she also agreed to meet with them as initially i though we should start taking marriage counselling , we started having counselling one on one with psychiatrist . After that I came to know that she is suffering from BPD, after meeting with various psychiatrists and all coming up with the same answer , i started reading and understanding about BPD, I became aware about her situation but I'm still clueless on how to respond when the crisis happens . She is accusing me of things I never did or never  intent to do . She thinks I might go back to my old girlfriend whom i have not contacted in years. She also thinks my family is trying to create misunderstanding between us , but the truth is I rarely talk to them.&amp;#x200B;I need you help and support on how to handle the situation , do let me know if you need any more insight on this situation &amp;#x200B;"
    },
    {
        "name": "t3_89sql0",
        "created": 1522899714.0,
        "ups": 2,
        "downs": 0,
        "title": "I'm spiraling down and I don't like it",
        "selftext": "Hello,Alright, this is gonna be a bit long. I've been trying to deal with things on my own, and I thought I was at last getting better and being happy, but I was wrong. I've been trying to pin-point what could have caused it, and here are my guesses:1) I've lost my job mid-March, and although that was because of funding issues and 2 other people were laid off as well, I can't help but think it's because my worst fears turned out to be true: that they secretly really believed I sucked and was a waste of human flesh, and jumped on the first occasion to get rid of me. I had a bad nervous breakdown around November (after a terrible break-up, end of a bad relationship) where I took about 5 weeks off to get treatment and take a vacation. 2) I came back 5 days ago from a 2-weeks vacation I took on a whim to India after losing my job. I thought I was getting back to normal, it was sunny, I was happy, active on social media (new found interest in photography...) which meant ego boost from likes/comments, but the last few days there, I started thinking about my ex again on and off, made me teary a few times, and since being back I can't stop crying at random times and have been staying in bed since I don't have to go to work or really do anything. I have trouble feeding myself, and just crave alcohol instead. I was planning on traveling more, but all motivation went to hell.3) I know this is really stupid, but I think the fact that I realized a few days ago that my ex doesn't follow my spotify playlists anymore has triggered this whole downfall. My ex has me blocked on everything (even deleted/deactivated FB since breakup), and has a new girlfriend (that they met right after we broke up, it hurt really badly that they could just hurt me then move on as if nothing happened). But for some reason, the fact they hadn't stopped following those playlists was a little sign that we were still a little linked somehow, and now that's gone. (I know this is really stupid, I hate myself for being like this)4) We had a little bit of a rough patch with one of my friends. We had this intense bond, she said several times that she was obsessed with me, would buy me stuff all the time, and would come hang out anytime I needed her (but maybe I took her a bit for granted?). I made the mistake of trying to date her and we had sex a few times... My feelings were confusing, especially because of the breakup with my ex that was fresh and left me really vulnerable (and crazy unstable). So when she announced she was getting a girlfriend I flipped (we had said we'd just be friends), especially because it was someone who hated my guts, and my friend kept on talking about her negatively, emphasizing the fact she was manipulative. I felt abandoned at the time, and asked her to give me some space. I gave the silence treatment for a few weeks, and it was like a switch: I went from wanting to hang out with her all the time, to not wanting to see her at all. However, when she'd want to talk or meet, it would be okay, and I thought we could be friends even though I knew it would never be the same again: I was getting annoyed at the fact she wasn't responding to my texts as quickly, couldn't hangout as much anymore, etc. A few days before I went abroad for the vacation, she called me out of the blue which I thought was nice (we hadn't really seen each other much or talked). But she then had to make it weird: a day later, she texts me saying I should know her calling me was a mistake. I was really confused. Turns out she was afraid I would get the wrong idea and that things were getting serious with the gf. I found that preposterous, so I told her I didn't have that idea at all, and that I knew we were just friends and hoped things would go well with gf. I was a bit pissed she'd think that, but whatever, I didn't make too big of a deal out of it.However, when I come back from the vacation, I realize she's removed me from her FB list and spotify (music was a thing between us, she'd follow my playlists and know I'm alive based on what I listen). I messaged her from my computer, it didn't say delivered, which made me think she blocked my number too. I sent a few FB messages asking her about it, but didn't give her the chance to reply and just blocked her everywhere. I never want to hear from her again. She was actually bad for my mental health (as an FP I guess), also addicted to pot so I would smoke quite a bit in her vicinity, and Idk... I do miss what we had if I'm being honest with myself.5) TW: self-harmMy intrusive thoughts and images are coming back, and they're more gruesome than ever. Now they're about me slaughtering myself rather than just slicing my wrists, like wtf?!6) I'm really lonely. I've been meeting people off tinder just to meet more people, but the ones who stop responding make me feel like shit. I want sex and fantasize about being promiscuous with random dudes even though I'm gay, and that's not really my thing. At the same time, I find myself disgusting and just want someone to kill me.7) I don't know what to do with myself. I really want to go back to school because working has been a catastrophe and has disgusted me from my field (scientific research). I keep on thinking about different alternatives: either go back to France to finish medical school (I'm french living in the states), or stay here and do a masters in CS. My parents support me going back since they're the ones who pressured me into doing med in the first place (they're both physicians). I actually wanted to study literature/linguistics/languages/philosophy/writing as a teen. Now, I'm stuck with an unfinished french med degree, a bachelor in both biochemistry and philosophy, and no idea of what to do next. The only thing I could have seen myself becoming in medicine is a psychiatrist, but I'm unstable myself and hate the psychopharm industry, so what's the point? I thought about psychology instead? I'm so lost, I hate myself.8) I don't have health insurance anymore and said good bye to my therapist before leaving to India (against her advice). She was the first ever therapist I've been to (at age 25...), and even after 6-months I hadn't been able to establish trust and talk about actual problems. I'm not on meds because I stopped them months ago they had been prescribed after the Nov. breakdown (didn't want to get my brain chemistry to be even more imbalanced or addicted). I just want to go back to at least being able to fake being normal like I used to do. Now, I can't even pretend anymore, I've let myself go too much.How can I stop feeling this pain and void in my heart? It's crushing. I was going to send \"I hate you\" by email to my ex (with more words but you get the idea), and it's taken everything in me to refrain from hitting send. They probably hate me and laugh at me with that new gf of theirs... I want them to know what they did, it's so unfair that I have to suffer the consequences of their shitty actions and they just get a free pass. They broke me mentally and emotionally, even sexually, and now I should just get over it? I wish I could but obviously I haven't been able to. So what should I do? I need help, but Idk where to turn. I feel so dumb for everything I say, think, do, feel...."
    },
    {
        "name": "t3_6qkym2",
        "created": 1501489142.0,
        "ups": 1,
        "downs": 0,
        "title": "deliberating suicide",
        "selftext": "Hi guys , I couldn't talk myself out of killing myself , everday i struggle to talk myself out of doing itCurrently i told all my family , friends , my therapist and my ex gf .Little background , i thought i could create a world for myself through sheer determination .The money i was expecting didnt comethrough say like about 10 years , then i fell in love with this person and she left me .Now i do have a job which pays good money and along with my bpd my therapist has diagnosed me with clinical depression .because of all this i couldn't do my job once i lose it i have to go back to india.The dream was to become someone and marry the women of my dreams .I pressurized her and now she left me .i dont know the purpose of living this life , i want my tomorrow to be better than my today and the way im in really scared that i would screw up the great opportunity thats offered to me .Let me know your thoughts and i thank everyone "
    },
    {
        "name": "t3_7i7juz",
        "created": 1512692562.0,
        "ups": 2,
        "downs": 0,
        "title": "Best friend has BPD. How to help her?",
        "selftext": "Hi, I am 27M from India. My best friend 26F was diagnosed with BPD 3 years ago. Here's the timeline:-We have been friends for around 10 years. Three years ago she tried to commit suicide because of a family fight. I later came to know that she has tried earlier too. After that she saw a therapist for a short while but left because she has a crazy work schedule. She got married after that, cheated on her husband who was kinda sorta dick. Now they are separated. She smokes, drinks more than she can handle and then makes out/ sleeps with people she is not supposed to do that with. I have asked to her to quit smoking multiple times and we even had a fight over it and didn't talk to each other for two months.She says I am the closest person to her and she tells me everything. I did try to support her and was always ready to help her at any time. But as we got closer, I sometimes feel like like I am being taken for granted. She is impulsive, wants to do everything exciting and runs after anyone who praises/ flirts with her. And sometimes these things make me resent her very much. There are times when all her actions make me wan to cut off all ties with her just so that I can get some peace cause I am always worried about her.I wan to help her what should I do? P.S:- I came to know a couple of weeks ago that she was sexually assaulted as a kid and her family did nothing except move houses."
    },
    {
        "name": "t3_4dggx6",
        "created": 1459892666.0,
        "ups": 3,
        "downs": 0,
        "title": "Possible to manage BPD without meds?",
        "selftext": "I am have both BPD and Bipolar II. Diagnosed bipolar in my late teens. Diagnosed BPD recently. I have been on and off different meds for Bipolar for nearly 7 years without success. I tried therapy for yeara without success but psychiatric care in India sucks balls. I cant stess how useless the psychiatrists and therapists here are.I have through self awareness and combination of self therapeutic techniques reduced the intensity of the bipolar swings so that they are more or less manageable now.I am determined to control BPT using DBT. But without medication. Has anybody done it before? Keep in mind that I'll probably be paying out of my pocket for therapy and might have to go months without sessions cuz I don't make enough."
    },
    {
        "name": "t3_7ihzyr",
        "created": 1512796029.0,
        "ups": 1,
        "downs": 0,
        "title": "Ambition/life story",
        "selftext": "What if my dreams and ambition are not me? .I was born in india neglected by my grandparents and relatives for money when i was 3 years old , my grandfather shut down business and made sure we go poor and all my relatives followed him because he is rich .things weren't better I was black and bullies for that and then I started eating became fat new reason and new ways to bully .concurrently my dad ok our situation will improve after this happened or that happened all event happened and no change in life .i fall in love with a girl and she fell for my friend and I sabotaged their realtionship .Manipulating people , overtly identifying with bigger cause "
    },
    {
        "name": "t3_26fgyg",
        "created": 1401026589.0,
        "ups": 3,
        "downs": 0,
        "title": "Dramatic change!!!!!! RADICAL ACCEPTANCE!!!!",
        "selftext": "Hey all, I'm sure some of you have read stuff I wrote on here. So a little synopsis first... BPD hit me at around 21-22. I had just got married and was having work crisis where I would get in trouble at work and try to kill myself over and over again. Happend 3 times over a course of a year and a half. I've been hospitalized 7 times, diagnosed first with depression, then bi-polar, then BPD, PTSD, Anxiety and agoraphobia( newest since DUI). After 15 years of this, in the last 4 years I've had 2 16 week intensive DBT therapy classes, another 20 1x a week DBT class, and weekly individuals since 2011. I used to be a HEAVY drinker and got a DUI last Oct. I've mentioned this several timesin other posts but DBT skills don't work if you use any sort of substance. I've been on UA's for 9 months now in which I've been sober the whole time. I was put on SSD after a 2 year battle last June, THANK YOU SO MUCH!!!!!!! I haven't been able to work more then 2 days at a time with freakouts since 2010. I go through jobs like I change my underwear not kidding and sometimes it's nearly fatal for me to be in a bad work environment. I also went through a divorce because my ex hus was sick and tired of the suicide stuff so he sent me to CO and well got rid of me and a year later I signed the papers. Kinda shit has rained down since 2010 ( first suicide attempt). I can't seem to catch a break. However I don't know what the hell is going on but my therapist is seeing radical changes in the way I see things, perceive things ( huge for me) and making steps forward in life. This is huge for me. So, I am kinda going off the deep end in the \"Dramatic Change\" part. I'm moving to Australia in a month for a guy I barely know. Yes, this might seem manic and crazy but I'm more going for the experience of change, having to fend for myself, get around, BE BY MYSELF DURING THE DAY!!!! I need to get a workout routine, cook again, clean a house during the day, take the dog for walks again all this stuff I couldn't do for all those years until maybe a month ago. I'm also doing a 6 week intensive yoga training in freaking INDIA in Oct. I can't work in a stressful environment, I know that, I don't wanna be on SSD so what do I do.... be mindful, help others be mindful and get paid!!! I have a B.A. in poli sci- and like, my reasonable life goal right now career wise, is to teach yoga. LOL... I know!!! But hey, I'm realizing I have issues and I need to work with having the issues and still be productive and contribute. So that is another big venture.As far as the suicidal things, my Dad almost died this week, blood clots in the heart after a bad knee surgery etc. The thing about my Dad is he is insanely obese, he can barely walk, back pain, heart pain round the clock, diabetes you name it. He cant work because like me he cant hold a job ( PTSD VIETNAM). But after being back home for a year, I've noticed now, what I didn't before this last episode, he is non stop busy during the day, everyday. While he physically is destroyed, it never hurts his spirits, he has everything to be depressed about, can just lay down and give up but he doesn't. He fights soo hard to live everyday to the fullest.In this, there is quite a lot going on here. First I'm taking steps in a better direction, maybe crazy and wild to some of you reading but for me not that bad. I'm AWARE of stuff, get that!!!! I'm catching myself and being skillful more often than not. I have major change headed my direction and I'm embracing it instead of pushing back which is the norm for me ( CHANGE &amp; ACCEPTANCE). I'm being accepting about working again, seeing my strengths and pushing there where I can be pushed while accepting limitations. I'm setting goals without that doom and gloom feeling I always get that nothing is going to work out. I'm turning the mind in so many ways. And hell, if I crash, I'm accepting first that I might crash without that preordained failing feeling. I really believe I can really freaking rock it in India and come back wherever and help someone else out. I mean yogi's are really happy people... I really want that too. And lastly, we do this thing in DBT where you write down the thing that holds you back the most, put it in a balloon and  let it drift away forever. I've written down other things for this practice but have never been able to let my main one go. For memorial day, I think I'm going to write down that I'm leaving that suicidal crap behind, really, literally let go of it. It might be nice that I'm giving up on giving up on a day that we celebrate peoples lives that have died. I know, a lot to read. But I promise progress is possible. I'm proof of it. Still nuts and do crazy things but my intentions are really trying to do positive things. OH AND NOTICE..... I'm not basing my life on a guy. I'm basing is off things for myself. Yah the company will be awesome ( SO HOT and nice), I hope I fall in love and get married again... to who, maybe him? maybe not?... Not the end of the world but my existence does not depend on another person and I have never been this way before that I can remember. I wish you all good luck. Just wanted to share how things are looking up for me so I really hope things are looking up for you. Take care all!!!"
    }
]