[
    {
        "name": "t3_jj79c5",
        "created": 1603853556.0,
        "ups": 33,
        "downs": 0,
        "title": "Surviving a trauma that majority of society doesn't discuss/says it doesn't exist.",
        "selftext": "Not sure where to share this, under which community so sorry to post it here.I've seen so many groups about survivors of trauma and they get to speak about their experiences and people comfort them and say oh what happened to you isn't normal, etc. So if you're a victim of abuse, violence, etc people don't question whether it exists. People are aware child abuse, physical and mental and emotional abuse exist. What bothers me is that spiritual abuse is still seen as a taboo subject and not discussed openly.My experience is that I grew up with bad family on both sides. On the father's side and on my mothers side i have family members that are deeply into black magic. Both sides of families hated my mom so when she had me their hate turned on me as hurting me was the best way to hurt her. Long story short my own grandmother, aunts and cousins did black magic and curses on me using my pictures, my personal belongings, got me to eat/drink things that were sprinkled or mixed with ground from dead graves. After many years i was finally able to move away far so they cannot be in contact with me, but they still continue to track me and I have nightmares about what they did constantly. When you discover your own family is willing to perform spells to kill you and your mom (this was all so they would then inherit our land/money) it leaves you unable to trust anyone. Regardless of if black magic is or isn't real, the fact that some people do believe in it and are wanting to use it to hurt other and to kill others is sick.I knew about existence of black magic but for 20 years i never believed in it. It wasn't until i started acting not like myself, out of character and i felt robbed of my own free will that i finally saw it is very real and dangerous. I suffered so much abuse, i'm still dealing with the after math but the most painful part is not being able to share with anyone. There is only 2 places you can share: 1 is like those youtube videos of people saying they grew up in cults and were seeing demons/murders etc. That wasn't my case, it wasn't that drastic. The other place for support and i've written and researched on so many websites like this one, all of them majority will tell you how black magic doesn't exist, how it is all in your mind, can only affect you if you let it, how there is only good magic, positive vibes only etc. Or others suggest mental illness disorders/shizophrenia etc. I just want to say how damaging this is because as a society we are essentially telling abuse victim what they went through never happened and that they are the ones to blame.  It's like being raped and being told it's only rape if you believe in it, if you don't believe in it, it cannot hurt you and it was never rape and you're the problem. The problem with this type of abuse is you don't have a physical scar to show. Survivors rarely share out of fear people will think they're crazy or get locked up. The people i talked to who did go through the same as me, many were never okay again and considered suicide and feel unable to share their victim stories. They're not even allowed to feel like victims. We want to speak up so others won't be hurt like us but no one believes us, it's really screwed up. It's terrifying to go through trauma and then google it only to find results like \"it doesn't exist, it cannot hurt you.\"Only actual survivors understand the pain and the real dangers of b.magic. Mostly places like India or some muslims will talk about it and believe in it. But the Western world doesn't . Which is super weird because the West does believe in the positive sides of spirtiual things like yoga, quantum touch, energy healing, astrology, animals spirits etc but those same people say dark side of spirituality doesn't exist. So only survivors understand it's real. Imagine if only survivors of rape believed rape exist but no one else did. The biggest pain i feel is not with my trauma, but with being told told it wasn't real, and feeling powerless to stand up and speak out to stop the abusers."
    },
    {
        "name": "t3_iidstd",
        "created": 1598671982.0,
        "ups": 9,
        "downs": 0,
        "title": "Diagnosed with PTSD 2 weeks ago and getting worse with each passing day",
        "selftext": "I (20F) am a medical student in India. My college is in another city but I'm having to live at home since March this year due to the Covid situation. My mother is extremely controlling, she decides when I sleep, when I get up, what I eat, whether or not it fits in with what I want and what will help me study better. If I resist or try to reason with her, she lashes out badly, abuses me and calls me disrespectful. My father is an alcoholic and is addicted to tobacco, and he is also extremely intrusive and controlling to the point that he tracks down the location of my phone in college, all day, everyday, doesn't let me go out to have fun or on trips. I recently took a very important (read: the most important) exam of my career, the Usmle step1, for which I had plans to study in my hostel room in peace, but I had to study in some extremely difficult circumstances at home, cried everyday and had to bear a lot of unnecessary lashouts. Nonetheless, I was well prepared at the end and was getting excellent scores in practice exams, my exam was in a city different from my home city so I had to stay in a hotel the night before. Inspite of swearing up and down that he won't and promising me that he won't, my father consumed alcohol and annoyed me a lot the night before the exam, making me extremely angry, distressed and having me end up extremely sleep deprived for the exam, because of which I could not give my best and am now extremely disappointed with the results. Now not only does he not accept his mistake, my father says that all he did wrong was \"give me everything I asked for\" and both of them get angry and shout at me when I cry and say I don't have the capability to be happy. They even say that I have \"ruined\" their lives and once when I was crying, my mother came in started beating me up and said she won't stop till I stop crying. I can't even look at books without having the entire day of the exam come back to haunt me, can't talk to anyone without being reminded of how my father manipulated me into not having a social life before, can't even have coffee without thinking about how he broke the bottle I had on the morning of my exam, haven't slept in days. I really need to be functional again as being in a medical college I can't afford to cry all day, but am having a very hard time even getting out of bed. . Any help and any advice would be really appreciated."
    },
    {
        "name": "t3_ddt5fb",
        "created": 1570337541.0,
        "ups": 1,
        "downs": 0,
        "title": "Need guidance and advice. Feel like I have no options and no one to turn to.",
        "selftext": "I am 33 years old, live with my GF in her parents basement suite on the west coast of Canada. I am a freelance developer who left his main job years ago due to increase in symptoms to work more care free as a freelancer. I have been supporting my GF for years through her chronic illness that we are still trying to get a diagnoses for.I was diagnosed with early childhood trauma and PTSD about a year and a half ago. I was shocked but after researching it made complete sense. I have been struggling my entire life with the feeling of dread lurking in every thought, getting triggered by random things that I can't identify, completely unable to do anything social, etc. All of these things just got worse and worse until here I am today struggling for my health, my sanity, even to do basic things. The reason I am reaching out is because my GFs sister and her husband recently moved in to have their baby. They are both 26 years old, my GFs younger sister. They live in India most of the time where her husband is from. Her husband is from a very wealthy family. They moved in to have their baby here so their baby could have dual citizenship (makes sense). I love them both to pieces but they have made this household a living nightmare for me.My GFs parents are very kind and generous and I could never pay them back for their kindness to let us stay here. They are also very noisy and oblivious to other peoples needs. Especially her father (whom my GF does have some relationship issues with) is narcissistic. Both of her parents carry some resentment towards my GF for her illness because she is not as \"easy\" to love as their other daughter. The issue isn't their feelings though, I just wanted to try and paint a picture for their demeanour a bit. They are loud at the best of times but have kindly worked with us over the last couple years to help reduce noise to keep us sane. Since her sister moved in it has been a circus. The issue I have specifically is with the noise. I have known that noise is my biggest trigger for a long time. I grew up in a violent, drunken, noisy house. I would wake up around 10-11pm with the stereo blasting and I would know that something bad is going to happen. I am the oldest of my siblings and I would sneak into their rooms and rush them back into my room while the fighting was going on. It would usually end with police and us getting taken away etc. The older I got I would just recede into video games or a TV show, find some easy method of escape. I am very sensitive to thumping and banging, loud music / tv. The last month has been so bad I just can't live. I can't do anything. I am so upset I just don't know what to do. We can't move out yet because I don't earn enough monthly to support us. I can't work on my work because I am so stressed beyond belief. I don't even have the energy to clean which is something I both enjoy doing and must do to keep my sanity. I am getting constant headaches, heartburn and acid reflux, and shingles in my leg from the stress. There are no good free mental health options here in Canada. I have tried them and they take a year to get in and once you do you get about 15 minutes with a psychologist who is only interest in giving a random drug to then you are sent away. I want to keep going with my EMDR but it is SO expensive. I love my brother and sister in-laws. I don't have anything against them, same with the parents but I don't know what to do. The parents I can tell are beginning to get annoyed by our request to manage the noise.What should I do? I have no safe place to go to, no money, no good free options for mental health care. My GF is in a similar vote but for her physical health. I don't know. It might sound trivial but my life is completely at a standstill. I can't even relax, most of my days are just me being paralyzed unable to do anything."
    },
    {
        "name": "t3_bytge3",
        "created": 1560169694.0,
        "ups": 1,
        "downs": 0,
        "title": "Hey guys , i am a college guy graduating next year , don't know do i suffer from PTSD or not , wanted your views on it",
        "selftext": "I am from a city in India named Calcutta (former British India capital ) , my father is a workaholic, he destroyed my mother's teaching career , shouted at us and had arguments whenever possible with her to show his dominance always like always ,  I was a kid in junior school I literally used to cry at 3 am in the morning just to make them stop from shouting . I was such a kid that I had never seen 1 am in the clock before , always went to bed at 11 but cried to stop arguments at 2-4am in the night and it was becoming as if a routine for me .As a kid i damaged  things like toys toothpaste soaps (I guess Evey kid does that ) but my father (he is not alcoholic, but workaholic) kept shouting at me I grew up fear against him, was scared of him even till now I don't open my mouth infront of him or even argue with him because that image will never cease to exist in my mind , BUT I AM VERY FREE AND DO CARELESS STUFF INFRONT OF MY MUM , she is very supportive .He stopped her from teaching and believes woman should only work on household stuffs , abused her maternal and paternal sides like using slangs . I never abuse anybody referring to their parents ( my mum told me never to do so ) and after seeing what it can do I never ever did .I was just asking are there any one of you out there in the whole world who experienced the same trauma as a kid and still gets haunted by that.P.S - he is a guy who supports the family so I never question his qualification , but after I graduate I am willing to cut ties with this shitty relation.Thanking youVamp"
    },
    {
        "name": "t3_aer8es",
        "created": 1547206601.0,
        "ups": 4,
        "downs": 0,
        "title": "Trauma, addiction and healing.",
        "selftext": "  Tl’dr: was bashed 19 years ago, used drugs to numb the emotional pain not knowing how much it has affected me. Have identified my issues and that I need to address my baggage but unsure how to get this thing off my back.    Backstory: When I was 16 I was at a party with some friends, we were all drinking and I had drank about 6-8 beers or so and was happily intoxicated. Midway through the party some guys arrived, I recognized one of them (we’ll call him JJ) as one of the kids a year or two below me at school, JJ had a reputation not to be fucked with, whether it was his older brothers activities or other I am not sure but I always tried to stay away from these types of guys.    Shortly after they arrived (found out later they we not arrived and ‘gatecrashed’ the party) one of them ( I don’t remember who) started pushing around a kid, I sort of knew him as being a bit of a weakling and he clearly wasn’t interested in a fight and looked distressed. They proceeded to mock him, push and punch him, take his things and generally traumatize the poor guy – so I spoke up.    I was sitting on some brickwork, about 3 courses high had a girl I was tuning next to me (I’d liked her for a while and things were going well in that regard).    I looked at the guy who was picking on this kid and without thinking blurted out “hey just leave him alone man” to which I heard a reply to my left. Little did I know that one of the gatecrashers (we’ll call him SS) was standing right next to me, he said “what cunt?” and as quick as anything punched me from my rear left side, I never saw it coming and was sitting down at the time so had no chance.    The initial punch rocked me, I leaned over to get my balance to stand up, put my hands on the ground for balance and was hit with another right. This knocked me to the ground and then I got kicked in the face, back, ribs before I was knocked out, I am not sure which blow caused me to lose consciousness or who was delivering the blows, I remember it coming from seemingly everywhere so assume more than one person was on me.    Some time after I came to, blurred and disorientated I was helped to my feet by a friend. I asked him what happened and he said just go home man, you need to get out of here now. I grabbed a half full bottle of Jacks on my way out and remember drinking the rest straight as I stumbled home feeling my indented cheekbone, crying, confused and thinking about what this meant for me. I remember having a feeling of “why didn’t any of my friends fight for me?”.    I got home and went straight to my room and lay down, my mum came in, it was very unusual of me to go straight to my room, I always made time to sit and talk with my mother at night especially after a party or event. She came in and the first thing I said, in a broken sobbing voice, was “don’t turn on the light” She immediately turned the light on and asked me what was up. I showed her my injuries and explained what had happened and it was off to the emergency department.    Saturday night in emergency is not fun, especially when you have just been bashed and are coming down off too much booze. I vomited over and over, saw a Dr, was too drunk to operate on and waited for my turn under the knife. Surgery was performed without issue and I ended up with a plate, two metal wires and some screws through the eye floor and upper brow, specifically the zygomatico-orbital foramina to keep my face from dropping and bring the structure back into line.    After surgery I woke up feeling groggy, coming down from it all was not an enjoyable experience. I was hooked to IV pethidine on demand via a button that would release a dose when pressed which I thoroughly enjoyed and used frequently throughout recovery in the hospital – this is where I got a realisation for how good drugs are.    I couldn’t eat proper food for two weeks and pretty much stayed in my mother’s bed on Panadeine forte (codeine) eating through a straw for this time. None of my friends came to see me whilst I was in recovery. The bruising was horrendous.    I had extensive nerve damage to the left of my face and experienced sharp, shooting pain/discomfort when brushing my teeth on the upper left quadrant for about 5 years following.    The plates, screws and wires can still be felt on my face today, I used them as a show off for some time to deal with things, I think. Grossing people out by getting them to feel the screws.    Current day: All that happened 19 years ago and I never really took much time to have a real introspective look into how that affected me.    I am 35yo, happily married, run my own business and have two beautiful children of 6 &amp; 9yo. Regardless of my picture perfect family situation I have always felt unfulfilled and a want for something more, I found relief in drugs, weed was always a friend of mine, as I grew older I started to use opioids by cold water extracting OTC codeine forte tablets and used to mix with small amounts of alcohol to get fucked up. I used alcohol daily for years, sometimes going on binges. I dabbled in meth but told myself I didn't like it as I think I could have easily overindulged.    Sometime in 2016 I started to go through a mental change, a maturity if you will. I started looking into philosophy, spiritual states and self-discovery, my father, as I knew him, had always been spiritually connected and I looked up to him for achieving such a mind state (he left my mother when I was young and moved to India for his spiritual journey). I researched psychedelics for about 18 months, looking into the changed mindset of people who use them for healing. At this stage I had no idea I was carrying any baggage and put it down to me maturing mentally.    I ordered some LSD from a vendor and started growing mushrooms. I grow my own weed also.     My first trip: I started with 75µg and this was giggly and enjoyable. I upped it to 150µg another time and had a great time until I smoked some weed and fell into a negative panicky headspace. I decided I wanted to go further, I discussed my intention with my wife who accommodated my request and stayed somewhere else for 24 hours. I dropped 300µg at home and had a pretty intense 12 hour ride, I intended to be introspective and utilized eye shades and a playlist which I put together from my research into tripping as well as the company of my dog and spending time in my garden which I work so hard to maintain.    All in all the trip went well, I got a lot from it and saw behavioral changes in the sense of seeing things from other peoples perspectives and be a lot more understanding, confident and motivated.    Not totally satisfied with where I was at I ordered some MDMA, (still unaware of my past weighing me down at this time). I dropped 100mg solo one night and had a great roll. I sat outside and had such a overwhelming feeling of contentment – great.    I haven’t tried the mushrooms but managed to grow about an oz which will be more than enough for my lifetime.    I have been dosing LSD for about 6 months, using 20µg as a pick me up and motivational tool about bi-monthly, this has been incredibly positive. I still battle with alcohol addiction, though this year have had more days sober than not which is a huge shift.    Yesterday I dosed 20µg and it had been about 4 weeks since my last dose, I smoked some weed at night about 10 hours after dosing, I had the intention to induce a light trip as weed has given me that headspace after LSD. I lay down alone in my sons’ bed and put in the headphones playing my trip playlist and trying to extract some nostalgia from the tracks.    I let whatever come in be present and let my mind go where it wanted, I have never had a good memory (put it down to my excessive cannabis use as a teen) but to my surprise I started to remember the violent event that changed the course of my life back in 1999. I replayed the event in my mind, from the moment SS walked into the party, locked onto me, stood next to me, to being hit, kicked and ‘recovering’. I had the feeling that SS intended to hit me as soon as he walked into the party. I realised that I have not dealt with this trauma, I had an overwhelming feeling of being weighed down by what happened. I realised that the assault changed a few things for me.    1. My social status was cut down, from a confident, happy, witty 16 year old with lots of friends I became defensive, subdued, paranoid and weak minded.2. I didn’t get to finish tuning that girl and after the event she was no longer interested.3. The offender went on to build a reputation from bashing me, this is probably the part that hurts the most.    Well it’s the next day, I spoke with my incredibly supportive wife first thing this morning and she was quick to dismiss PTSD. She has an attitude of not diagnosing anything for whatever reason, I guess she doesn’t want a condition to be a fixation of my suffering – I’m still not completely sure here.    I feel I have recognized the elephant in the room so to speak and am now ready to deal with it. I just don’t know how. I really don’t want to see a therapist.    My wife and I have agreed to roll together and have a chat about things, I think this will be a good first step in getting it all out, from there I don’t know what I am going to do, probably trip again on LSD and probably try those mushrooms when they call my name also and continue to reduce my drinking and change my relationship with alcohol.    I have another part of me that wants revenge for what SS took from me that night. I keep a folder with social media info, photos, locations, SS's family ties, SS’s business name and number, vehicles etc. I think sometimes about going and spray-painting his work van with obscenities or other acts of vandalism, I sometimes even think about donning a balaclava and baton and smashing the cunt’s head in – I have too much to lose to take this path though and reason takes over.     Thanks for reading and if you can provide any insight as to how one should or can deal with things like this it’s be greatly appreciated, even just writing it out has made me feel better.If you think there is another place on reddit that I could post this please let me know."
    },
    {
        "name": "t3_4aoq17",
        "created": 1458176472.0,
        "ups": 4,
        "downs": 0,
        "title": "I have had it. I can't take it anymore.",
        "selftext": "I give up, all right??!!I fucking give up. I can't take this shit, I just can't.My whole life has been nothing but a huge fucking mess and I feel like the worst piece of shit that has ever existed in this goddamn fucking world.Everything that has happened to me was like it was begging to make me like horrible and miserable.I was a victim of bullying for 5 years  when I was 11 years old, two incidents of them, they tried to pull a \"prank\" where I nearly died because it was funny for them to put a pillow on my face when I was sleeping just because it was so funny to see me suffocate.I am a victim of my own doing by allowing myself to go through an eating disorder when I was 17. Lasted for 3 years. Got little to no help whatsoever because people thought that I was either exaggerating or looking for attention because I was a guy, and later they made a Facebook page of it, because .... haha, for the lolsAfter that, I was sexually assaulted by someone who I thought he was my friend, only I did not even notice myself that he was only there for me so that he will put a dick in my ass.And right now, I am supposed to be considered as a recovering alcoholic and drug addict because I still cannot find it easy for me to accept for has happened, especially because I was repeatedly abused by own mother, calling me weak and frail when I asked her for help.And it's not just my life is hell.It's the whole goddamn world.Everywhere I go, everytime I read about everything that happened, I keep losing whatever slightest humanity I have left inside me because humanity seems to still have that compulsion to want to destroy, kill, rape, violate, vandalize, abuse or whatever the fuck method they can come up with because .... humanity.Humanity sucks.All we ever did was do nothing but harm over and over and over again. And the more I study in this fucking goddamn planet, the more I feel humiliated to call myself a human because all I see in this world is nothing but whatever dust, dirt or blood that people do for corruption, greed, lust, money, power, politics, religion, you fucking name it!!! I cannot feel safe to live in a world that is doomed to to destroy itself every single second it still stands.How the hell can I focus on my school work when the entire world has a big giant dot pointed at many countries and we are so close to a nuclear holocoust? How can I focus on my future when I keep reading over and over again when there is a narcissistic moron who is being presented to become the next president of the US and always keeps winning?How can I focus when I keep hearing over and over again how humanity always seems to want to fuck up everything and want to make everyone's lives worse like a goddamn immature child? North Korea, India, China, USA, Italy, Turkey, Saudia Arabia, India. All countries where I hear nothing but bad news over and over again. Whether corruption, greedy politics, or unfair laws and judgement.It's like humanity is born to be evil.How can you live with that?How can I focus on my studies when I see the entire world literally burning??!!How can I focus on my studies where I feel like I have a big stamp on my head saying \"LOSER! MORON! FREAK! FAILURE! DIRT!\"How can I focus if I am too stuck in my own troubles and cannot get of them or at least cannot find the courage to accept them and let them dictate me on who I am?People told me I am smart and capable but my grades say otherwise and I can't take it. All the fear, the anger, the rage, the regret, the grief!I can't take all of this!! I can't!! I feel like I am in the Hunger Games, forced to survive or in some zombie apocolypse, surviving my ass and waiting to die, cannot trust anyone becuase I see everyone as a threatOh if you are here to dehumanize me, humiliate me, belittle me or try to make feel as miserable or pathetic with all your miserable, toxic comments just like every other good damn asshole I have encountered on the fucking internet when I tried to ask for help ... then please, with all due respect, GET YOUR ASS OFF THIS FUCKING POST AND LEAVE IT FOR SOMEONE ELSE WHO GIVES A SHIT!!! IF YOU ARE WILLING TO BE HERE TO ABUSE ME, THEN SAVE IT AND GTFO!!!! I'M WARNING YOU, DON'T YOU FUCKING DARE CROSS THAT LINE!!! DON'T YOU FUCKING DARE!!!!"
    },
    {
        "name": "t3_884n6w",
        "created": 1522384046.0,
        "ups": 2,
        "downs": 0,
        "title": "Life Survival Guide: The Mindful Book of Me",
        "selftext": "Travel, I am told, expands the mind, horizons and acceptance of other ideas, cultures, religions.  When I ask what the time limit is in any area visited or travelled through I have been met with blank stares and a sort of puckering of the lips that makes me think of a fish trying to form words.&amp;nbsp;Travel may expand our romantic idealism.&amp;nbsp;Living in a country does not.&amp;nbsp;There are exceptions of course, there are those that I met in Asia who considered “living in a foreign country” to mean spending as much time in the Club by the pool or at some or other function, lunch or breakfast and shopping.  But if you’re like me and not a peopley person, you seek out the underbelly of any country and poke at the fabric to see what it’s made of.  In Tokyo my escape was to hang out in Aoyama Cemetery, I used to joke that my favourite Japanese lived there because for the most part the Japanese viewed me as a despicable foreign whore, I was spat on, ignored by waiters in cafes where Japanese would move seats so as not to be near me, chased off a subway by an angry granny with an umbrella, threatened with a beating from random strangers, oh it was fun times.  Why?  Oh, I look remarkably like one of their favourite foreign porn stars.&amp;nbsp;Yup.&amp;nbsp;Uncanny resemblance apparently.&amp;nbsp;(When I first discovered the root of my woes in Tokyo I was devastated, called one of my oldest and dearest friends in London, who pretty much slammed the phone done in his race to China Town to check it out.  Took some detailed researching apparently but he reported that it was in fact true.  Ah, friends.)&amp;nbsp;All of this is by way of arriving at Buddhism and Shinto-ism.&amp;nbsp;I’ve met the ladies who yoga, who namaste and granola.  Keep the Buddha in their “quiet space” and believe it to be all love ’n’ light without having read much on it other than the handy dandy book of mindful quotes they got themselves at Starbucks the other day.  Has it struck anybody as odd that these individuals have a cognitive dissonance when faced with Buddhists massacring innocents in the news?  So much so that I’ve noticed in Canada none of the liberal press report on it, I think for fear of upsetting the granola yogis living here.&amp;nbsp;I have spent my fair share of time in downward dog, have briefly taught and granola isn’t so bad as colon cleanses go.  But the whole attraction of the fake namaste left me cold.  The precepts of both Buddhism and Shinto-ism are as entrenched in brutality as any other rigid ideology, religious or other.  Oddly enough, however, yoga has its roots in Hindu faith not Buddhism: it never ceases to amuse me when a yogi gets those mixed up with an elephant faced Buddha with twelve arms sits smoking joy sticks in their quiet space, I giggle happily.&amp;nbsp;No religion is without its darker side.  Sikhism for instance was, up until Trudeau’s dress up party in India, my favourite of all global religions other than Christianity (not the evangelical variety).  I follow a number of Sikh thinkers, philosophers and teachers.  But just like that my idealistic views of the Sikh ideology was blown up right beside the passenger airplane Canada failed to protect.  Ah people.  It made me sad because for the most part those who are neither Sikh nor Hindu had, until that farcical Trudeau prance around India, no idea what Sikhism was or stood for.  Now say the word Sikh and it is linked inextricably to murder, terrorism and extremism.  If Trudeau ever offers to help you with something you care about, run away.  Run far, far, far away.&amp;nbsp;Buddhism appeals to the yogi because at its heart they believe it is an idea of “acceptance”.  Of living happily in the maelstrom of pain, frustration, all that crappy life stuff and being “content”.  They completely miss the actual point: disassociation.  Disassociation from the world, outcome, relationships, all that disharmonious rubble of life.  The Buddhist ideal of the monk living happily on the end of a pole: living on nothing but air and patiently enjoying the discomfort of the pole up his bum as he waits for the nirvana of rebirth, is a bit of a clue.&amp;nbsp;This is why the other day when I trundled into the Golden Ears Provincial Park for Spring Break with my girls to the campsite we had booked I was met with an extremely angry, screaming clearly granola eating yogi who took high offence that we intended to park our rather long r.v. in the camp next to the one she had chosen to commune with nature.  She was clearly in crisis.  Unhinged and crashing like a wounded beast against this thing we call life.&amp;nbsp;The problem with holding on to wafer thin ideologies that you haven’t researched deeply or studied is that when life hits you in the face you have zip to hold on to.  Nothing.  I can be as calm as a monk up a pole if I give up caring, if I disassociate from everything and everybody.  In fact, I have the perfect brain for it.  But the moment you start to care about an outcome, a person or a thing you’re going to fall off that pole and there’ll be nothing at the bottom but rocks and derision.&amp;nbsp;You can read that little book of inspirational quotes all you like you will still be in a bad place with zero support.  As the screaming banshee was standing there throwing her stick collection in my general direction and over using her middle finger clearly demonstrated.  Later on the ranger caught up with her (she had screamed abuse at a six year old a little further on from us) and in his quiet way found out that she was in the middle of a relationship crisis and was indeed, lost.&amp;nbsp;How do you protect yourself from ending up in the middle of a provincial park screaming abuse at children and random strangers?&amp;nbsp;Boundaries.&amp;nbsp;Not ideologies.  Pure and simple, well understood and clearly defined boundaries.&amp;nbsp;For yourself and others you decide to keep in your life.&amp;nbsp;A well researched, carefully studied little survival book of Mindful You.  A lot is written about Boundaries in relation to others and their treatment of you, but what is there about Boundaries in relation to how you treat you, how you treat others?  Not much in our world of rights without responsibilities.  That’s not going to work out well.&amp;nbsp;Boundaries for self should start with but not be limited to these.&amp;nbsp;Inner voice: the various voices we use to speak to ourselves needs to be studied and acknowledged.  Changes made if that voice is your mother’s or an abuser from your past.  The voice should be yours and kind, always, kind.&amp;nbsp;Body awareness: your body, your choice.  You are in control of your body regardless of what challenges we face in life whether social, financial or health.  A lot of us are trained not to hear our bodies and we ignore its instinctual reactions.  Stop ignoring it.  Listen to it, learn to hear it and learn to understand it.  Equally, your urges and desires need limits and awareness of how your needs are impacting those around you.  You are not the only one that matters.&amp;nbsp;Feelings/Emotions: “feelings matter” … no, no they really don’t.  They matter to YOU but they hold zero sway in the world at large.  Acknowledging your feelings is important but so is reigning them in especially for those of us with PTSD.  Our feelings lie to us a lot.  We often feel like the world is ending, our thinking goes to black/white and we fail to access our rational frontal lobes.  To create pause, time and a modicum of rationality boundaries are needed to contain our emotional outbursts and overwhelming choking feelings.&amp;nbsp;Situational Awareness: we are all aware of our surroundings all the time whether we are tuned into it or not.  Those of us with PTSD are crushingly familiar with the other sensitivity of our highly tuned sensors.  That’s a good thing.  Situational awareness even the kind that has us on high alert and avoiding crowds keeps us safe, allows us to see through the masquerade that people put on straight to the heart of who they are and what they want.  Use it, value it and over time you will control it.  Listen to it.  Allow it to create healthy boundaries for you rather than keeping you locked in your basement, start at a cemetery like I did in Tokyo with folk that don’t move around too much.&amp;nbsp;Pain: a lot of us live in constant pain, so much so that we have found a way to turn it off.  What happens when you do that is a gradual decline in all our systems: physiological and psychological.  Pain has a source, I know what my sources are and I know who and what to avoid to stop the spiral.  It’s not always successful but it’s put me back in control of me, it’s created healthy boundaries for me and I live with a lot less pain and a lot less pharma help.&amp;nbsp;Self-care: grooming, pride in dress, washing.  They might seem utterly pointless but they are extremely important.  Taking time to take care of you and spend time caring for you is golden, it creates a sense of well-being on a cellular level and MUST be part of your boundary routine for a better life.&amp;nbsp;Clean Clear Living Space: junk, jumble, noise are destructive.  I have a rule that if I haven’t used or worn an item in a year it is given away.  I need space to breath, I require cleanliness and I require order around me.  That doesn’t mean sterile or non-kid friendly, far from it.  Each of us will find our happy compromise: but be honest with yourself, many of us find “content” in purchasing things, surrounding ourselves with them in a vain attempt to buy happy.  It won’t work.&amp;nbsp;Create everyday: each day do something creative.  That can be a walk in the woods where you simply take time to notice the tree barks or the way the light comes through the canopy.  Creating allows our bodies and minds to relax, unwind and heal.&amp;nbsp;Kindness: practice kindness towards others.  Listen to yourself and your interactions with others, judge them on the basis of “kindness”.  I fail regularly on this one, but I get up each morning and try it all over again.&amp;nbsp;Finally, I’d set a boundary of self-reliance first before all else.  Trusting me has never been a tough gig as I’ve only ever had me to count on.  I see in others a disturbing lack of self-trust, a belief that “I can’t” instead of “How bad can this go?”.  Yesterday I had to haul the r.v. to the Husky to do a sani-dump, fun stuff of camping!  The truck and r.v. are about 50ft long all in and to get out of the Husky I had to back out onto a highway.  Perhaps it is my lack of rational thought that allows me to hum to myself and slap it into reverse with the thought “Well, how bad can this go?” but I’d far rather that than feel incapable or vulnerable.  Self-reliance and self-belief are incredibly important to learn, practice and strive for.&amp;nbsp;And if you ever end up in Tokyo looking like a porn star with clothes on: smile, sign the autographs and walk on head held high.  Life is going to throw curve balls at you, the only thing that’s going to pull you through is a straight back, chin up and step off the line.  When you get beaten down onto the mat, take a deep breath, collect and get back up again.  Sitting on a pole waiting for the  nirvana of rebirth isn’t as fun as advertised, the nitty and gritty of surviving life, however, is.&amp;nbsp; This piece of art I’ve used is a perfect example of how having solid boundaries can help me weather any storm.  I know I’m going to get kicked, I know I’m going to be in pain but I also see the beauty in between the clouds.  This is a painting I did freezing in the hail and storm on the rocks of Alloutte Lake.  The waves crashed, the mist covered the mountains but every now and then brilliant colour would flash.&amp;nbsp;I do not fear the storm, I fear captivity."
    },
    {
        "name": "t3_5zbv0f",
        "created": 1489523952.0,
        "ups": 11,
        "downs": 0,
        "title": "I've been having nightmares and panic attacks again. My job is aggravating my ptsd.",
        "selftext": "It's been about 4 months, roughly, of no nightmares. It was nice. I started a job that's heavily predominantly male staffed (I'm a lady), the only other female is my assistant manager and best friend but she isn't as supportive as she wants to be.Most of the dreams, contrary to previously, are mostly of my rapist and his best friend. The three of us had a triangle of sexual stuff, me being the main focal point (I was fwd with the best friend then was raped/dated (durr didn't realize at first what happened) by the dude).I'm seeing the rapist as a fatter version of who I remember, sneering at me and making fun of me. Or he's coming into my work a town over and lighting it on fire and I'm trapped inside. His best friend is always present, always making comments that demean me or take away my validity of what happened (which he already has done). Or he's following me everywhere which keeps with my awake mind, though I'm not hyper vigilant at this point yet... yet. Then I had a nightmare of my mom having a past of being kidnapped as a 20 year old and used as a sex slave/makeshift wife in India (we're American). I kept asking her why she stayed when given the opportunity to leave and she said that no one would believe her if she left because the guy who kidnapped her was a highly paid film director. During the dream, she had escaped because she slipped a note to an actor and he shipped her back to her family 20 odd years later.They're just either really odd but terrifying dreams, or just terrifyingly real dreams and I am having a hard time at work. I should be able to suck it up for 2 days a week, but when I'm driving (I'm a delivery person) and the radio is talking about a local rapist on the loose (small town), it won't matter if I change the station or turn it off because I've already dissociated and my day is shot. Or if a coworker brushes up against me after I've repeatedly told them I don't like being touched, I get into a shitty mood until they leave for the day. If they ask for a hug *again* I get triggered *again*.I'm on disability for something else, randomly got this job because of my friend saying it's only 16 hours a week of driving, which I love driving. I know that the job is aggravating my ptsd, I just don't know how to make it stop without flipping shit on people at this point.TL;DRMy job is aggravating my ptsd. Make it stop."
    }
]